      *****************************************
      * WORKING-STORAGE SECTION  :  LIBSCR    *
      * PROCEDURE DIVISION       :  LIBSCR_P  *
      *****************************************
       01  C-DERR.
           02  FILLER.
             03  ERR-BUZ  PIC X(5)  VALUE X"1B4210".
             03  ERR-DATE PIC X(27) VALUE
                  "***  Ë½Þ¹Ï½À° READ ´×°  ***".
