      **********************************************************
      *****     プリント　ファイル　(３３行／２０６列)     *****
      **********************************************************
       77  SP-R   PIC  X(206).
