      ****************************************
      *****     ÇdÇmÇcÅ@ÇrÇsÇ`ÇsÇtÇr     *****
      ****************************************
       01  W-STAT.
           02  NOC            PIC  X(002) VALUE "00".
           02  HTB            PIC  X(002) VALUE "01".                   ÿ¿∞›
           02  C1             PIC  X(002) VALUE "02".                   áT
           02  C2             PIC  X(002) VALUE "03".                   áU
           02  ADV            PIC  X(002) VALUE "04".                   ADVANCE
           02  FUK            PIC  X(002) VALUE "05".                   SHIFT+ÿ
           02  SKP            PIC  X(002) VALUE "06".                   SKIP
           02  BTB            PIC  X(002) VALUE "09".                   B SKIP
           02  PF1            PIC  X(002) VALUE "P1".                   PF1
           02  PF2            PIC  X(002) VALUE "P2".                   PF2
           02  PF3            PIC  X(002) VALUE "P3".                   PF3
           02  PF4            PIC  X(002) VALUE "P4".                   PF4
           02  PF5            PIC  X(002) VALUE "P5".                   PF5
           02  PF6            PIC  X(002) VALUE "P6".                   PF6
           02  PF7            PIC  X(002) VALUE "P7".                   PF7
           02  PF8            PIC  X(002) VALUE "P8".                   PF8
           02  PF9            PIC  X(002) VALUE "P9".                   PF9
           02  PF10           PIC  X(002) VALUE "PA".                   PF10
           02  PF17           PIC  X(002) VALUE "FW".                   PF17
           02  PF18           PIC  X(002) VALUE "BW".                   PF18
           02  PF21           PIC  X(002) VALUE "UP".                   PF21
           02  PF22           PIC  X(002) VALUE "DW".                   PF22
           02  DW             PIC  X(002) VALUE "DW".                   PF22
