      **************************************************
      *****    ワークマン受信ファイル（ＥＤＩ）    *****
      *****           ( WMJCF ) 1301/1             *****
      **************************************************
       01  WMJCF.
           02  WMJCF_PNAME1    PIC  X(005) VALUE "WMJCF".
           02  F               PIC  X(001).
           02  WMJCF_LNAME     PIC  X(005) VALUE "WMJCF".
           02  F               PIC  X(001).
           02  WMJCF_KEY1      PIC  X(100) VALUE SPACE.
           02  WMJCF_KEY2      PIC  X(100) VALUE SPACE.
           02  WMJCF_KEY3      PIC  X(100) VALUE SPACE.
           02  WMJCF_SORT      PIC  X(100) VALUE SPACE.
           02  WMJCF_IDLST     PIC  X(100) VALUE SPACE.
           02  WMJCF_RES       USAGE  POINTER.
       01  WMJC-R.
           02  WMJC-001        PIC  X(003).
           02  WMJC-002        PIC  X(013).
           02  WMJC-003        PIC  X(004).
           02  WMJC-004        PIC  X(013).
           02  WMJC-005        PIC  X(004).
           02  WMJC-006        PIC  X(012).
           02  WMJC-007        PIC  X(004).
           02  WMJC-008        PIC  X(080).
           02  WMJC-009        PIC  X(255).
           02  WMJC-010        PIC  X(005).
           02  WMJC-011        PIC  X(014).
           02  WMJC-012        PIC  X(013).
           02  WMJC-013        PIC  X(004).
           02  WMJC-014        PIC  X(001).
           02  WMJC-015        PIC  X(013).
           02  WMJC-016        PIC  X(013).
           02  WMJC-017        PIC  X(013).
           02  WMJC-018        PIC  X(080).
           02  WMJC-019        PIC  X(008).
           02  WMJC-020        PIC  X(008).
           02  WMJC-021        PIC  X(008).
           02  WMJC-022        PIC  X(001).
           02  WMJC-023        PIC  X(001).
           02  WMJC-024        PIC  X(001).
           02  WMJC-025        PIC  X(003).
           02  WMJC-026        PIC  X(003).
           02  WMJC-027        PIC  X(001).
           02  WMJC-028        PIC  X(001).
           02  WMJC-029        PIC  9(004).
           02  WMJC-030        PIC  X(001).
           02  WMJC-031        PIC  X(001).
           02  WMJC-032        PIC  X(001).
           02  WMJC-033        PIC  9(004).
           02  WMJC-034        PIC  X(001).
           02  WMJC-035        PIC  N(020).
           02  WMJC-036        PIC  X(020).
           02  WMJC-037        PIC  9(009).
           02  WMJC-038        PIC  9(001).
           02  WMJC-039        PIC  9(005).
           02  WMJC-040        PIC  X(001).
           02  WMJC-041        PIC  N(020).
           02  WMJC-042        PIC  X(020).
           02  WMJC-043        PIC  9(005).
           02  WMJC-044        PIC  X(001).
           02  WMJC-045        PIC  N(020).
           02  WMJC-046        PIC  X(020).
           02  WMJC-047        PIC  9(005).
           02  WMJC-048        PIC  X(001).
           02  WMJC-049        PIC  X(001).
           02  WMJC-050        PIC  X(001).
           02  WMJC-051        PIC  X(001).
           02  WMJC-052        PIC  X(001).
           02  WMJC-053        PIC  X(001).
           02  WMJC-054        PIC  9(006).
           02  WMJC-055        PIC  X(001).
           02  WMJC-056        PIC  N(020).
           02  WMJC-057        PIC  X(020).
           02  WMJC-058        PIC  9(006).
           02  WMJC-059        PIC  X(001).
           02  WMJC-060        PIC  N(020).
           02  WMJC-061        PIC  X(020).
           02  WMJC-062        PIC  X(001).
           02  WMJC-063        PIC  X(001).
           02  WMJC-064        PIC  X(001).
           02  WMJC-065        PIC  9(002).
           02  WMJC-066        PIC  9(002).
           02  WMJC-067        PIC  X(001).
           02  WMJC-068        PIC  9(002).
           02  WMJC-069        PIC  X(001).
           02  WMJC-070        PIC  X(001).
           02  WMJC-071        PIC  X(001).
           02  WMJC-072        PIC  X(001).
           02  WMJC-073        PIC  X(001).
           02  WMJC-074        PIC  X(001).
           02  WMJC-075        PIC  X(001).
           02  WMJC-076        PIC  X(001).
           02  WMJC-077        PIC  X(003).
           02  WMJC-078        PIC  X(001).
           02  WMJC-079        PIC  X(010).
           02  WMJC-080        PIC  X(010).
           02  WMJC-081        PIC  X(010).
           02  WMJC-082        PIC  X(001).
           02  WMJC-083        PIC  X(001).
           02  WMJC-084        PIC  X(001).
           02  WMJC-085        PIC  X(001).
           02  WMJC-086        PIC  9(002).
           02  WMJC-087        PIC  9(002).
           02  WMJC-088        PIC  9(002).
           02  WMJC-089        PIC  X(001).
           02  WMJC-090        PIC  X(001).
           02  WMJC-091        PIC  X(001).
           02  WMJC-092        PIC  9(002).
           02  WMJC-093        PIC  9(002).
           02  WMJC-094        PIC  X(001).
           02  WMJC-095        PIC  X(001).
           02  WMJC-096        PIC  X(001).
           02  WMJC-097        PIC  9(002).
           02  WMJC-098        PIC  X(001).
           02  WMJC-099        PIC  X(001).
           02  WMJC-100        PIC  X(001).
           02  WMJC-101        PIC  X(001).
           02  WMJC-102        PIC  X(001).
           02  WMJC-103        PIC  X(001).
           02  WMJC-104        PIC  X(001).
           02  WMJC-105        PIC  X(001).
           02  WMJC-106        PIC  X(001).
           02  WMJC-107        PIC  9(002).
           02  WMJC-108        PIC  9(001).
           02  WMJC-109        PIC  X(001).
           02  WMJC-110        PIC  X(001).
           02  WMJC-111        PIC  X(003).
           02  WMJC-112        PIC  X(006).
           02  WMJC-113        PIC  X(001).
           02  WMJC-114        PIC  X(001).
           02  WMJC-115        PIC  X(001).
           02  WMJC-116        PIC  X(001).
           02  WMJC-117        PIC  X(014).
           02  WMJC-118        PIC  X(014).
           02  WMJC-119        PIC  X(003).
           02  WMJC-120        PIC  X(005).
           02  WMJC-121        PIC  N(025).
           02  WMJC-122        PIC  X(025).
           02  WMJC-123        PIC  X(016).
           02  WMJC-124        PIC  X(001).
           02  WMJC-125        PIC  X(004).
           02  WMJC-126        PIC  N(008).
           02  WMJC-127        PIC  X(008).
           02  WMJC-128        PIC  X(004).
           02  WMJC-129        PIC  N(008).
           02  WMJC-130        PIC  X(008).
           02  WMJC-131        PIC  X(001).
           02  WMJC-132        PIC  X(001).
           02  WMJC-133        PIC  X(001).
           02  WMJC-134        PIC  X(001).
           02  WMJC-135        PIC  X(001).
           02  WMJC-136        PIC  X(001).
           02  WMJC-137        PIC  X(001).
           02  WMJC-138        PIC  X(001).
           02  WMJC-139        PIC  X(001).
           02  WMJC-140        PIC  X(001).
           02  WMJC-141        PIC  X(001).
           02  WMJC-142        PIC  X(001).
           02  WMJC-143        PIC  X(001).
           02  WMJC-144        PIC  X(001).
           02  WMJC-145        PIC  X(001).
           02  WMJC-146        PIC  X(001).
           02  WMJC-147        PIC  X(001).
           02  WMJC-148        PIC  X(001).
           02  WMJC-149        PIC  X(001).
           02  WMJC-150        PIC  9(010).
           02  WMJC-151        PIC  9(007)V99.
           02  WMJC-152        PIC  9(010).
           02  WMJC-153        PIC  9(007).
           02  WMJC-154        PIC  9(001).
           02  WMJC-155        PIC  9(004).
           02  WMJC-156        PIC  X(002).
           02  WMJC-157        PIC  9(002).
           02  WMJC-158        PIC  9(005)V9.
           02  WMJC-159        PIC  9(004).
           02  WMJC-160        PIC  X(001).
           02  WMJC-161        PIC  X(001).
           02  WMJC-162        PIC  X(001).
           02  WMJC-163        PIC  X(001).
       77  F                  PIC  X(001).
