000010     ACCEPT     C-YMDIN      FROM   DATE.
000020     MOVE       C-YYIN       TO     C-YYOUT.
000030     MOVE       C-MMIN       TO     C-MMOUT.
000040     MOVE       C-DDIN       TO     C-DDOUT.
000050     MOVE       C-YMDOUT     TO     H1-DATE.
000060 END
