000010 01  C-YMDWK.
000020     02  C-YMDIN.
000030       03  C-YYIN        PIC 99.
000040       03  C-MMIN        PIC 99.
000050       03  C-DDIN        PIC 99.
000060     02  C-YMDOUT.
000070       03  C-YYOUT       PIC 99.
000080       03  FILLER        PIC X       VALUE ".".
000090       03  C-MMOUT       PIC 99.
000100       03  FILLER        PIC X       VALUE ".".
000110       03  C-DDOUT       PIC 99.
000120 END
