000010******************************************************
000020******************************************************
000030*****                                            *****
000040*****     カ　レ　ン　ダ　ー　マ　ス　タ　ー     *****
000050*****           ( C A L N M )      16/16         *****
000060******************************************************
000070******************************************************
000080 FD  CALNM
000090     BLOCK 16 RECORDS
000100     LABEL RECORD IS STANDARD
000110     VALUE OF IDENTIFICATION "CALNM".
000120 01  CALN-R.
000130     02  CL-KEY.                                                  KEY
000140       03  CL-NG.
000150         04  CL-NEN  PIC 9(02).                                   ﾈﾝ
000160         04  CL-GET  PIC 9(02).                                   ﾂｷ
000170       03  CL-PEY    PIC 9(02).                                   ﾋ
000180     02  CL-KEYD  REDEFINES CL-KEY.
000190       03  CL-NEND   PIC 9(02).                                   ﾈﾝ
000200       03  CL-GP.
000210         04  CL-GETD PIC 9(02).                                   ﾂｷ
000220         04  CL-PEYD PIC 9(02).                                   ﾋ
000230     02  CL-DATE  REDEFINES  CL-KEY  PIC 9(6).
000240     02  CL-YB       PIC X(01).                                   ﾖｳﾋﾞ
000250     02  CL-HO       PIC 9(01).                                   ｷｭｳｼﾞﾂ
000260     02  CL-SJ       PIC 9(01).                                   ｼｭｸｼﾞﾂ
000270     02  F           PIC X(07).
