000010*****************************************************************
000020*    ì¸ã‡èÓïÒÉtÉ@ÉCÉã        ( 128/2 )  INDEXED                 *
000030*****************************************************************
000040 FD  NS-NYK
000050     BLOCK       CONTAINS    2       RECORDS
000060     LABEL       RECORD      STANDARD
000070     VALUE       OF          IDENTIFICATION    "NS-NYK".
000080 01  NYK-R.
000090     02  NYK-KEY.
000100       03  NYK-01          PIC 9(06).
000110       03  NYK-02          PIC 9(02).
000120     02  NYK-03            PIC X(01).
000130     02  NYK-04            PIC 9(06).
000140     02  NYK-04R  REDEFINES  NYK-04.
000150       03  NYK-041         PIC 9(02).
000160       03  NYK-042         PIC 9(02).
000170       03  NYK-043         PIC 9(02).
000180     02  NYK-05            PIC 9(04).
000190     02  NYK-06            PIC 9(01).
000200     02  NYK-07            PIC 9(02).
000210     02  NYK-08            PIC 9(04).
000220     02  NYK-09            PIC S9(10).
000230     02  NYK-10            PIC 9(06).
000240     02  NYK-10R  REDEFINES  NYK-10.
000250       03  NYK-101         PIC 9(02).
000260       03  NYK-102         PIC 9(02).
000270       03  NYK-103         PIC 9(02).
000280     02  NYK-11            PIC 9(04).
000290     02  NYK-12            PIC N(24).
000300     02  NYK-13            PIC 9(01).
000310     02  NYK-14            PIC 9(01).
000320     02  NYK-15            PIC X(01).
000330     02  FILLER            PIC X(31).
