000010*****************************************************************
000020*    仕訳接続ファイル        ( 170/3 )  INDEXED                 *
000030*****************************************************************
000040 FD  NS-SIS
000050     BLOCK       CONTAINS    3       RECORDS
000060     LABEL       RECORD      STANDARD
000070     VALUE       OF          IDENTIFICATION    "NS-SIS".
000080 01  SIS-R.
000090     02  SIS-KEY.
000100*****  03  SIS-01          PIC 9(06).                             D.971111
000110       03  SIS-01          PIC 9(08).                             I.971111
000120       03  SIS-02          PIC 9(06).
000130       03  SIS-03          PIC 9(02).
000140     02  SIS-04.
000150       03  SIS-041.
000160         04  SIS-0411      PIC 9(04).
000170         04  SIS-0412      PIC 9(04).
000180       03  SIS-042         PIC 9(04).
000190       03  SIS-043         PIC 9(03).
000200       03  SIS-044         PIC X(01).
000210       03  SIS-045         PIC S9(10).
000220       03  SIS-046         PIC 9(02).
000230       03  SIS-047         PIC X(08).
000240     02  SIS-05.
000250       03  SIS-051.
000260         04  SIS-0511      PIC 9(04).
000270         04  SIS-0512      PIC 9(04).
000280       03  SIS-052         PIC 9(04).
000290       03  SIS-053         PIC 9(03).
000300       03  SIS-054         PIC X(01).
000310       03  SIS-055         PIC S9(10).
000320       03  SIS-056         PIC 9(02).
000330       03  SIS-057         PIC X(08).
000340     02  SIS-06            PIC 9(05).
000350     02  SIS-07            PIC 9(03).
000360     02  SIS-08            PIC N(20).
000370     02  SIS-09            PIC X(01).
000380*****02  FILLER            PIC X(33).                             D.971111
000390     02  FILLER            PIC X(31).                             I.971111
000400     02  SIS-98            PIC 9(01).
000410     02  SIS-99            PIC X(01).
