000010 FD  SIKIN-D
000020     BLOCK       CONTAINS    16      RECORDS
000030     LABEL       RECORD      STANDARD
000040     VALUE       OF          IDENTIFICATION    "SIKIN-D".
000050 01  SIKIN-R.
000060     02  SIKIN-KEY.
000070         03  SIKIN-01.
000080             04  SIKIN-011       PIC 9(04).                       Žå‰È–Ú‚b
000090             04  SIKIN-012       PIC 9(04).                       ‘ŠŽè‰È‚b
000100     02  SIKIN-02                PIC 9(03).                       Ž‘‹àŒJ‚b
000110     02  SIKIN-03                PIC 9(01).                       ‘ÝŽØ‹æ•ª
000120     02  FILLER                  PIC X(04).
