000010**************************************
000020*    配賦管理ファイル　　　　        *
000030*      IS                            *
000040*      HAIFU-M       (21/12)         *
000050**************************************
000060 FD  ZH-HKM
000070     LABEL   RECORD   STANDARD
000080     BLOCK   12       RECORDS
000090     VALUE   OF       IDENTIFICATION    "HAIFU-M".
000100*
000110 01  HKM-R.
000120     02  HKM-KEY.
000130         03  HKM-01          PIC  9(04).                          部門ｺｰﾄﾞ
000140         03  HKM-02          PIC  9(04).                          配賦元部
000150     02  HKM-03              PIC  9(01)V9(03).                    配賦率
000160     02  FILLER              PIC  X(09).
000170*****          ライブラリー　エンド　        *****
