000010**************************************
000020*    他資金繰マスタ    　　　        *
000030*      IS                            *
000040*      TSIKIN-M      (256/1)         *
000050**************************************
000060 FD  ZH-TSM
000070     LABEL   RECORD   STANDARD
000080     BLOCK   1        RECORDS
000090     VALUE   OF       IDENTIFICATION    "TSIKIN-M".
000100*
000110 01  TSM-R.
000120     02  TSM-KEY.
000130         03  TSM-01          PIC  9(03).                          他資金繰
000140     02  TSM-02              PIC  N(12).                          　　名称
000150     02  TSM-02R  REDEFINES  TSM-02    PIC  X(24).
000160     02  FILLER              PIC  X(01).
000170     02  TSM-03              PIC  9(01).                          改行数
000180     02  TSM-04.                                                  発生
000190         03  TSM-041         PIC S9(11).
000200         03  TSM-042         PIC S9(11).
000210         03  TSM-043         PIC S9(11).
000220     02  TSM-05.                                                  前年欄
000230         03  TSM-051         PIC S9(11)    OCCURS  12.
000240     02  TSM-06T.                                                 参照ｺｰﾄﾞ
000250         03  TSM-06                        OCCURS  3.
000260             04  TSM-061     PIC  9(04).                          科目ｺｰﾄﾞ
000270             04  TSM-062     PIC  9(01).                          残当月区
000280     02  FILLER              PIC  X(47).
000290*****          ライブラリー　エンド　        *****
