000010 FD  SM  LABEL  RECORD  STANDARD
000020         VALUE  OF  IDENTIFICATION  IS  "KAMOKU-K".
000030 01  SM-REC.
000040     02  SM-KEY          PIC X(4).
000050     02  FILLER          PIC X(16).
000060     02  S-800           PIC X.
000070     02  FILLER          PIC X(235).
000080 END
