000010***  ŽèŒ`ƒqƒXƒgƒŠ     (85/3)
000020 FD  TGH
000030     BLOCK      CONTAINS     3      RECORDS
000040     LABEL      RECORD       STANDARD
000050     VALUE      OF           IDENTIFICATION      "SIWAKE-TH".
000060 01  TGH-REC.
000070     02  TGH-KEY.
000080       03  HTGIYMD       PIC 9(6).
000090       03  HTGIJNO       PIC 9(6).
000100       03  HTGILNO       PIC 99.
000110       03  HTGIDR-CR     PIC 9.
000120     02  HTGI-NO          PIC X(8).                               H 90.12
000130     02  HTGIFYMD         PIC 9(6).
000140     02  HTGIKYMD         PIC 9(6).
000150     02  HFURNIN.
000160       03  HTGIFCD        PIC 9(5).
000170       03  HTGIFNM        PIC N(10).
000180     02  HFBAN.
000190       03  HTGIFBCD       PIC 9(5).
000200       03  HTGIFBNM       PIC N(10).
