000050     SELECT  SM  ASSIGN  TO  MSD
000060       ORGANIZATION  IS  INDEXED
000070       ACCESS  MODE  IS  RANDOM
000080       RECORD  KEY   IS  SM-KEY.
000090 END
