00010FD             FTG310  K A
00020SD        1101366L
00030IT     2 21                   N  Z         期　日　
00040IT  -別　支　払　手　形　帳
00050IT     5 31                   N            平成
00060IT     5 38                   N            年
00070IT     5 43                   N            月
00080IT     5 48                   N            日　現在
00090IT     7 63                   N            決済日　
00100IT  -平成
00110IT     7 76                   N            年
00120IT     7 81                   N            月
00130IT     7 86                   N            日
00140IT    10  2                   N            振出日
00150IT    10  8                   A            ｺｰﾄﾞ
00160IT    10 22                   N            取　　引
00170IT  -　　先　　名
00180IT     9 63                   N            手形
00190IT    10 63                   N            番号
00200IT    10 70                   N            金　額
00210IT    10 80                   N            累計金額
00220IT     6 62  2 27          B2
00230IT01   9  2 56 87          B1
00240IT02            6          V1
00250IT02            5          V1
00260IT02           50          V1
00270IT02            4          V1
00280IT02           11          V1
00290IT02         2             H1
00300IT02         1   54        H2
00310IT    11  3 54        3 1  V2
00320IT    11 68 54        3 2  V4
00330IT    11 79 54        3 2  V4
