00010FD             FTY120  K A
00020SD        1101366L
00030IT     2 24                   N  Z         受　取　
00040IT  -手　形　帳
00050IT     2 54                   N  9T        （取引先
00060IT  -別）
00070IT     5 31                   N            平成
00080IT     5 38                   N            年
00090IT     5 43                   N            月
00100IT     5 48                   N            日　現在
00110IT     7 29                   N  ZF        【　　索
00120    -　引　　】
00130IT    10 21                   A            ｺｰﾄﾞ
00140IT    10 39                   N            取　引　
00150IT  -先　名
00160IT    10 73                   N            残　高
00170IT    10 85                   N            №
00180IT01   9  2 56 87          B1
00190IT02           18          V1
00200IT02            6          V1
00210IT02           41          V1
00220IT02           16          V1
00230IT02         2             H1
00240IT02         1   53        H2
