00010FD             FTY210  K A
00020SD        1101366L
00030IT     2 24                   N  Z         支　払　
00040IT  -手　形　帳
00050IT     2 54                   N  9T        （取引先
00060IT  -別）
00070IT     5 31                   N            平成
00080IT     5 38                   N            年
00090IT     5 43                   N            月
00100IT     5 48                   N            日　現在
00110IT     7  2                   N    20      コード
00120IT     7 16                   N    20      所在地
00130IT     7 38                   N    20      取引先名
00140IT    10  3                   N            日付
00150IT     9  8                   N            手形
00160IT    10  8                   N            番号
00170IT     9 12                   N            種
00180IT    10 12                   N            類
00190IT     9 16                   N            手形
00200IT    10 16                   N            期日
00210IT    10 24                   N            金　額
00220IT    10 35                   N            処理銀行
00230IT  -名他
00240IT    10 57                   N            手　形　
00250IT  -発　行　人　名
00260IT01   9  2 56 87          B1
00270IT02            6          V1
00280IT02            4          V1
00290IT02            3          V1
00300IT02            6          V1
00310IT02           11          V1
00320IT02           17          V1
00330IT02         2             H1
00340IT02         2   26        H2
00350IT    11  3 54        3 1  V2
00360IT    11 16 54        3 1  V2
00370IT    11 22 54        3 2  V4
00380IT    11 32 54             V1
