000010 01  W-DAICHO.
000020     02  W-DAI.
000030       03  W-DAI1.
000040         04  W-DAID     PIC  X(001)  OCCURS   3.
000050       03  W-DAI2       PIC  9(006).
000060       03  W-DAI3       PIC  9(001).
000070     02  W-ATBLD.
000080       03  W-TBLD       PIC  X(027) VALUE
000090            " ABCDEFGHIJKLMNOPQRSTUVWXYZ".
000100       03  W-ATBL  REDEFINES W-TBLD.
000110         04  W-TBLA     PIC  X(001) OCCURS  27.
000120     02  W-DNOC         PIC  9(001).
000130     02  W-DNOT         PIC  9(002).
