000010******************************************
000020*****                                *****
000030*****     銀　行　マ　ス　タ　ー     *****
000040*****      ( B A N K M )   85/3      *****
000050******************************************
000060 FD  BANK-M
000070     BLOCK  3 RECORDS
000080     LABEL RECORD IS STANDARD
000090     VALUE OF IDENTIFICATION "BANKM".
000100 01  BANK-R.
000110     02  B-KEY          PIC  X(004).                              ＫＥＹ
000120     02  B-BNA          PIC  N(008).                              銀行名
000130     02  B-SNA          PIC  N(008).                              本支店名
000140     02  B-YBW          PIC  9(010).                              割引枠
000150     02  B-ZYZ          PIC  9(010).                              前割引残
000160     02  B-YBZ          PIC  9(010).                              割引残高
000170     02  B-YBC          PIC  9(001).                              割引区分
000180*****02  F              PIC  X(016).                              D.960207
000190     02  F              PIC  X(011).                              I.960207
000200*****    96/02/07 ﾂｲｶ    *****
000210     02  B-SC           PIC  9(001).                              使用区分
000220     02  B-NG           PIC  9(004).                              最終年月
000230*****    93/09/09 ﾂｲｶ    *****
000240     02  B-PRC          PIC  9(002).                              作表区分
