000010     SELECT  M-DATE  ASSIGN TO DATE-MSD
000020             ORGANIZATION      INDEXED
000030             ACCESS            RANDOM
000040             RECORD          DATE-KEY.
