000010******************************************************
000020*****                                            *****
000030*****     振　込　先　銀　行　マ　ス　タ　ー     *****
000040*****            ( F B K M )     64/4            *****
000050******************************************************
000060 FD  FBKM
000070     BLOCK 6 RECORDS
000080     LABEL RECORD IS STANDARD
000090     VALUE OF IDENTIFICATION "FBKM".
000100 01  FBK-R.
000110     02  FBK-KEY.                                                 コード
000120       03  FBK-BKC      PIC  9(004).                              銀行ｺｰﾄﾞ
000130       03  FBK-HSC      PIC  9(003).                              支店ｺｰﾄﾞ
000140     02  FBK-BNA.
000150       03  FBK-BKN      PIC  X(015).                              銀行名
000160       03  FBK-HSN      PIC  X(015).                              本支店名
000170     02  F              PIC  X(001).                              I.980216
000180     02  FBK-ENG        PIC  9(004).                              I.980216
000190*****02  F              PIC  X(005).                              D.980216
