000010 FD  HSMSF
000020*****BLOCK    3     RECORDS                                       D.970709
000030     BLOCK    2     RECORDS                                       I.970709
000040     LABEL    RECORD   STANDARD
000050     VALUE    OF  IDENTIFICATION  "HSMSF".
000060*
000070 01  HSMS-R1.
000080     02   HSMS-KEY.                                               KEY
000090          03   HSMS-01          PIC 9(6).                         º≠Ø∂ºΩﬁ
000100          03   HSMS-02          PIC 9(1).                         ∑ﬁÆ≥
000110     02   HSMS-03               PIC 9(1).                         √ﬁ›∏
000120     02   HSMS-05.                                                º≠Ø∂Àﬁºﬁ
000130*****     03  HSMS-051          PIC 9(2).                         D.970709
000140          03  HSMS-051          PIC 9(4).                         I.970709
000150          03  HSMS-052          PIC 9(2).                         ¬∑
000160          03  HSMS-053          PIC 9(2).                         À
000170     02   HSMS-06.                                                ¡Æ∏ø≥ CD
000180          03  HSMS-061          PIC 9(4).                         ƒ∏≤∫∞ƒﬁ
000190          03  HSMS-062          PIC 9(3).                         ¡Æ∏ NO
000200     02   HSMS-07               PIC 9(1).                         ∏◊ ∫∞ƒﬁ
000210     02   HSMS-09               PIC 9(6).                         À›∫∞ƒﬁ
000220     02   HSMS-10               PIC 9(1).                         ª≤Ωﬁ∏Ãﬁ›
000230     02   HSMS-12.                                                º≠Ø∂ºﬁ¬
000240          03  HSMS-121    OCCURS  10.                             ª≤ΩﬁÕﬁ¬
000250              04  HSMS-1211     PIC S9(4).                        I.970709
000260          03  HSMS-122          PIC S9(6).                        I.970709
000270*****         04  HSMS-1211     PIC S9(4)  COMP-3.                D.970709
000280*****     03  HSMS-122          PIC S9(6)  COMP-3.                D.970709
000290     02  HSMS-13                PIC 9(1).                         ±Ωﬁ∂ÿ KB
000300     02  HSMS-14                PIC S9(03).                       å¬êî
000310*****02  FILLER                 PIC X(01).                        D.970709
000320     02  HSMS-21                PIC 9(01).                        ≤›ºﬁ∏Ãﬁ›
000330     02  HSMS-20                PIC 9(02).                        ¿›ƒ≥
000340     02  HSMS-16                PIC 9(02).                        Ãﬁ›Ÿ≤2
000350     02  HSMS-17                PIC 9(05).                        ¿›∂
000360*****02  HSMS-18                PIC 9(06).                        D.970709
000370     02  HSMS-18                PIC 9(08).                        I.970709
000380     02  HSMS-22                PIC X(10).                        I.981020
000390     02  HSMS-23                PIC 9(01).                        Õ›∂›∏Ãﬁ›
000400     02  HSMS-24                PIC 9(01).                        I.040323
000410     02  FILLER                 PIC X(14).                        I.071002
000420*****02  FILLER                 PIC X(16).                        D.071002
000430*****02  FILLER                 PIC X(17).                        D.040323
000440*****02  FILLER                 PIC X(18).                        D.030418
000450*****02  FILLER                 PIC X(28).                        D.981020
000460     02  HSMS-26                PIC 9(01).                        I.071002
000470     02  HSMS-25                PIC 9(01).                        I.071002
000480     02  HSMS-19                PIC 9(01).                        º÷≥∂≤Ω≥
000490 01  HSMS-R2.
000500     02  HSMS-KEYB.                                               KEY
000510         03   HSMS-01B          PIC 9(6).                         º≠Ø∂ºΩﬁ
000520         03   HSMS-02B          PIC 9(1).                         ∑ﬁÆ≥
000530     02  HSMS-03B               PIC 9(1).                         I.071023
000540     02  HSMS-05B.                                                I.071023
000550         03  HSMS-051B          PIC 9(4).                         I.071023
000560         03  HSMS-052B          PIC 9(2).                         I.071023
000570         03  HSMS-053B          PIC 9(2).                         I.071023
000580     02  HSMS-06B.                                                I.071023
000590         03  HSMS-061B          PIC 9(4).                         I.071023
000600         03  HSMS-062B          PIC 9(3).                         I.071023
000610     02  HSMS-07B               PIC 9(1).                         I.071023
000620     02  HSMS-15                PIC N(24).                        ìEóv
000630     02  FILLER                 PIC X(37).                        I.071023
000640     02  HSMS-23B               PIC 9(01).                        I.071023
000650     02  HSMS-24B               PIC 9(01).                        I.071023
000660     02  FILLER                 PIC X(14).                        I.071023
000670*****02  FILLER                 PIC X(16).                        D.071002
000680*****02  FILLER                 PIC X(17).                        D.040323
000690*****02  FILLER                 PIC X(18).                        D.030418
000700*****02  FILLER                 PIC X(28).                        D.981020
000710     02  HSMS-26B               PIC 9(01).                        I.071023
000720     02  HSMS-25B               PIC 9(01).                        I.071023
000730*****02  FILLER                 PIC X(29).                        D.970709
000740*****02  FILLER                 PIC X(72).                        D.071023
000750     02  HSMS-19B               PIC 9(01).                        º÷≥∂≤Ω≥
