000010***************************************
000020*****     材　料　マ　ス　タ　ー  *****
000030*****        (  JM  128/2  )      *****
000040***************************************
000050 FD  J-M
000060     BLOCK  2 RECORDS
000070     LABEL RECORD IS STANDARD
000080     VALUE OF IDENTIFICATION "JM".
000090 01  J-R.
000100     02  J-KEY.                                                   ＫＥＹ
000110       03  J-KEYD.
000120         04  J-BC       PIC  9(001).                              　　部門
000130         04  J-RC       PIC  9(002).                                  品目
000140       03  J-JC         PIC  9(003).
000150     02  J-JCD   REDEFINES J-KEY  PIC 9(006).                     材料ｺｰﾄﾞ
000160     02  J-NAME         PIC  N(024).                              材料名
000170     02  J-YC           PIC  9(001).                              用途区分
000180     02  J-ZC           PIC  9(001).                              在庫区分
000190     02  J-SC           PIC  9(001).                              製品区分
000200     02  J-TC1          PIC  9(001).                              単位区分
000210     02  J-ST           PIC S9(006)V9(02).                        最終単価
000220     02  J-TC2          PIC  9(001).                              単位区分
000230     02  J-YT           PIC S9(006)V9(02).                        予定単価
000240     02  J-MCD          PIC  9(006).                              加工前CD
000250     02  J-KT           PIC  9(006)V9(02).                        加工単価
000260     02  FILLER         PIC  X(022).                              FILLER
000270     02  J-BKC          PIC  9(002).                              部門管理
000280     02  J-BKNO         PIC  9(002).                              I.030516
000290*****02  F              PIC  X(009).                              D.030516
000300     02  F              PIC  X(007).                              I.030516
000310     02  J-ED           PIC  9(006).                              最終日付
000320     02  J-EDR   REDEFINES J-ED.
000330         03  J-EDY      PIC  9(002).                              　年
000340         03  J-EDM      PIC  9(002).                              　月
000350         03  J-EDD      PIC  9(002).                              　日
