000010***************************************
000020*****     材料統計　マスター      *****
000030*****      (  JTM  85/3  )        *****
000040***************************************
000050 FD  JT-M
000060     BLOCK  3 RECORDS
000070     LABEL RECORD IS STANDARD
000080     VALUE OF IDENTIFICATION "JTM".
000090 01  JT-R.
000100     02  JT-KEY.                                                   ＫＥＹ
000110       03  JT-KEYD.
000120         04  JT-BC      PIC  9(001).                              　　部 
000130         04  JT-RC      PIC  9(002).                                  品 
000140       03  JT-JC        PIC  9(003).
000150     02  JT-JCD  REDEFINES JT-KEY  PIC  9(006).                     材料ｺｰ
000160*****02  JT-ZSU         PIC S9(007)V9(02).                        D.990426
000170     02  JT-TSU         PIC S9(007)V9(02).                        I.990426
000180     02  JT-SSU         PIC S9(007)V9(02).                        入庫数
000190     02  JT-SIK         PIC S9(008).                              I.990518
000200*****02  JT-SIK         PIC S9(009).                              D.990518
000210     02  JT-HSU         PIC S9(007)V9(02).                        出庫数
000220     02  JT-ZKS         PIC S9(007)V9(02).                        繰越数
000230*****02  JT-ZKK         PIC S9(009).                              D.990518
000240     02  JT-ZKK         PIC S9(008).                              I.990518
000250     02  JT-YC          PIC  9(001).                              用途区 
000260     02  JT-ZC          PIC  9(001).                              在庫区 
000270     02  JT-SC          PIC  9(001).                              製品区 
000280     02  JT-CSU         PIC S9(007)V9(02).                        I.990428
000290     02  JT-BKC         PIC  9(002).                              I.030512
000300     02  JT-BKNO        PIC  9(002).                              I.030512
000310     02  F              PIC  X(011).                              I.030512
000320*****02  F              PIC  X(015).                              D.030512
000330*****02  F              PIC  X(013).                              D.990518
000340*****02  F              PIC  X(022).                              D.990428
