000010*************************************************
000020*****        工品　品名統計マスター         *****
000030*****  (  KHTD : KEY=KHTM1･KHTM2  170/3  )  *****
000040*************************************************
000050 FD  KHT-M
000060     BLOCK  3 RECORDS
000070     LABEL RECORD IS STANDARD
000080     VALUE OF IDENTIFICATION "KHTM1"
000090     ALTERNATE IDENTIFICATION "KHTM2".
000100 01  KHT-R.
000110     02  KHT-KEYD.                                                ｺｰﾄﾞ
000120       03  KHT-YC       PIC  9(002).                              ﾖｳﾄｸﾌﾞﾝ
000130       03  KHT-NC       PIC  9(001).                              I.021004
000140       03  KHT-KEY.                                               ｺｰﾄﾞ
000150         04  KHT-KEY1   PIC  X(002).
000160         04  KHT-KEY2   PIC  9(003).
000170*    [   ﾄ ｳ ｹﾞ ﾂ   ｼﾞ ｯ ｾ ｷ   ]
000180     02  KHT-KSU        PIC S9(006)V9(02).                        ｶﾘｭｳｽｳ
000190     02  KHT-HSU        PIC S9(006)V9(02).                        ﾊｲｷｬｸｽｳ
000200     02  KHT-ISU        PIC S9(006)V9(02).                        I.021004
000210     02  KHT-KKIN       PIC S9(008).                              ｾｲｻﾝｶﾞｸ
000220     02  KHT-SSU        PIC S9(006)V9(02).                        ｼｭｯｶｽｳ
000230     02  KHT-UKIN       PIC S9(008).                              ｳﾘｱｹﾞｶﾞｸ
000240     02  KHT-NKIN       PIC S9(007).                              ﾈﾋﾞｷｶﾞｸ
000250     02  KHT-GKIN       PIC S9(008).                              I.020829
000260     02  KHT-ZSU        PIC S9(006)V9(02).                        ｾﾞﾝｸﾘｽｳ
000270     02  KHT-ZKIN       PIC S9(008).                              ｾﾞﾝｸﾘｶﾞｸ
000280*    [   ｱｽﾞｶﾘ ﾄｳｹｲ   ]
000290     02  KHT-AZS        PIC S9(006).                              ｾﾞﾝｸﾘｽｳ
000300     02  KHT-AAS        PIC S9(006).                              ｱｽﾞｶﾘｽｳ
000310     02  KHT-AUS        PIC S9(006).                              ｳﾘｱｹﾞｽｳ
000320     02  KHT-ASS        PIC S9(006).                              ｼｭｯｶｽｳ
000330     02  KHT-AC         PIC  9(001).                              ｸﾌﾞﾝ
000340     02  F              PIC  X(012).                              I.090429
000350*    [   ﾄｳｹﾞﾂ ｼｭｯｶ ﾖﾃｲ   ]
000360*****02  KHT-TSY.                                                 D.090429
000370*****  03  KHT-TTG      PIC S9(006).                              D.090429
000380*****  03  KHT-TYG      PIC S9(006).                              D.090429
000390*****  03  KHT-TYY      PIC S9(006).                              D.020829
000400*****  03  KHT-TZO      PIC S9(006).                              D.020829
000410*    [   ﾖｸｹﾞﾂ ｼｭｯｶ ﾖﾃｲ   ]
000420*****02  KHT-YSY.                                                 D.021004
000430*****  03  KHT-YTG      PIC S9(006).                              D.021004
000440*****  03  KHT-YYG      PIC S9(006).                              D.021004
000450*****  03  KHT-YYY      PIC S9(006).                              D.020829
000460*****  03  KHT-YZO      PIC S9(006).                              D.020829
000470*    [   ｸﾌﾞﾝ･ｺｰﾄﾞ  ]
000480     02  KHT-KIS        PIC  9(001).                              ｷｼｭｸﾌﾞﾝ
000490     02  KHT-KCO        PIC  X(005).                              ｶﾘｭｳｺｰﾄﾞ
000500*    [   ﾀﾅｵﾛｼ   ]
000510     02  KHT-JTS        PIC S9(006)V9(02).                        ｼﾞﾂﾀﾅ
000520     02  KHT-TTS        PIC S9(006)V9(02).                        ﾁｮｳﾎﾞﾀﾅ
000530     02  KHT-HKS        PIC S9(006)V9(02).                        I.090601
000540*
000550     02  F              PIC  X(016).                              I.090601
000560*****02  F              PIC  X(024).                              D.090601
000570*****02  KHT-NC         PIC  9(001).                              D.021004
000580*
000590*****02  F              PIC  X(020).                              D.021004
000600*****02  F              PIC  X(021).                              D.020906
000610*****02  F              PIC  X(005).                              D.020829
