000010***********************************************
000020*****     工品品名材料使用マスター　      *****
000030*****         (  KHJM  32/8  )            *****
000040***********************************************
000050 FD  KHJ-M
000060     BLOCK  8 RECORDS
000070     LABEL RECORD IS STANDARD
000080     VALUE OF IDENTIFICATION "KHJM".
000090 01  KHJ-R.
000100     02  KHJ-KEY.                                                 ｺｰﾄﾞ
000110       03  KHJ-HCD      PIC  X(005).                              ﾋﾝﾒｲC
000120       03  KHJ-JCD      PIC  X(007).                              ｻﾞｲﾘｮｳC
000130*
000140     02  KHJ-SGR        PIC  9(004)V9(01).                        ｺﾞﾑｼﾖｳG
000150     02  KHJ-SGRD  REDEFINES KHJ-SGR  PIC  9(001)V9(04).          ｺﾞﾑｼﾖｳG
000160*
000170     02  KHJ-SU         PIC  9(001).                              ｶﾅｸﾞｺｽｳ
000180     02  KHJ-KSC        PIC  9(001).                              ｶﾅｸﾞｼﾖｳC
000190*
000200     02  F              PIC  X(013).
