000010***********************************************
000020*****     防振　材料マスター　　　　　    *****
000030*****      (  KJM  128/2  )               *****
000040***********************************************
000050 FD  KJ-M
000060     BLOCK  2 RECORDS
000070     LABEL RECORD IS STANDARD
000080     VALUE OF IDENTIFICATION "KJM".
000090 01  KJ-R.
000100*    * * *   ｺ ﾃ ｲ  ｺ ｳ ﾓ ｸ   * * *
000110     02  KJ-KEY.                                                  ｺｰﾄﾞ
000120       03  KJ-JCD       PIC  X(007).                              C.940510
000130     02  KJ-NAME        PIC  X(020).                              ｻﾞｲﾘｮｳﾒｲ
000140     02  KJ-SC          PIC  9(001).                              ｿｻﾞｲｸﾌﾞﾝ
000150*    * * *   ﾀ ﾝ ｶ  ｺ ｳ ﾓ ｸ   * * *
000160     02  KJ-T           PIC  9(005)V9(02).                        ﾀﾝｶ ﾄｳｶｲ
000170*****02  KJ-TN          PIC  9(005)V9(02).                        D.021004
000180*    * * *   ﾄ ｳ ｹ ｲ  ｺ ｳ ﾓ ｸ   * * *
000190     02  KJ-SSU         PIC S9(007).                              ｼｲﾚｽｳ
000200     02  KJ-KSU         PIC S9(005).                              ｶﾅｸﾞｶｲｼｭ
000210     02  KJ-HSU         PIC S9(007).                              ﾊﾗｲﾀﾞｼｽｳ
000220     02  KJ-ZSU         PIC S9(007).                              ｸﾘｺｼｽｳ
000230*    * * *   ｼ ｲ ﾚ  ｺ ｳ ﾓ ｸ   * * *
000240*****02  KJ-SNO         PIC  X(005).                              D.021004
000250*****02  KJ-SYS         PIC S9(006).                              D.021004
000260*    * * *   ﾀ ﾅ ｵ ﾛ ｼ  ｺ ｳ ﾓ ｸ   * * *
000270     02  KJ-JTS         PIC S9(007).                              ｼﾞﾂﾀﾅ
000280     02  KJ-TTS         PIC S9(007).                              ﾁｮｩﾎﾞﾀﾅ
000290*    * * *   ｾｲﾋﾝｼｲﾚ ﾉ ﾋﾝﾒｲｺｰﾄﾞ   * * *
000300     02  KJ-HCD         PIC  X(005).                              I.021004
000310*****02  KJ-ZC          PIC  9(001).                              D.021004
000320*****02  KJ-MC          PIC  9(001).                              D.021004
000330*
000340*****02  F              PIC  X(029).                              D.021004
000350     02  F              PIC  X(044).                              I.021004
000360     02  KJ-ENG         PIC  9(004).                              I.980205
000370*****02  F              PIC  X(033).                              D.980205
000380*
