000010********************************************
000020*****    仕　入　先　マ　ス　タ　ー    *****
000030*****         (  S M  )  256/1         *****
000040********************************************
000050 FD  S-M
000060     BLOCK  1 RECORDS
000070     LABEL RECORD IS STANDARD
000080     VALUE OF IDENTIFICATION "SM".
000090 01  S-R.
000100     02  S-KEY.                                                   ＫＥＹ
000110       03  S-TCD        PIC  9(004).                              仕入先CD
000120       03  S-TCDD  REDEFINES S-TCD.
000130         04  S-TCD1     PIC  9(001).
000140         04  S-TCD2     PIC  9(003).
000150     02  S-NAME         PIC  N(024).                              仕入先名
000160     02  S-JSU          PIC  N(024).                              住所(上)
000170     02  S-JSS          PIC  N(012).                              住所(下)
000180*****02  S-UNO          PIC  X(006).                              D.960517
000190*****02  F              PIC  X(006).                              D.970127
000200*****02  S-TEL          PIC  X(012).                              D.970127
000210*****02  S-FAX          PIC  X(012).                              D.970127
000220     02  S-UNO          PIC  X(008).                              I.970127
000230     02  S-TEL          PIC  X(014).                              I.970127
000240     02  S-FAX          PIC  X(014).                              I.970127
000250     02  S-FKC          PIC  9(002).                              府県ｺｰﾄﾞ
000260     02  S-SZC          PIC  9(001).                              消費税C
000270*****02  S-TTS          PIC  9(002).                              D.080903
000280*****02  S-THN          PIC  9(002).                              D.080903
000290*****02  S-TMC          PIC  9(001).                              D.080903
000300*****02  F              PIC  9(005).                              D.081124
000310     02  S-STS          PIC  9(003).                              I.081124
000320     02  F              PIC  9(002).                              I.081124
000330     02  S-SKR          PIC  9(001).                              送金料C
000340     02  S-PC           PIC  9(002).                              I.971105
000350     02  S-BKC          PIC  9(002).                              I.990603
000360     02  S-SHH          PIC  9(001).                              I.080903
000370*****02  F              PIC  X(102).                              D.950524
000380*****02  F              PIC  X(090).                              D.960517
000390*****02  S-UNO          PIC  X(008).                              D.970127
000400*****02  F              PIC  X(082).                              D.980217
000410*****02  F              PIC  X(084).                              D.971105
000420*****02  F              PIC  X(078).                              D.990603
000430*****02  F              PIC  X(076).                              D.031027
000440*****02  F              PIC  X(034).                              D.040122
000450*****02  F              PIC  X(030).                              D.080903
000460     02  F              PIC  X(029).                              I.080903
000470     02  S-TNG          PIC  9(004).                              I.040122
000480     02  S-KANA         PIC  X(036).                              I.031027
000490     02  F              PIC  X(006).                              I.031027
000500     02  S-ENG          PIC  9(004).                              I.980217
000510     02  S-KKC          PIC  9(001).                              買掛区分
000520     02  S-SFC          PIC  9(001).                              振込区分
000530     02  S-TGC          PIC  9(001).                              手形区分
