000010******************************************************
000020*****     仕　入　先　統　計　マ　ス　タ　ー     *****
000030*****             ( S T M )     85/3             *****
000040******************************************************
000050 FD  ST-M
000060*****BLOCK  2 RECORDS                                             D.990518
000070     BLOCK  3 RECORDS                                             I.990518
000080     LABEL RECORD IS STANDARD
000090     VALUE OF IDENTIFICATION "STM".
000100 01  ST-R.
000110     02  ST-KEY.                                                  ＫＥＹ
000120       03  ST-KEY1      PIC  9(001).
000130       03  ST-KEY2      PIC  9(003).
000140*****02  ST-ZKZ         PIC S9(009).                              D.990518
000150*****02  ST-ZKZZ        PIC S9(007).                              D.990518
000160*****02  ST-KZ          PIC S9(009).                              D.990518
000170*****02  ST-KZZ         PIC S9(007).                              D.990518
000180*****02  ST-TSK         PIC S9(009).                              D.990518
000190*****02  ST-TSKZ        PIC S9(007).                              D.990518
000200*****02  ST-THK         PIC S9(009).                              D.990518
000210*****02  ST-THKZ        PIC S9(007).                              D.990518
000220*****02  ST-YSK         PIC S9(010).                              D.990518
000230*****02  ST-YSKZ        PIC S9(008).                              D.990518
000240*****02  ST-ZKZ         PIC S9(008).                              D.120829
000250*****02  ST-ZKZZ        PIC S9(007).                              D.120829
000260*****02  ST-ZKZZ        PIC S9(006).                              D.990531
000270*****02  ST-KZ          PIC S9(008).                              D.120829
000280*****02  ST-KZZ         PIC S9(007).                              D.120829
000290*****02  ST-KZZ         PIC S9(006).                              D.990531
000300     02  ST-ZKZ         PIC S9(009).                              I.120829
000310     02  ST-ZKZZ        PIC S9(008).                              I.120829
000320     02  ST-KZ          PIC S9(009).                              I.120829
000330     02  ST-KZZ         PIC S9(008).                              D.120829
000340     02  ST-TSK         PIC S9(009).                              I.141112
000350     02  ST-TSKZ        PIC S9(008).                              I.141112
000360     02  ST-THK         PIC S9(009).                              I.141112
000370     02  ST-THKZ        PIC S9(008).                              I.141112
000380*****02  ST-TSK         PIC S9(008).                              D.141112
000390*****02  ST-TSKZ        PIC S9(007).                              D.141112
000400*****02  ST-TSKZ        PIC S9(006).                              D.990531
000410*****02  ST-THK         PIC S9(008).                              D.141112
000420*****02  ST-THKZ        PIC S9(007).                              D.141112
000430*****02  ST-THKZ        PIC S9(006).                              D.990531
000440     02  ST-PC          PIC  9(004).                              台帳頁
000450     02  F              PIC  X(009).                              I.141112
000460*****02  F              PIC  X(013).                              D.141112
000470*****02  F              PIC  X(017).                              D.120829
000480*****02  F              PIC  X(021).                              D.990531
000490*****02  F              PIC  X(038).                              D.990518
