000010***********************************************
000020*****　　直　送　先　マ　ス　タ　ー       *****
000030*****         (  T C M  )  192/4          *****
000040***********************************************
000050 FD  TC-M
000060*****BLOCK  3 RECORDS                                             D.020305
000070     BLOCK  4 RECORDS                                             I.020305
000080     LABEL RECORD IS STANDARD
000090     VALUE OF IDENTIFICATION "TCM".
000100 01  TC-R.
000110     02  TC-KEY.                                                  ｺｰﾄﾞ
000120       03  TC-TCD       PIC  9(004).                              得意先CD
000130       03  TC-CCD       PIC  9(003).                              直送先CD
000140     02  TC-NAME        PIC  N(026).                              I.020306
000150     02  TC-JSU         PIC  N(020).                              I.020306
000160     02  TC-JSS         PIC  N(020).                              I.020306
000170*****02  TC-NAME        PIC  N(024).                              D.020306
000180*****02  TC-JSU         PIC  N(024).                              D.020306
000190*****02  TC-JSS         PIC  N(012).                              D.020306
000200*****02  TC-UNO         PIC  X(006).                              D.970122
000210*****02  TC-TEL         PIC  X(012).                              D.970122
000220     02  TC-UNO         PIC  X(008).                              I.970122
000230     02  TC-TEL         PIC  X(014).                              I.970122
000240     02  TC-FKC         PIC  9(002).                              府県ｺｰﾄﾞ
000250     02  TC-UCD         PIC  9(001).                              運送ｺｰﾄﾞ
000260*****02  F              PIC  9(001).                              D.040708
000270*****02  TC-STK         PIC  9(001).                              D.040323
000280     02  TC-SSC         PIC  9(001).                              I.040708
000290     02  TC-BIK         PIC  9(001).                              I.981008
000300*****02  TC-DNO         PIC  9(003).                              D.010220
000310*****02  F              PIC  X(003).                              D.020308
000320     02  TC-DHC         PIC  9(001).                              I.000630
000330*****02  F              PIC  X(019).                              D.040121
000340     02  TC-SEK         PIC  9(001).                              I.040121
000350*****02  TC-STC         PIC  9(009).                              D.140829
000360*****02  F              PIC  X(009).                              D.150206
000370     02  TC-STC         PIC  9(009).                              I.150206
000380     02  TC-2N          PIC  9(004).                              I.090515
000390*****02  F              PIC  X(003).                              D.100329
000400*****02  F              PIC  X(001).                              D.160210
000410     02  TC-MIC         PIC  9(001).                              I.160210
000420     02  TC-MZC         PIC  9(001).                              I.100329
000430*****02  F              PIC  X(001).                              D.140828
000440     02  TC-NFN         PIC  9(001).                              I.140828
000450     02  TC-PNO         PIC  9(002).                              I.090515
000460*****02  F              PIC  X(009).                              D.090515
000470*****02  F              PIC  X(006).                              D.020306
000480*****02  F              PIC  X(007).                              D.000630
000490*****02  F              PIC  X(010).                              D.000124
000500*****02  F              PIC  X(015).                              D.970122
000510*****02  F              PIC  X(011).                              D.981008
000520     02  TC-DATE        PIC  9(006).                              I.940610
000530     02  TC-YMD   REDEFINES TC-DATE.                              年月日
000540         03  TC-YY      PIC  9(002).                                年
000550         03  TC-MM      PIC  9(002).                                月
000560         03  TC-DD      PIC  9(002).                                日
000570*****02  F              PIC  X(022).                              D.020306
