000010*****************************************************************
000020*    åàçœèÓïÒÉtÉ@ÉCÉã        ( 51/5 )  SEQUENTIAL               *
000030*****************************************************************
000040 FD  NS-KES
000050     BLOCK       CONTAINS    5       RECORDS
000060     LABEL       RECORD      STANDARD
000070     VALUE       OF          IDENTIFICATION    "NS-KES".
000080 01  KES-R.
000090     02  KES-01            PIC 9(01).
000100*****02  KES-02            PIC 9(06).                             D.971201
000110     02  KES-02            PIC 9(08).                             I.971201
000120     02  KES-02R  REDEFINES  KES-02.
000130*****  03  KES-021         PIC 9(02).                             D.971201
000140       03  KES-021         PIC 9(04).                             I.971201
000150       03  KES-022         PIC 9(02).
000160       03  KES-023         PIC 9(02).
000170     02  KES-03            PIC 9(04).
000180     02  KES-04            PIC 9(04).
000190     02  KES-05            PIC 9(04).
000200     02  KES-06            PIC 9(02).
000210     02  KES-07            PIC 9(02).
000220     02  KES-08            PIC S9(10).
000230*****02  KES-09            PIC 9(06).                             D.971201
000240     02  KES-09            PIC 9(08).                             I.971201
000250     02  KES-09R  REDEFINES  KES-09.
000260*****  03  KES-091         PIC 9(02).                             D.971201
000270       03  KES-091         PIC 9(04).                             I.971201
000280       03  KES-092         PIC 9(02).
000290       03  KES-093         PIC 9(02).
000300     02  FILLER            PIC X(08).                             I.971201
000310*****02  FILLER            PIC X(12).                             D.971201
