000010*********************************************
000020*****                                   *****
000030*****       èoâ◊ÇsÇqÇ`ÇmÉtÉ@ÉCÉã        *****
000040*****                      128/02       *****
000050*********************************************
000060 FD  HN-STRN
000070     BLOCK    2     RECORDS
000080     LABEL    RECORD   STANDARD
000090     VALUE    OF  IDENTIFICATION  "STRAN".
000100*
000110 01  STRN-R.
000120*****02  STRN-01            PIC 9(06).                            D.970710
000130     02  STRN-20            PIC 9(06).                            I.000809
000140     02  STRN-13            PIC 9(01).                            I.000809
000150     02  STRN-01            PIC 9(08).                            I.970710
000160     02  STRN-02            PIC 9(04).                            ìæà”êÊCD
000170     02  STRN-03            PIC 9(06).                            ïiñºCD
000180     02  STRN-04            PIC 9(01).                            ÉTÉCÉYKB
000190     02  STRN-05.                                                 ÉTÉCÉYï 
000200       03  STRN-051  OCCURS 10  PIC S9(04)  COMP-3.               I.000809
000210*****  03  STRN-051  OCCURS 10  PIC S9(04).                       D.000809
000220     02  STRN-06            PIC S9(05).                           çáåvêîó 
000230*****02  STRN-07            PIC 9(04).                            D.941208
000240     02  STRN-07            PIC 9(05).                            I.941208
000250     02  STRN-08            PIC S9(08).                           ã‡äz
000260     02  STRN-09            PIC 9(01).                            í≤êÆãÊï™
000270     02  STRN-10            PIC 9(01).                            ì`ï[ãÊï™
000280*****02  STRN-11            PIC 9(04).                            D.941208
000290     02  STRN-11            PIC 9(05).                            I.941208
000300*****02  STRN-12            PIC 9(03).                            D.000809
000310*****02  STRN-13            PIC 9(01).                            D.000809
000320*****02  STRN-14            PIC 9(03).                            D.970710
000330     02  STRN-14A           PIC 9(03).                            I.970710
000340     02  STRN-15.                                                 ï™óﬁCD
000350       03  STRN-151         PIC 9(02).
000360       03  STRN-152         PIC 9(02).
000370       03  STRN-153         PIC 9(02).
000380     02  STRN-15D  REDEFINES STRN-15.                             I.040427
000390       03  STRN-151D        PIC 9(03).                            I.040427
000400       03  F                PIC 9(03).                            I.040427
000410     02  STRN-16            PIC 9(01).                            ëqå…ãÊï™
000420     02  STRN-17            PIC 9(02).                            íSìñé“CD
000430     02  STRN-18            PIC 9(02).                            ìsìπï{åß
000440     02  STRN-19            PIC 9(01).                            è¡îÔê≈ãÊ
000450*****02  STRN-20            PIC 9(06).                            D.000809
000460     02  STRN-21            PIC 9(03).                            å¬êî
000470*****02  STRN-22.                                                 D.970710
000480*****  03  STRN-221         PIC 9(06).                            D.970710
000490*****  03  STRN-222         PIC 9(01).                            D.970710
000500*****02  STRN-14A           PIC 9(03).                            D.970710
000510     02  STRN-23            PIC 9(01).                            I.941021
000520     02  STRN-24            PIC 9(04).                            I.981005
000530     02  STRN-25            PIC X(10).                            I.981005
000540     02  STRN-26            PIC 9(08).                            I.000809
000550     02  F                  PIC X(04).                            I.000809
000560     02  STRN-90            PIC 9(01).                            I.000809
000570     02  STRN-91            PIC 9(01).                            I.000809
000580*****02  FILLER             PIC X(01).                            D.000809
000590*****02  FILLER             PIC X(15).                            D.981005
000600*****02  FILLER             PIC X(09).                            D.941208
000610*****02  FILLER             PIC X(07).                            D.970710
000620 01  STRN-R1.                                                     I.000809
000630     02  STRN1-20           PIC 9(06).                            I.000809
000640     02  STRN1-13           PIC 9(01).                            I.000809
000650     02  STRN1-01           PIC 9(08).                            I.000809
000660     02  STRN1-02           PIC 9(04).                            I.000809
000670     02  STRN1-51           PIC N(24).                            I.000809
000680     02  STRN1-52           PIC 9(06).                            I.081224
000690     02  F                  PIC X(30).                            I.081224
000700*****02  STRN1-52.                                                D.081224
000710*****  03  STRN1-521  OCCURS  6  PIC  9(06).                      D.081224
000720     02  STRN1-53           PIC S9(07).                           I.000809
000730     02  STRN1-54           PIC S9(07).                           I.000809
000740     02  STRN1-55           PIC S9(09).                           I.000809
000750     02  STRN1-90           PIC 9(01).                            I.000809
000760     02  STRN1-91           PIC 9(01).                            I.000809
000770**
