000010*    º∑≠≥ÿ¬œΩ¿∞         *
000020 FD  NT-SKM
000030     BLOCK      CONTAINS     3      RECORDS
000040     LABEL      RECORD       STANDARD
000050     VALUE      OF           IDENTIFICATION      "NT-SKM".
000060 01  SKM-R.
000070     02  SKM-KEY.                                                 KEY
000080         03  SKM-01      PIC 9(02).                               ãŒë±îNêî
000090     02  SKM-02.                                                  åéêî
000100       03  SKM-021       OCCURS  12
000110                         PIC 9(02)V9(03).
000120     02  SKM-03          PIC 9(01)V9(03).                         éxããó¶
000130     02  FILLER          PIC X(19).
