000010**********************************************************
000020*****     プリント　ファイル　(３３行／２０６列)     *****
000030**********************************************************
000040 FD  SP-F
000050     LABEL RECORD IS OMITTED
000060     LINAGE IS 33 LINES.
000070 01  SP-R             PIC  X(206).
