000010****************************************************
000020*****     得意先統計ファイル　（ＷＯＲＫ）     *****
000030*****   ( WK0128___ )  128/2  <TTM>            *****
000040****************************************************
000050 FD  TT-M
000060*****BLOCK  3 RECORDS                                             D.001123
000070     BLOCK  2 RECORDS                                             I.001123
000080     LABEL RECORD IS STANDARD
000090     VALUE OF IDENTIFICATION WK0128ID.                            I.001123
000100*****VALUE OF IDENTIFICATION WK0170ID.                            D.001123
000110 01  TT-R.
000120     02  TT-KEY.                                                  ｺｰﾄﾞ
000130       03  TT-TCD       PIC  9(004).                              得意先CD
000140     02  TT-TD.
000150       03  TT-TZZ       PIC S9(009).                              前月残高
000160       03  TT-TZZZ      PIC S9(007).                              　消費税
000170       03  TT-TUZ       PIC S9(009).                              売掛残高
000180       03  TT-TUZZ      PIC S9(007).                              　消費税
000190       03  TT-TUA       PIC S9(009).                              売上金額
000200       03  TT-TUAZ      PIC S9(007).                              　消費税
000210       03  TT-TNB       PIC S9(008).                              値引金額
000220       03  TT-TNBZ      PIC S9(006).                              　消費税
000230       03  TT-TNK       PIC S9(009).                              入金金額
000240       03  TT-TNKZ      PIC S9(007).                              　消費税
000250       03  TT-TUG       PIC S9(009).                              売上原価
000260*****02  TT-SD.                                                   D.001123
000270*****  03  TT-SZZ       PIC S9(009).                              D.001123
000280*****  03  TT-SZZZ      PIC S9(007).                              D.001123
000290*****  03  TT-SUA       PIC S9(009).                              D.001123
000300*****  03  TT-SUAZ      PIC S9(007).                              D.001123
000310*****  03  TT-STS       PIC S9(007).                              D.001123
000320*****  03  TT-STSZ      PIC S9(005).                              D.001123
000330*****  03  TT-SNK       PIC S9(009).                              D.001123
000340*****  03  TT-SNKZ      PIC S9(007).                              D.001123
000350     02  TT-TKC.                                                  地区ｺｰﾄﾞ
000360       03  TT-TKC1      PIC  9(001).
000370       03  TT-TKC2      PIC  9(001).
000380     02  TT-TNC.                                                  担当ｺｰﾄﾞ
000390       03  TT-TNC1      PIC  9(001).
000400       03  TT-TNC2      PIC  9(001).
000410     02  TT-FKC         PIC  9(002).                              都道府県
000420     02  TT-BC          PIC  9(001).                              部門ｺｰﾄﾞ
000430*****02  TT-SNG         PIC  9(004).                              D.001123
000440     02  TT-DNO         PIC  9(003).                              I.940830
000450     02  F              PIC  X(027).                              I.001123
000460*****02  F              PIC  X(005).                              D.001123
000470*****02  F              PIC  X(008).                              D.940830
000480*****02  F            PIC X(12).                                  D.930601
