000010***************************************
000020*****     ÈÝ¶Ý ·­³Ö Ò²»² Ì§²Ù     *****
000030*****      (YKYUYOF)   512/1      *****
000040***************************************
000050 FD  YKYUYOF
000060     BLOCK 1 RECORDS
000070     LABEL RECORD IS STANDARD
000080     VALUE OF IDENTIFICATION "YKYUYOF".
000090 01  YKYUYO-R.
000100*
000110*****02  YK-CODE.                                                 D.010124
000120*****  03  YK-SCD.                                                D.010124
000130*****    04  YK-KCD.                                              D.010124
000140*****      05  YK-BKC.                                            D.010124
000150*****        06  YK-KCD1    PIC  9(001).                          D.010124
000160*****        06  YK-KCD2    PIC  9(001).                          D.010124
000170*****      05  YK-KCD3      PIC  9(001).                          D.010124
000180*****    04  YK-CCD         PIC  9(001).                          D.010124
000190*****  03  YK-KEY           PIC  9(004).                          D.010124
000200     02  YK-SNG             PIC  9(006).                          I.970619
000210     02  YK-SNGD  REDEFINES YK-SNG.                               ¼·­³ËÞ
000220*****  03  YK-SN            PIC  9(002).                          D.970619
000230       03  YK-SN            PIC  9(004).                          I.970619
000240       03  YK-SG            PIC  9(002).
000250     02  YK-SNGSD REDEFINES YK-SNG.                               I.970619
000260       03  F                PIC  9(002).                          I.970619
000270       03  YK-SNGS          PIC  9(004).                          I.970619
000280*****02  YK-SNG   REDEFINES YK-SNGD  PIC  9(004).                 D.970619
000290     02  YK-KSC             PIC  9(001).                          I.010110
000300     02  YK-KEY             PIC  9(004).                          I.010124
000310     02  YK-SCD             PIC  9(004).                          I.010124
000320     02  YK-SCDD  REDEFINES YK-SCD.                               I.010124
000330       03  YK-KCD.                                                I.010124
000340         04  YK-BKC.                                              I.010124
000350           05  YK-KCD1      PIC  9(001).                          I.010124
000360           05  YK-KCD2      PIC  9(001).                          I.010124
000370         04  YK-KCD3        PIC  9(001).                          I.010124
000380       03  YK-CCD           PIC  9(001).                          I.010124
000390     02  YK-SB              PIC  9(001).                          ¾²ÍÞÂC
000400     02  YK-PNO             PIC  9(002).                          »¸Ë®³NO
000410     02  YK-YSC             PIC  9(002).                          Ô¸¼®¸C
000420     02  YK-YSCD  REDEFINES YK-YSC.
000430       03  YK-YSC1          PIC  9(001).
000440       03  YK-YSC2          PIC  9(001).
000450     02  YK-SHC             PIC  9(002).                          ¼Ê×²C
000460     02  YK-SHCD  REDEFINES YK-SHC.
000470       03  YK-SHC1          PIC  9(001).
000480       03  YK-SHC2          PIC  9(001).
000490     02  YK-JSC             PIC  9(002).                          ¼Þ­³¼®C
000500*    [  · Ý À ²  º ³ Ó ¸  ]
000510*
000520     02  YK-SKN             PIC  9(002).                          ¼­¯·ÝÆÁ
000530     02  YK-YSN             PIC  9(002).                          Õ³·­³ÆÁ
000540     02  YK-TK1             PIC  9(002).                          Ä¸·­³1
000550     02  YK-TK2             PIC  9(002).                          Ä¸·­³2
000560     02  YK-KSN             PIC  9(002).                          º³¼®³ÆÁ
000570     02  YK-SRN             PIC  9(001).                          ¾²·­³ÆÁ
000580     02  YK-KKN             PIC  9(002).                          ¹¯·ÝÆÁ
000590     02  YK-DKN             PIC  9(001).                          ÀÞ²·­³ÆÁ
000600*       ( Áº¸¥¿³À²¥¶Þ²¼­Â )
000610     02  YK-TSN             PIC  9(002).                          Á¥¿¥¶ÞÆÁ
000620     02  YK-TSG             PIC  9(002)V9(02).                    Á¥¿¥¶ÞH
000630*       ( ¸Ð±² ¶ÂÄÞ³ )
000640     02  YK-KMN             PIC  9(002).                          ¸Ð¶ÂÆÁ
000650     02  YK-KMG             PIC  9(003)V9(02).                    ¸Ð¶ÂH
000660*
000670     02  YK-ZGG             PIC  9(003)V9(02).                    »ÞÝ·Þ®³H
000680*       ( ·­³¼ÞÂ ¼­¯·Ý )
000690     02  YK-KJN             PIC  9(002).                          ·­³¼ÂÆÁ
000700     02  YK-KJ1             PIC  9(002)V9(02).                    ·­³¼ÂH1
000710*****02  YK-KJ2             PIC  9(002)V9(02).                    D.951207
000720*
000730     02  YK-SYG             PIC  9(003)V9(02).                    ¼ÝÔH
000740*
000750     02  YK-KTN             PIC  9(002).                          º³À²½³
000760*
000770     02  YK-PAG             PIC  9(003)V9(02).                    Êß°ÄH
000780*       ( Û³ÄÞ³ ¼Þ¶Ý )
000790     02  YK-HSG             PIC  9(003)V9(02).                    ¼­³·Þ®³H
000800     02  YK-HSGD  REDEFINES YK-HSG.
000810       03  YK-HSG1          PIC  9(003).
000820       03  YK-HSG2          PIC  9(002).
000830     02  YK-HTG             PIC  9(003)V9(02).                    Ã²¼ÞH
000840     02  YK-HTGD  REDEFINES YK-HTG.
000850       03  YK-HTG1          PIC  9(003).
000860       03  YK-HTG2          PIC  9(002).
000870     02  YK-HKJ             PIC  9(003)V9(02).                    ·¼Þ­ÝH
000880     02  YK-HKJD  REDEFINES YK-HKJ.
000890       03  YK-HKJ1          PIC  9(003).
000900       03  YK-HKJ2          PIC  9(002).
000910*    [  ¼ · ­ ³  º ³ Ó ¸  ]
000920*       ( ·¿·­³Ö )
000930     02  YK-KHK             PIC S9(006).                          ·ÎÝ·­³
000940     02  YK-KMK             PIC S9(006).                          ·ÝÑ·­³
000950     02  YK-JTT             PIC S9(005).                          ¼Þ­³À¸
000960*
000970     02  YK-KZT             PIC S9(005).                          ¶¿Þ¸
000980     02  YK-YST             PIC S9(005).                          Ô¸¼®¸
000990     02  YK-SMT             PIC S9(005).                          ¼®¸Ñ
001000*
001010     02  YK-ZGT             PIC S9(006).                          »ÞÝ·Þ®³
001020     02  YK-KJT             PIC S9(006).                          ·­³¼Â
001030     02  YK-KTT             PIC S9(005).                          º³À²
001040     02  YK-SYT             PIC S9(005).                          ¼ÝÔ
001050*****02  YK-KBT             PIC S9(004).                          D.990413
001060*
001070     02  YK-TKP             PIC S9(006).                          Â³·ÝÊß½
001080     02  YK-TKT             PIC S9(005).                          Â³·Ý
001090     02  YK-KST             PIC S9(004).                          ¹²¼®¸
001100     02  YK-TST             PIC S9(006).                          Á®³¾²
001110     02  YK-KTK             PIC S9(006).                          ¹¥Á¥¿¹ÞÝ
001120     02  YK-KKT             PIC S9(005).                          ¶²·Ý
001130     02  YK-STT1            PIC S9(005).                          ¿ÉÀÃ±Ã1
001140     02  YK-STT2            PIC S9(005).                          ¿ÉÀÃ±Ã2
001150     02  YK-STT3            PIC S9(006).                          I.951207
001160     02  YK-STT4            PIC S9(006).                          I.990413
001170*****02  YK-STT3            PIC S9(005).                          D.951207
001180*
001190*****02  YK-YHS             PIC S9(006).                          D.021021
001200     02  YK-YHS             PIC S9(007).                          I.021021
001210*
001220     02  YK-SSG             PIC S9(007).                          ¿³¼·­³
001230*    [  Ë ¶ ¾Þ ²  º ³ Ó ¸  ]
001240     02  YK-KSH             PIC S9(004).                          ¹²¼®¸ Ë
001250     02  YK-TPH             PIC S9(006).                          Êß½ Ë
001260     02  YK-TKH             PIC S9(005).                          Â³·Ý Ë
001270*    [  º ³ ¼Þ ®  º ³ Ó ¸  ]
001280*       ( ¼¬¶²Î¹Ý )
001290     02  YK-KKH             PIC S9(005).                          ¹Ýº³Î¹Ý
001300     02  YK-KNH             PIC S9(005).                          ÈÝ·ÝÎ¹Ý
001310*****02  YK-KGH             PIC S9(004).                          D.010110
001320     02  YK-KYH             PIC S9(004).                          ºÖ³Î¹Ý
001330*
001340     02  YK-KTG             PIC S9(007).                          ¶¾Þ²À²¼®
001350*       ( ¾Þ²·Ý )
001360     02  YK-STZ             PIC S9(006).                          ¼®Ä¸¾Þ²
001370     02  YK-JMZ             PIC S9(006).                          ¼Þ­³ÐÝ¾Þ
001380*       ( »Þ²¹² )
001390*****02  YK-ZKY             PIC S9(006).                          D.951013
001400     02  YK-ZK1             PIC S9(006).                          I.951013
001410     02  YK-ZK2             PIC S9(006).                          I.951013
001420     02  YK-ZKN             PIC S9(006).                          »Þ²¹²ÈÝ·
001430*       ( º³ÊÞ² )
001440     02  YK-KBH1            PIC S9(005).                          ¼®¯¹Ý
001450     02  YK-KBH2            PIC S9(005).                          ¸Â
001460*****02  YK-KBH3            PIC S9(005).                          D.951207
001470*****02  YK-KBH4            PIC S9(005).                          D.951207
001480     02  YK-KBH3            PIC S9(004).                          I.951207
001490     02  YK-KBH4            PIC S9(006).                          I.951207
001500*
001510*****02  YK-YKD             PIC S9(006).                          D.951013
001520*
001530     02  YK-STK1            PIC S9(006).                          º³¼Þ®1
001540     02  YK-STK2            PIC S9(006).                          º³¼Þ®2
001550     02  YK-STK3            PIC S9(006).                          º³¼Þ®3
001560     02  YK-STK4            PIC S9(006).                          º³¼Þ®4
001570     02  YK-STK5            PIC S9(006).                          º³¼Þ®5
001580*       ( Û³¸Ð ¶Ý¹² )
001590     02  YK-RKH             PIC S9(004).                          Û³¸ÐË
001600     02  YK-TTM             PIC S9(004).                          Ä³ÂÐ·Ý
001610*       ( Û³·Ý ¶Ý¹² )
001620     02  YK-ZRS             PIC S9(005).                          ¾ÞÝÛ³»²
001630     02  YK-RKK             PIC S9(006).                          Û³·ÝÍÝ»²
001640     02  YK-RMP             PIC S9(006).                          Ï²Ìß×Ý
001650     02  YK-RST             PIC S9(006).                          Û³·Ý¿ÉÀ
001660*       ( Û³¿ ¼Ê×² )
001670     02  YK-RSK1            PIC S9(005).                          ÔÝ¸Þ
001680     02  YK-RSK2            PIC S9(005).                          I.021021
001690     02  YK-RSK3            PIC S9(006).                          I.021021
001700*****02  YK-RSK2            PIC S9(005).                          D.951207
001710*****02  YK-RSK2            PIC S9(004).                          D.021021
001720*****02  YK-RSK3            PIC S9(005).                          D.021021
001730*****02  YK-RSK4            PIC S9(006).                          D.021021
001740*       ( ÀÞÝÀ² Î¹Ý )
001750     02  YK-DHR1            PIC S9(005).                          ÀÞ²1¾²Ò²
001760     02  YK-DHR2            PIC S9(005).                          ÆÎÝ¾²Ò²
001770     02  YK-DHR3            PIC S9(005).                          ½ÐÄÓ¾²Ò²
001780     02  YK-DHR4            PIC S9(005).                          ½ÐÄÓ¶²¼Þ
001790     02  YK-DHR5            PIC S9(005).                          ±ÒØ¶ÝÌ§Ð
001800     02  YK-DHR6            PIC S9(005).                          ¶Ý²Î¹Ý
001810*****02  YK-DHR7            PIC S9(005).                          D.990413
001820*
001830     02  YK-KGG             PIC S9(006).                          º³¼Þ®¹²
001840*       ( ¼Ê×² ·Ý¶Þ¸ )
001850     02  YK-BTK             PIC S9(006).                          ÃÝ·¶Þ¸
001860     02  YK-FKG1            PIC S9(007).                          ÌØºÐ¶Þ¸1
001870     02  YK-FKG2            PIC S9(007).                          ÌØºÐ¶Þ¸2
001880*
001890     02  YK-SHG             PIC S9(007).                          »¼Ë·¶Þ¸
001900*
001910     02  YK-TEN             PIC S9(006).                          Ã²±Ý
001920*
001930     02  YK-TKB             PIC S9(006).                          ÀÃ¶´ÊÞ×²
001940*
001950*****02  F                  PIC  X(015).                          D.951207
001960*****02  F                  PIC  X(019).                          D.970619
001970*****02  F                  PIC  X(008).                          D.990413
001980*****02  F                  PIC  X(015).                          D.010110
001990*****02  YK-KSC             PIC  9(001).                          D.010110
002000*****02  F                  PIC  X(004).                          D.990413
002010*****02  F                  PIC  X(019).                          D.021021
002020     02  F                  PIC  X(022).                          I.021021
002030*
002040     02  YK-KJC             PIC  9(001).                          ·­³¼ÞÂC
002050*
002060     02  YK-OK              PIC  9(004).                          ·­³KEY
002070*
002080*    [  Û³ÄÞ³ Æ¯½³ º³Ó¸  ]
002090*       ( ¼­¯·Ý Æ¯½³ )
002100     02  YK-SND.
002110       03  YK-SN1           PIC  9(002).                          ÆÂ·Ý
002120       03  YK-SN2           PIC  9(002).                          2-1
002130       03  YK-SN3           PIC  9(002).                          2-2
002140       03  YK-SN4           PIC  9(002).                          3-1A
002150       03  YK-SN5           PIC  9(002).                          3-2A
002160       03  YK-SN6           PIC  9(002).                          3-3A
002170       03  YK-SN7           PIC  9(002).                          3-1B
002180       03  YK-SN8           PIC  9(002).                          3-2B
002190       03  YK-SN9           PIC  9(002).                          3-3B
002200*       ( ·¼Þ­Ý Æ¯½³ )
002210     02  YK-KND.
002220       03  YK-KN1           PIC  9(002).                          ÆÂ·Ý
002230       03  YK-KN2           PIC  9(002).                          2-1
002240       03  YK-KN3           PIC  9(002).                          2-2
002250       03  YK-KN4           PIC  9(002).                          3-1A
002260       03  YK-KN5           PIC  9(002).                          3-2A
002270       03  YK-KN6           PIC  9(002).                          3-3A
002280       03  YK-KN7           PIC  9(002).                          3-1B
002290       03  YK-KN8           PIC  9(002).                          3-2B
002300       03  YK-KN9           PIC  9(002).                          3-3B
