000010***************************************
000020*    ¥◊∞ DISPLAY (‹∞∏)                *                           85.01.24
000030***************************************
000040 01  DISP-ERR-WORK.
000050     02  DISP-MSG.
000060         03  ERR-MSGX.
000070             04  ERR-MSGN     PIC N(30).
000080         03  ERR-SPACE        PIC X(60).
000090         03  ERR-F            PIC X(12).
000100         03  ERR-M            PIC X(01).
000110         03  ERR-K            PIC X(30).
000120         03  ERR-FLG          PIC X(02).
000130     02  ERR-LIN              PIC 9(02).                          A-890816
000140 01  WKUB-KEY.
000150     02  WKUB-01              PIC  9(02).                         éÌóﬁ
000160     02  WKUB-02              PIC  9(02).                         ãÊï™
000170 01  IPN-KYO-KBN              PIC  9(01).                         A-910927
000180***  ÇiÇrÅ|ÇrÇhÇfÇmÇÊÇËÇÃàÍî Å^ã≥àÁãÊï™
