SCREEN SCAM01                                                              00010
ARE (01,24)_                                                               00020
BOX (08,08) (09,68)_                                                       00030
VER (08,20) (09)_   VER (08,32) (09)_   VER (08,44) (09)_                  00040
VER (08,56) (09)_                                                          00050
UND (08,08) (,68)_  UND (06,57) (,62)_                                     00060
CON (04,20) "処理日付をセットして下さい"_     CON (6,58) "№ "_            00070
CON (08,12) "1.履物      2.工品     3.手形"_                               00080
CON (08,47) "4.購買　    5.その他"_                                        00090
CON (13,15) "【　西暦コントロール　】"_                                    00100
CON (13,43) "【　和暦コントロール　】"_                                    00110
CON (15,16) "開始年 終了年 西暦年(+)"_                                     00120
CON (15,44) "開始年 終了年 西暦年(+)"_                                     00130
CON (17,10) NC"①"_                                                        00140
CON (19,10) NC"②"_                                                        00150
CON (22,46) "確認 OK=1, NO=9   ﾘﾀｰﾝ"_                                      00160
END_                                                                       00170
