SCREEN  SCBM01                                                             00010
ARE (01,24)_                                                               00020
BOX (05,13) (,30)_  BOX (07,13) (19,74)_                                   00030
VER (05,25)_  VER (07,25) (19)_  VER (12,40)_  VER (12,51)_                00040
UND (08,13)(,74)_  UND (10,13) (18,74)_                                    00050
CON (01,20) NC"＊＊＊　仕入先マスターメンテナンス　＊＊＊"_                00060
CON (03,15) "登録=1 修正=2 削除=3 ﾘｽﾄ=4 終了=9   ﾘﾀｰﾝ"_                    00070
CON (05,14) "仕入先ｺｰﾄﾞ"_   CON (07,14) "仕 入 先 名"_                     00080
CON (08,14) "ｼｲﾚｻｷﾒｲ    "_                                                 00090
CON (09,14) "住 所 (上)"_   CON (10,20) "(下)"_                            00100
CON (11,14) "郵 便 番 号"_                                                 00110
CON (12,14) "電 話 番 号                ＦＡＸ番号"_                       00120
CON (13,14) "都道府県CD"_                                                  00130
CON (14,14) "消費税区分       (外税=0,内税=1)"_                            00140
CON (15,14) "支払方法         (振込=1,郵送=2,来訪=3)"_                     00150
CON (16,14) "送金案内C        (相手負担=0,日進負担=1)  切手"_              00160
CON (17,14) NC"支手サイト"_                                                00170
CON (18,14) "部門区分"_                                                    00180
CON (19,14) "停止年月"_                                                    00190
CON (23,24) "確認 OK=1 NO=9   ﾘﾀｰﾝ"_                                       00200
END_                                                                       00210
