SCREEN      SCBM11                                                         00010
MODE        K25                                                            00020
AREA         (01,24)_                                                      00030
BOX  (05,04) (06,60)_    BOX  (08,04) (16,71)_                             00040
UND  (05,04) (,60)_      UND  (08,04) (15,71)_                             00050
VER  (05,11) (06)_       VER  (08,15) (16)_                                00060
**                                                                         00070
CON  (01,13)  NC"＊＊＊　　材料マスター　メンテナンス　　＊＊＊"_          00080
CON  (03,16)  "登録=1 修正=2 削除=3 作表=4 終了=9   ﾘﾀｰﾝ"_                 00090
CON  (05,05)  "コード 材　　　料　　　名"_                                 00100
CON  (08,05)  NC"用途区分"_        CON  (09,05)  NC"在庫区分"_             00110
CON  (10,05)  NC"製品区分"_        CON  (11,05)  NC"単位区分"_             00120
CON  (12,05)  NC"最終単価"_        CON  (13,05)  NC"単位区分"_             00130
CON  (14,05)  NC"計算単価"_        CON  (15,05)  "加工前ｺｰﾄﾞ"_             00140
CON  (16,05)  NC"部門区分"_                                                00150
CON  (22,25)  "確認  OK=1 NO=9   ﾘﾀｰﾝ"_                                    00160
END_                                                                       00170
