SCREEN  SCFB01                                                             00010
ARE (01,24)_                                                               00020
CON (01,11) NC"＊＊＊　　Ｆ・Ｂ　振込先マスター　メンテナンス　　＊＊＊"_  00030
CON (03,18) "登録=1 修正=2 削除=3 作表=4 終了=9   ﾘﾀｰﾝ"_                   00040
CON (05,08) "ｺｰﾄﾞ 振　込　先　名"_  CON (05,62) "振込先区分"_              00050
CON (08,13) "振込口座名"_  CON (09,13) "銀行ｺｰﾄﾞ"_                         00060
CON (10,13) "預金種別              1.普通預金  2.当座預金"_                00070
CON (11,13) "口座番号"_                                                    00080
CON (12,13) "手数料区分            0.日進ゴム  1.振込先"_                  00090
CON (14,13) "振込口座名"_  CON (15,13) "銀行ｺｰﾄﾞ"_                         00100
CON (16,13) "預金種別              1.普通預金  2.当座預金"_                00110
CON (17,13) "口座番号"_                                                    00120
CON (18,13) "手数料区分            0.日進ゴム  1.振込先"_                  00130
CON (23,30) "確認  OK=1 NO=9   ﾘﾀｰﾝ"_                                      00140
BOX (05,07) (06,72)_  UND (05,07) (,72)_                                   00150
VER (05,12) (06)_  VER (05,61) (06)_                                       00160
BOX (08,12) (12,64)_  UND (08,12) (11,64)_  VER (08,23) (12)_              00170
BOX (14,12) (18,64)_  UND (14,12) (17,64)_  VER (14,23) (18)_              00180
END_                                                                       00190
