SCREEN  SCFB10                                                             00010
ARE (01,24)_                                                               00020
CON (01,14) NC"＊＊＊　　Ｆ・Ｂ　総合振込金額　入力　　＊＊＊"_            00030
CON (05,08) "ｺｰﾄﾞ 振　込　先　名"_  CON (05,62) "振込先区分"_              00040
CON (07,08) "終了=ｆ･9 , NEXT=ｆ･10"_                                      00050
CON (08,13) "振込口座名"_  CON (09,13) "銀行ｺｰﾄﾞ"_                         00060
CON (10,13) "預金種別              1.普通預金  2.当座預金"_                00070
CON (11,13) "口座番号"_                                                    00080
CON (12,13) "手数料区分            0.日進ゴム  1.振込先"_                  00090
CON (13,13) "振込金額"_                                                    00100
CON (15,13) "振込口座名"_  CON (16,13) "銀行ｺｰﾄﾞ"_                         00110
CON (17,13) "預金種別              1.普通預金  2.当座預金"_                00120
CON (18,13) "口座番号"_                                                    00130
CON (19,13) "手数料区分            0.日進ゴム  1.振込先"_                  00140
CON (20,13) "振込金額"_                                                    00150
CON (23,28) "確認  OK=1 NO=9   ﾘﾀｰﾝ"_                                      00160
BOX (05,07) (06,72)_  UND (05,07) (,72)_                                   00170
VER (05,12) (06)_  VER (05,61) (06)_                                       00180
BOX (08,12) (13,64)_  UND (08,12) (12,64)_  VER (08,23) (13)_              00190
BOX (15,12) (20,64)_  UND (15,12) (19,64)_  VER (15,23) (20)_              00200
REV (05,07) (,11)_  REV (13,12) (,22)_  REV (20,12) (,22)_                 00210
END_                                                                       00220
