SCREEN SCHK21                                                              00010
ARE (01,24)_                                                               00020
CON (01,22) NC"得意先別　売掛残高　問合せ"_  REV (01,21) (,48)_            00030
CON (02,01) NC"得意先"_  CON (02,66) "終了=ｆ･9"_                          00040
CON (04,27) NC"売上・値引・入金"_                                          00050
CON (04,47) NC"請求"_                                                      00060
CON (04,60) NC"売掛残高"_                                                  00070
CON (05,06) NC"月日"_    CON (05,11) NC"伝票№"_                           00080
CON (05,18) NC"項目"_                                                      00090
CON (05,29) NC"金　額"_  CON (05,40) NC"消費税"_                           00100
CON (05,47) NC"年月"_                                                      00110
CON (05,58) NC"金　額"_  CON (05,69) NC"消費税"_                           00120
CON (23,57) "NEXT=0 , 得意先=9   ﾘﾀｰﾝ"_                                    00130
BOX (04,05) (05,75)_  BOX (06,05) (22,75)_                                 00140
UND (04,22) (,46)_  UND (04,51) (,75)_                                     00150
VER (04,10) (22)_  VER (04,17) (22)_  VER (04,22) (22)_                    00160
VER (05,35) (22)_  VER (04,46) (22)_  VER (04,51) (22)_                    00170
VER (05,64) (22)_                                                          00180
END_                                                                       00190
