SCREEN SCHK50                                                              00010
ARE (01,24)_                                                               00020
CON (01,17) "＊＊＊　　得意先マスター　メンテナンス　　＊＊＊"_            00030
CON (03,16) "登録=1 修正=2 削除=3 作表=4 問合せ=5 終了=9   ﾘﾀｰﾝ"_          00040
CON (05,02) "ｺｰﾄﾞ"_  CON (05,12) "得意先名"_                               00050
UND (05,01) (,73)_                                                         00060
BOX (06,58) (,78)_                                                         00070
BOX (07,01) (,34)_   BOX (07,49) (08,71)_                                  00080
UND (07,49) (,71)_                                                         00090
BOX (08,01) (09,47)_                                                       00100
OVE (09,71) (,80)_   UND (09,49) (,80)_                                    00110
BOX (10,01) (,80)_                                                         00120
BOX (12,01) (,80)_   BOX (13,01) (,80)_                                    00130
BOX (15,01) (,69)_   BOX (16,01) (17,47)_                                  00140
BOX (18,01) (,57)_   BOX (19,01) (,49)_                                    00150
BOX (21,01) (,77)_                                                         00160
VER (07,22)_  VER (09,49)_                                                 00170
VER (10,06)_  VER (10,13)_  VER (10,20)_  VER (10,27)_                     00180
VER (10,38)_  VER (10,52)_  VER (10,66)_                                   00190
VER (12,13)_  VER (12,23)_  VER (12,41)_  VER (12,53)_  VER (12,65)_       00200
VER (13,19)_  VER (13,37)_  VER (13,53)_                                   00210
VER (18,13)_  VER (18,35)_                                                 00220
CON (06,13) "(ﾌﾘｶﾞﾅ)"_                                                     00230
CON (06,59) NC"部門"_                                                      00240
CON (07,02) NC"都道府県"_    CON (07,23) NC"〒"_                           00250
CON (07,50) NC"ＴＥＬ"_                                                    00260
CON (08,02) NC"住所"_        CON (08,50) NC"ＦＡＸ"_                       00270
CON (09,50) NC"担当"_                                                      00280
CON (10,02) NC"税"_          CON (10,07) NC"台帳"_                         00290
CON (10,14) NC"備考"_        CON (10,21) NC"生協"_                         00300
CON (10,28) NC"教育振興"_                                                  00310
CON (10,53) NC"開始年月"_    CON (10,67) NC"停止年月"_                     00320
CON (12,02) NC"請求締日"_    CON (12,14) NC"支払日"_                       00330
CON (12,24) NC"支払方法１"_  CON (12,37) NC"２"_                           00340
CON (12,42) "入金ｻｲﾄ"_       CON (12,54) "手形ｻｲﾄ"_                        00350
CON (12,66) NC"送金料"_                                                    00360
CON (13,02) NC"現金引対象"_  CON (13,18) "%"_                              00370
CON (13,20) NC"手数料対象"_  CON (13,36) "%"_                              00380
CON (13,38) NC"与信限度"_                                                  00390
CON (13,54) NC"運賃他１"_    CON (13,70) NC"２"_                           00400
CON (15,02) NC"請求用得意先名"_                                            00410
CON (16,02) NC"住所"_                                                      00420
CON (18,02) NC"〒"_          CON (18,14) NC"ＴＥＬ"_                       00430
CON (18,36) NC"ＦＡＸ"_                                                    00440
CON (19,02) NC"領収用得意先名"_                                            00450
CON (21,02) NC"入金"_   CON (21,06) "ｺｰﾄﾞ"_   CON (21,16) NC"入金先名"_    00460
CON (23,41) "確認  OK=1 NO=9   ﾘﾀｰﾝ"_                                      00470
END_                                                                       00480
