SCREEN SCHK15                                                              00010
ARE (01,24)_                                                               00020
CON (01,22) NC"得意先別　売掛残高　問合せ"_  REV (01,21) (,48)_            00030
CON (02,01) NC"得意先"_  CON (02,66) "終了=ｆ･9"_                          00040
CON (04,21) NC"売上・値引"_  CON (04,46) NC"入　金"_                       00050
CON (04,67) NC"売掛残高"_                                                  00060
CON (05,01) NC"月日"_  CON (05,06) NC"伝票№"_                             00070
CON (05,20) NC"金　額"_  CON (05,30) NC"消費税"_                           00080
CON (05,43) NC"金　額"_  CON (05,52) NC"消費税"_                           00090
CON (05,65) NC"金　額"_  CON (05,75) NC"消費税"_                           00100
CON (23,06) "値引は*"_   CON (23,52) "NEXT=0 , 得意先=9   ﾘﾀｰﾝ"_           00110
UND (03,01) (,80)_  UND (04,13) (,80)_  UND (05,01) (,80)_                 00120
OVE (06,01) (,80)_  UND (22,01) (,80)_                                     00130
VER (04,05) (22)_  VER (04,13) (22)_  VER (05,26) (22)_                    00140
VER (04,36) (22)_  VER (05,49) (22)_  VER (04,58) (22)_                    00150
VER (05,71) (22)_                                                          00160
END_                                                                       00170
