SCREEN  SCHT75                                                             00010
ARE (01,24)_                                                               00020
CON (01,29) NC"óöï®íSìñï îÃîÑåvâÊÅ@ì¸óÕ"_                                  00030
CON (03,30) "'  îN"_         CON (03,39) NC"íSìñ"_                         00040
BOX (05,31) (,50)_  BOX (06,31) (19,50)_    BOX (20,31) (,50)_             00050
UND (06,31) (18,50)_                                                       00060
VER (05,38) (20)_                                                          00070
CON (05,43) NC"åvÅ@âÊ"_                                                    00080
CON (06,32) NC"Å@ÇTåé"_                                                    00090
CON (07,32) NC"Å@ÇUåé"_                                                    00100
CON (08,32) NC"Å@ÇVåé"_                                                    00110
CON (09,32) NC"Å@ÇWåé"_                                                    00120
CON (10,32) NC"Å@ÇXåé"_                                                    00130
CON (11,32) NC"ÇPÇOåé"_                                                    00140
CON (12,32) NC"è¨Å@åv"_                                                    00150
CON (13,32) NC"ÇPÇPåé"_                                                    00160
CON (14,32) NC"ÇPÇQåé"_                                                    00170
CON (15,32) NC"Å@ÇPåé"_                                                    00180
CON (16,32) NC"Å@ÇQåé"_                                                    00190
CON (17,32) NC"Å@ÇRåé"_                                                    00200
CON (18,32) NC"Å@ÇSåé"_                                                    00210
CON (19,32) NC"è¨Å@åv"_                                                    00220
CON (20,32) NC"çáÅ@åv"_                                                    00230
CON (22,37) "ämîF  OK=1 NO=9   ÿ¿∞›"_                                      00240
END_                                                                       00250
