SCREEN SCHT36                                                              00010
ARE (01,24)_                                                               00020
CON (01,16) "＊＊＊　　履物部門担当別　売上集計問合せ　　＊＊＊"_          00030
BOX (03,12) (,69)_  BOX (04,12) (22,69)_                                   00040
VER (03,17) (22)_  VER (03,30) (22)_                                       00050
VER (03,43) (22)_  VER (03,56) (22)_                                       00060
CON (03,13) NC"担当"_    CON (03,20) NC"カジュアル"_                       00070
CON (03,37) NC"ワーク"_  CON (03,50) NC"教　育"_                           00080
CON (03,63) NC"合　計"_                                                    00090
END_                                                                       00100
