SCREEN SCHT21                                                              00010
ARE (1,24)_                                                                00020
BOX (04,09) (,76)_  BOX (05,09) (22,76)_                                   00030
UND (05,09) (21,76)_                                                       00040
VER (04,14) (22)_  VER (04,67) (22)_                                       00050
CON (01,16) NC"＊＊＊　品種別　得意先預り　問合せ　＊＊＊"_                00060
CON (02,64) NC"月　日"_                                                    00070
CON (03,03) "品名ｺｰﾄﾞ"_  CON (03,69) "終了=ｆ･9"_                          00080
CON (04,10) "ｺｰﾄﾞ 得　意　先　名"_    CON (04,69) "預り数"_                00090
END_                                                                       00100
