SCREEN SCHT15                                                              00010
ARE (1,24)_                                                                00020
BOX (03,01) (,66)_  BOX (04,01) (,79)_  BOX (05,01) (22,79)_               00030
VER (03,08) (22)_  VER (04,57) (22)_  VER (04,66) (22)_                    00040
CON (01,13) NC"＊＊＊　　履物得意先品種別　売上集計　問合せ　　＊＊＊"_    00050
CON (02,67) NC"  月　日現在"_                                              00060
CON (03,02) NC"得意先"_  CON (03,68) "終了=ｆ･9"_                          00070
CON (04,03) "ｺｰﾄﾞ  品　　　　　名"_                                        00080
CON (04,62) NC"数量"_    CON (04,75) "金額"_                               00090
CON (23,54) "NEXT=1 , 得意先=9   ﾘﾀｰﾝ"_                                    00100
END_                                                                       00110
