SCREEN SCHT71                                                              00010
ARE (01,24)_                                                               00020
CON (01,13) "【　　履物分類　販売計画・実績　対比表　】"_                  00030
CON (01,59) "'  年  月  日"_                                               00040
CON (02,19) NC"分　類　名"_  CON (02,42) NC"計画金額"_                     00050
CON (02,55) NC"実績金額"_                                                  00060
CON (02,65) NC"達成率"_      CON (02,71) "%"_                              00070
BOX (02,07) (,72)_  BOX (03,07) (22,72)_                                   00080
UND (03,07) (21,72)_                                                       00090
VER (02,38) (22)_  VER (02,51) (22)_  VER (02,64) (22)_                    00100
CON (23,49) "確認   OK=1 NO=9   ﾘﾀｰﾝ"_                                     00110
END_                                                                       00120
