SCREEN  SCJM51                                                             00010
ARE (01,24)_                                                               00020
CON (01,13) NC"＊＊＊　　振込銀行マスター　メンテナンス　　＊＊＊"_        00030
CON (03,13) "ACT : 登録=1 修正=2 削除=3 作表=4 終了=9"_                    00040
BOX (04,12) (,62)_  BOX (05,12) (20,62)_  UND (05,12) (19,62)_             00050
VER (04,16) (20)_  VER (04,25) (20)_  VER (04,41) (20)_                    00060
VER (04,57) (20)_                                                          00070
CON (04,13) "ACT 銀行ｺｰﾄﾞ 銀行名          本支店名        確認"_           00080
CON (21,46) "確認 : OK=1 NO=9"_                                            00090
END_                                                                       00100
