SCREEN SCKM05                                                              00010
ARE (01,24)_                                                               00020
CON (01,15) NC"＊＊＊　　防振材料マスター　メンテナンス　　＊＊＊"_        00030
CON (03,13) "ACT : 登録=1 修正=2 削除=3 作表=4 終了=9"_                    00040
CON (04,46) "素材          品名  確"_                                      00050
CON (05,13) "ACT   ｺｰﾄﾞ  材　料　名"_                                      00060
CON (05,46) "区分   単  価  ｺｰﾄﾞ 認"_                                      00070
BOX (04,12) (05,68)_  BOX (06,12) (20,68)_                                 00080
VER (04,16) (20)_  VER (04,24) (20)_  VER (04,45) (20)_                    00090
VER (04,50) (20)_  VER (04,59) (20)_  VER (04,65) (20)_                    00100
CON (21,47) "確認 : OK=1 NO=9 ﾘﾀｰﾝ"_                                       00110
END_                                                                       00120
