SCREEN SCKT71                                                              00010
ARE (01,24)_                                                               00020
CON (01,27) NC"マット他　受払表　（金額）"_                                00030
REV (01,26) (,53)_                                                         00040
OVE (02,01) (03,80)_  UND (02,01) (22,80)_                                 00050
CON (02,02) "ｺｰﾄﾞ 品　　名"_                                               00060
CON (02,30) "前月繰越   当月入庫   当月売上   翌月繰越  売上粗利"_         00070
CON (23,47) "NEXT=ﾘﾀｰﾝ , 終了=ｆ･9   "_                                    00080
END_                                                                       00090
