SCREEN SCKT51                                                              00010
ARE (01,24)_                                                               00020
CON (01,02) NC"【　　工品　用途区分別　製品受払　問合せ　　】"_            00030
CON (01,58) "( 防振    ･ その他    )"_                                     00040
BOX (02,01) (,80)_  BOX (03,01) (22,80)_  BOX (23,29) (,80)_               00050
UND (03,01) (21,80)_                                                       00060
VER (02,32) (23)_  VER (02,44) (23)_  VER (02,56) (23)_                    00070
VER (02,68) (23)_                                                          00080
CON (02,02) NC"用　途　区　分　名"_                                        00090
CON (02,36) NC"前月繰越"_   CON (02,48) NC"当月入庫"_                      00100
CON (02,60) NC"当月売上"_   CON (02,72) NC"翌月繰越"_                      00110
CON (23,02) "NEXT=F5,BACK=F6,END=F9"_                                      00120
CON (23,30) NC"計"_                                                        00130
END_                                                                       00140
