SCREEN SCKT55                                                              00010
ARE (01,24)_                                                               00020
CON (01,02) NC"【　　工品　用途区分別　販売実績　問合せ　　】"_            00030
CON (01,56) "( 防振    ･ その他    )"_                                     00040
BOX (02,01) (,79)_  BOX (03,01) (22,79)_  BOX (23,30) (,79)_               00050
UND (03,01) (21,79)_                                                       00060
VER (02,30) (22)_  VER (02,43) (23)_  VER (02,55) (23)_  VER (02,67) (23)_ 00070
CON (02,02) NC"用　途　区　分　名"_                                        00080
CON (02,35) NC"売上数量"_   CON (02,47) NC"売上金額"_                      00090
CON (02,59) NC"売上原価"_   CON (02,71) NC"売上粗利"_                      00100
CON (23,02) "NEXT=F5,BACK=F6,END=F9"_                                      00120
CON (23,37) NC"合　計"_                                                    00110
END_                                                                       00120
