SCREEN  SCKY75                                                             00010
ARE (01,24)_                                                               00020
CON (01,08) "'  îN"_                                                       00030
BOX (04,07) (19,40)_  BOX (04,43) (19,76)_                                 00040
UND (04,07) (18,40)_  UND (04,43) (18,76)_                                 00050
VER (04,14) (19)_  VER (04,27) (19)_                                       00060
VER (04,50) (19)_  VER (04,63) (19)_                                       00070
CON (04,08) NC"ñhÅ@êU"_     REV (04,07) (,13)_                             00080
CON (04,44) NC"ä¬Å@ã´"_     REV (04,43) (,49)_                             00090
CON (04,20) NC"åvÅ@âÊ"_      CON (04,33) NC"é¿Å@ê—"_                       00100
CON (04,56) NC"åvÅ@âÊ"_      CON (04,69) NC"é¿Å@ê—"_                       00110
CON (05,08) NC"Å@ÇTåé"_      CON (05,44) NC"Å@ÇTåé"_                       00120
CON (06,08) NC"Å@ÇUåé"_      CON (06,44) NC"Å@ÇUåé"_                       00130
CON (07,08) NC"Å@ÇVåé"_      CON (07,44) NC"Å@ÇVåé"_                       00140
CON (08,08) NC"Å@ÇWåé"_      CON (08,44) NC"Å@ÇWåé"_                       00150
CON (09,08) NC"Å@ÇXåé"_      CON (09,44) NC"Å@ÇXåé"_                       00160
CON (10,08) NC"ÇPÇOåé"_      CON (10,44) NC"ÇPÇOåé"_                       00170
CON (11,08) NC"è¨Å@åv"_      CON (11,44) NC"è¨Å@åv"_                       00180
CON (12,08) NC"ÇPÇPåé"_      CON (12,44) NC"ÇPÇPåé"_                       00190
CON (13,08) NC"ÇPÇQåé"_      CON (13,44) NC"ÇPÇQåé"_                       00200
CON (14,08) NC"Å@ÇPåé"_      CON (14,44) NC"Å@ÇPåé"_                       00210
CON (15,08) NC"Å@ÇQåé"_      CON (15,44) NC"Å@ÇQåé"_                       00220
CON (16,08) NC"Å@ÇRåé"_      CON (16,44) NC"Å@ÇRåé"_                       00230
CON (17,08) NC"Å@ÇSåé"_      CON (17,44) NC"Å@ÇSåé"_                       00240
CON (18,08) NC"è¨Å@åv"_      CON (18,44) NC"è¨Å@åv"_                       00250
CON (19,08) NC"çáÅ@åv"_      CON (19,44) NC"çáÅ@åv"_                       00260
CON (22,67) NC"ämîF"_                                                      00270
END_                                                                       00280
