SCREEN SCTA01                                                              00010
ARE (01,24)_                                                               00020
CON (01,20) NC"＊＊＊　　送金案内　入力　　＊＊＊"_                        00030
CON (03,17) "[  追加=1 修正=2 削除=3 終了=9   ﾘﾀｰﾝ  ]"_                    00040
BOX (05,10) (,23)_  BOX (07,10) (,26)_  BOX (09,10) (,24)_                 00050
BOX (10,10) (,68)_  BOX (12,10) (13,29)_  UND (12,10) (,29)_               00060
VER (05,19)_  VER (07,19)_  VER (09,19) (10)_  VER (12,19) (13)_           00070
CON (05,13) NC"ＮＯ"_  CON (07,11) NC"日　　付"_                           00080
CON (09,12) "ｺ ｰ ﾄﾞ"_  CON (10,11) NC"送金先名"_                           00090
CON (12,11) NC"送金区分"_  CON (13,11) NC"金　額"_                         00100
CON (20,25) "確認  OK=1 NO=9   ﾘﾀｰﾝ"_                                      00110
END_                                                                       00120
