SCREEN  SCTD20                                                             00010
ARE (01,24)_                                                               00020
CON (01,13) NC"＊＊＊　　受取手形　異動データ　入力　　＊＊＊"_            00030
CON (03,16) "[  登録=1 修正=2 削除=3 終了=9   ﾘﾀｰﾝ  ]"_                    00040
BOX (05,10) (,25)_  BOX (07,10) (09,73)_  BOX (11,10) (15,61)_             00050
UND (11,10) (14,61)_                                                       00060
VER (05,20)_  VER (07,20) (09)_  VER (11,20) (15)_                         00070
CON (05,11) NC"手形番号"_  CON (07,11) NC"取引先名"_                       00080
CON (08,11) "満 期 日"_    CON (09,11) NC"金　　額"_                       00090
CON (11,11) "異 動 日"_   CON (12,11) NC"処理区分"_                        00100
CON (13,11) "銀行ｺｰﾄﾞ"_   CON (14,11) "振 出 日"_                          00110
CON (15,11) "引 受 日"_                                                    00120
CON (18,20) "確認  OK=1 NO=9   ﾘﾀｰﾝ"_                                      00130
END_                                                                       00140
