SCREEN SCTD10                                                              00010
ARE (01,24)_                                                               00020
CON (01,16) NC"＊＊＊　　手形・領収書・買掛支払入力　　＊＊＊"_            00030
CON (03,13) "[  登録=1  修正=2  削除=3  終了=9   ﾘﾀｰﾝ  ]"_                 00040
BOX (05,09) (11,79)_  BOX (13,09) (14,69)_                                 00050
BOX (16,09) (,56)_    BOX (17,09) (21,56)_                                 00060
UND (05,09) (10,79)_  UND (17,09) (20,56)_  UND (13,09) (,69)_             00070
VER (05,20) (11)_  VER (13,20) (14)_                                       00080
VER (17,22) (21)_  VER (17,32) (21)_  VER (17,33) (21)_  VER (17,46) (21)_ 00090
CON (05,10) NC"日　　付"_  CON (06,10) NC"手形区分"_                       00100
CON (07,10) NC"手形番号"_  CON (08,10) "取引先ｺｰﾄﾞ"_                       00110
CON (09,10) "満 期 日"_    CON (10,10) NC"金　　額"_                       00120
CON (11,10) NC"支払場所"_  CON (13,10) "振 出 人"_                         00130
                           CON (14,10) "領収書区分"_                       00140
CON (16,17) NC"支　払　手　形　　相　手　科　目"_                          00150
CON (17,10) "材 料 費　12            仕入商品  14"_                        00160
CON (18,10) "　  消費税                  消費税  "_                        00170
CON (19,10) "設    備  46            外注工賃  20"_                        00180
CON (20,10) "製造経費  22            営業経費  34"_                        00190
CON (21,10) "そ の 他  52"_                                                00200
CON (23,23) "確認  OK=1 NO=9   ﾘﾀｰﾝ"_                                      00210
END_                                                                       00220
