SCREEN  SCTM01                                                             00010
ARE (01,24)_                                                               00020
CON (01,17)  NC"＊＊＊　　銀行マスター　メンテナンス　　＊＊＊"_           00030
CON (03,02)  "ACT : 登録=1 修正=2 削除=3 作表=4 終了=9"_                   00040
BOX (04,01) (,78)_      BOX (05,01) (20,78)_                               00050
UND (05,01) (19,78)_                                                       00060
VER (04,05) (20)_       VER (04,10) (20)_       VER (04,27) (20)_          00070
VER (04,44) (20)_       VER (04,53) (20)_       VER (04,64) (20)_          00080
VER (04,73) (20)_                                                          00090
CON (04,02) "ACT ｺｰﾄﾞ 銀　行　名       本　支　店　名"_                    00100
CON (04,45) "割引区分  割引残高  作表区分 確認"_                           00110
CON (21,57) "確認 : OK=1 NO=9 ﾘﾀｰﾝ"_                                       00120
END_                                                                       00130
