SCREEN SCTR05                                                              00010
ARE (01,24)_                                                               00020
CON (01,14) NC"＊＊＊　　領収書ファイル　入力　　＊＊＊"_                  00030
CON (03,17) "登録=1 修正=2 削除=3 終了=9   ﾘﾀｰﾝ"_                          00040
BOX (05,10) (,17)_  BOX (07,10) (12,57)_  UND (07,10) (11,57)_             00050
VER (05,13)_  VER (07,19) (12)_                                            00060
CON (05,11) NC"№"_  CON (07,11) NC"受取日"_                               00070
CON (08,11) NC"取引先"_  CON (09,11) NC"金　額"_                           00080
CON (10,11) NC"相殺区分"_  CON (11,11) NC"印紙代"_                         00090
CON (12,11) NC"再発行"_                                                    00100
CON (20,23) "確認  OK=1 NO=9   ﾘﾀｰﾝ"_                                      00110
END_                                                                       00120
