SCREEN SH015M                                                              00010
ARE (01,24)_                                                               00020
BOX (05,02) (,74)_      BOX (07,02) (21,79)_                               00030
UND (07,02) (,79)_                                                         00040
VER (05,07)_            VER (05,14)_             VER (05,21)_              00050
VER (07,09) (21)_       VER (07,62) (21)_        VER (07,67) (21)_         00060
VER (07,73) (21)_                                                          00070
CON (01,19) NC"＊＊＊　　得意先品名単価　問合せ　　＊＊＊"_                00080
CON (03,21) NC"得意先品名別"_     CON (03,33) "=1 , "_                     00090
CON (03,38) NC"品名得意先別"_     CON (03,50) "=2   ﾘﾀｰﾝ"_                 00100
CON (05,03) "ｺｰﾄﾞ"_                                                        00110
CON (07,04) "ｺｰﾄﾞ"_               CON (07,63) "ｻｲｽﾞ"_                      00120
CON (07,69) NC"売価"_             CON (07,75) NC"上代"_                    00130
CON (23,21) NC"ＮＥＸＴ"_         CON (23,29) "=ﾘﾀｰﾝ , ｺｰﾄﾞ"_              00140
CON (23,41) NC"入力"_             CON (23,45) "=BACKSPACE , "_             00150
CON (23,58) NC"終了"_             CON (23,62) "F9   "_                     00160
END_                                                                       00170
