000010******************************************************************
000020*    通販　明細ファイル
000030*        (64/4)                           1998/10/15
000040******************************************************************
000050 FD  THMF
000060     BLOCK  4 RECORDS
000070     LABEL RECORD IS STANDARD
000080     VALUE OF IDENTIFICATION "THMF".
000090 01  THM-R.
000100     02  THM-KEY        PIC  X(006).                              ｻｼｽﾞNO
000110     02  THM-ATD.                                                 ﾀﾝｶ
000120       03  THM-TD     OCCURS   6.
000130         04  THM-T      PIC S9(005).
000140     02  THM-SOR        PIC S9(005).                              ｿｳﾘｮｳ
000150     02  THM-SHZ        PIC S9(005).                              ｼｮｳﾋｾﾞｲ
000160     02  F              PIC  X(018).
