000010**************************************
000020*****     入出庫累積ファイル     *****
000030**************************************
000040 FD  JNSR
000050     BLOCK    3     RECORDS
000060     LABEL    RECORD   STANDARD
000070     VALUE     OF  IDENTIFICATION  "JNSR-RDB".
000080 01  JNSR-R.
000090     02  JNSR-KEY1.                                               KEY1
000100       03  JNSR-01              PIC  9(06)  COMP-3.               品名ｺｰﾄﾞ
000110       03  JNSR-02              PIC  9(08)  COMP-3.               I.980515
000120       03  JNSR-03              PIC  9(02).                       入出力区
000130       03  JNSR-04              PIC  9(06)  COMP-3.               伝票№
000140       03  JNSR-05              PIC  9(01).                       行
000150     02  JNSR-06                PIC  9(01).                       倉ｺｰﾄﾞ
000160     02  JNSR-07                PIC  9(01).                       サイズ
000170     02  JNSR-08.                                                 入出庫数
000180       03  JNSR-081             PIC S9(04)  COMP-3    OCCURS  10.
000190     02  JNSR-09                PIC  9(01).                       生産区分
000200     02  JNSR-10                PIC  9(01).                       出荷伝区
000210     02  JNSR-11.
000220       03  JNSR-111             PIC  9(04).                       得意先C
000230       03  JNSR-112             PIC  9(03).                       直送NO
000240     02  JNSR-12                PIC  9(06)  COMP-3.               送り状№
000250     02  JNSR-13                PIC  9(01).                       預り区分
000260     02  JNSR-14                PIC  9(01).                       運送C
000270     02  JNSR-KEY2.
000280       03  JNSR-15.                                               受注
000290         04  JNSR-151           PIC  9(06)  COMP-3.               　受注№
000300         04  JNSR-152           PIC  9(01).                       　行№
000310       03  JNSR-16              PIC  9(08)  COMP-3.               I.980515
000320       03  JNSR-17              PIC  9(01).                       ﾚｺｰﾄﾞKBN
000330       03  JNSR-18.                                               伝票
000340         04  JNSR-181           PIC  9(06)  COMP-3.               　伝票№
000350         04  JNSR-182           PIC  9(01).                       　行№
000360     02  JNSR-KEY3.
000370       03  JNSR-19              PIC  9(04).                       得意先C
000380       03  JNSR-20              PIC  9(08)  COMP-3.               I.980515
000390       03  JNSR-21              PIC  9(01).                       レコー区
000400       03  JNSR-22.                                               伝票№
000410         04  JNSR-221           PIC  9(06)  COMP-3.               出荷指№
000420         04  JNSR-222           PIC  9(01).                       　行№
000430     02  JNSR-23                PIC  N(09).                       配達
000440     02  JNSR-24                PIC  N(23).                       摘要
000450     02  FILLER                 PIC  X(08).                       I.980515
000460     02  JNSR-90                PIC  9(01).                       入力部署
000470     02  JNSR-91                PIC  9(01).                       繰越区分
000480     02  JNSR-92                PIC  9(02).                       処理月
