000010*********************************************
000020*****                                   *****
000030*****       中国出荷指図ファイル　      *****
000040*****                       256/1       *****
000050*********************************************
000060 FD  HN-CSZN
000070     BLOCK 1 RECORDS
000080     LABEL RECORD IS STANDARD
000090     VALUE OF IDENTIFICATION "HN-CSZN".
000100 01  CSZN-R.
000110     02  CSZN-KEY.
000120       03  CSZN-01.                                               指図
000130         04  CSZN-011   PIC 9(06).                                　指図№
000140         04  CSZN-012   PIC 9(01).                                　行№
000150     02  CSZN-02        PIC 9(06).                                指図日
000160     02  CSZN-02R  REDEFINES  CSZN-02.
000170       03  CSZN-021     PIC 9(02).                                　年
000180       03  CSZN-022     PIC 9(02).                                　月　
000190       03  CSZN-023     PIC 9(02).                                　日　
000200     02  CSZN-03        PIC 9(06).                                入荷予日
000210     02  CSZN-03R  REDEFINES  CSZN-03.
000220       03  CSZN-031     PIC 9(02).                                　年
000230       03  CSZN-032     PIC 9(02).                                　月　
000240       03  CSZN-033     PIC 9(02).                                　日　
000250     02  CSZN-04        PIC 9(06).                                品名ＣＤ
000260     02  CSZN-05        PIC 9(01).                                ｻｲｽﾞ区分
000270     02  CSZN-06.
000280       03  CSZN-061     PIC S9(06)     OCCURS 10.                 指図数
000290     02  CSZN-07.
000300       03  CSZN-071     PIC S9(06)     OCCURS 10.                 入荷累計
000310     02  CSZN-08        PIC N(32).                                摘要　　
000320     02  CSZN-09        PIC 9(01).                                教／一区
000330     02  F              PIC X(45).
