000010*********************************************
000020*****                                   *****
000030*****     ワークファイル　（０３）　    *****
000040*****                       256/1       *****
000050*********************************************
000060 FD  HN-WK03
000070     BLOCK 1 RECORDS
000080     LABEL RECORD IS STANDARD
000090     VALUE OF IDENTIFICATION JT-OWS256ID.
000100 01  WK03-R.
000110     02  WK03-KEY.
000120       03  WK03-01.                                               受入
000130         04  WK03-011   PIC 9(06).                                　受入№
000140         04  WK03-012   PIC 9.                                    　行№
000150     02  WK03-02.                                                 指図
000160       03  WK03-021   PIC 9(06).                                  　指図№
000170       03  WK03-022   PIC 9(01).                                  　行№
000180     02  WK03-03.                                                 受入日
000190       03  WK03-031   PIC 9(02).                                    年
000200       03  WK03-032   PIC 9(02).                                    月
000210       03  WK03-033   PIC 9(02).                                    日
000220     02  WK03-04      PIC 9.                                      倉庫ｺｰﾄﾞ
000230     02  WK03-05      PIC 9.                                      生産区分
000240     02  WK03-06      PIC 9(06).                                  品名ｺｰﾄﾞ
000250     02  WK03-07      PIC 9.                                      ｻｲｽﾞ区分
000260     02  WK03-08.                                                 入荷数　
000270       03  WK03-081   OCCURS 10   PIC S9(06).
000280     02  WK03-09      PIC N(32).                                  摘要　　
000290     02  WK03-10      PIC 9(01).                                  入力区分
000300     02  WK03-11      PIC 9(01).                                  教／一区
000310     02  WK03-12      PIC 9(07).
000320     02  WK03-12R REDEFINES WK03-12.
000330         03 WK03-121  PIC 9(06).
000340         03 WK03-122  PIC 9(01).
000350     02  F            PIC X(78).
000360     02  WK03-98Z.                                                振替先
000370       03  WK03-981Z  PIC 9(06).                                  №
000380       03  WK03-982Z  PIC 9.                                      倉庫ｺｰﾄﾞ
000390       03  WK03-983Z  PIC 9.                                      生産区分
000400       03  WK03-984Z  PIC 9(06).                                  品名ｺｰﾄﾞ
000410       03  WK03-985Z  PIC 9.                                      ｻｲｽﾞ区分
000420     02  WK03-99Z     PIC 9.                                      処理　　
