000010*********************************************
000020*****                                   *****
000030*****       預かり計上ファイル　　　    *****
000040*****                      102/05       *****
000050*********************************************
000060 FD  JT-AKEF
000070     BLOCK 05 RECORDS
000080     LABEL RECORD IS STANDARD
000090     VALUE OF IDENTIFICATION "JT-AKEF".
000100 01  AKEF-R.
000110     02  AKEF-KEY.
000120       03  AKEF-01          PIC 9(06).                            受注№
000130       03  AKEF-02          PIC 9(01).                            行№
000140     02  AKEF-03            PIC 9(06).                            日付
000150     02  AKEF-03R  REDEFINES    AKEF-03.
000160       03  AKEF-031         PIC 9(02).                            年
000170       03  AKEF-032         PIC 9(02).                            月
000180       03  AKEF-033         PIC 9(02).                            日
000190     02  AKEF-04.                                                 直送先CD
000200       03  AKEF-041         PIC 9(04).                            得意先CD
000210       03  AKEF-042         PIC 9(03).                            直送先CD
000220     02  AKEF-05            PIC 9(06).                            品名CD
000230     02  AKEF-06            PIC 9(01).                            ｻｲｽﾞ区分
000240     02  AKEF-07.                                                 売上数
000250       03  AKEF-071  OCCURS 10  PIC S9(06)   COMP-3.
000260     02  AKEF-08            PIC S9(06)       COMP-3.
000270*****02  AKEF-09            PIC  9(04).                           D.941226
000280     02  F                  PIC  X(04).                           I.941226
000290     02  AKEF-10            PIC S9(08)       COMP-3.              金額
000300     02  AKEF-11            PIC  9(01).                           調整区分
000310     02  AKEF-12            PIC  9(01).                           伝票区分
000320     02  AKEF-13            PIC  9(01).                           倉庫ｺｰﾄﾞ
000330     02  AKEF-14            PIC  9(01).                           消費税KB
000340*****02  F                  PIC  X(18).                           D.941226
000350     02  AKEF-09            PIC  9(05).                           I.941226
000360     02  F                  PIC  X(13).                           I.941226
