000010***********************************************
000020*****                                     *****
000030*****     得意先品名別単価マスター        *****
000040*****          (JT-THTN)  16/16           *****
000050***********************************************
000060 FD  JT-THTN
000070     BLOCK 16 RECORDS
000080     LABEL RECORD IS STANDARD
000090     VALUE OF IDENTIFICATION "JT-THTN".
000100 01  THTN-R.
000110     02  THTN-KEY.                                                ＫＥＹ
000120       03  THTN-01    PIC 9(4).                                   得意先CD
000130       03  THTN-02    PIC 9(6).                                   品名ｺｰﾄﾞ
000140       03  THTN-02R   REDEFINES  THTN-02.                         I.000117
000150         04  THTN-021 PIC 9(4).                                   I.000117
000160         04  THTN-022 PIC 9(2).                                   I.000117
000170       03  THTN-03    PIC 9(1).                                   ｻｲｽﾞ区分
000180     02  THTN-04      PIC 9(5).                                   I.941226
000190*****02  THTN-04      PIC 9(4).                                   D.941226
000200*****02  FILLER       PIC X(1).                                   D.941226
