000010 FD  JT-KW01
000020     BLOCK 12 RECORDS
000030     LABEL RECORD IS STANDARD
000040     VALUE OF IDENTIFICATION  JT-OWI21ID.
000050 01  KW01-R.
000060     02  KW01-KEY.
000070       03  KW01-01          PIC 9(04).                            ìæà”êÊCD
000080       03  KW01-02          PIC 9(06).                            éÛíçáÇ
000090     02  FILLER             PIC X(11).
