000010 FD  BS  LABEL   RECORD  STANDARD
000020         BLOCK   3   RECORDS
000030         VALUE   OF  IDENTIFICATION  IS  "BS-K".
000040 01  BS-REC.
000050     02  BS-KEY          PIC X(3).
000060     02  BS-LIN          PIC 9.
000070     02  BS-DR.
000080       03  BS-GKBDR      PIC 9.
000090       03  BS-PKBDR      PIC 9.
000100       03  BS-NAMDR      PIC X(20).
000110       03  BS-NAMDRR     REDEFINES    BS-NAMDR.
000120         04  BS-NAMDR1   PIC N(10).
000130       03  BS-KINDR      PIC S9(11).
000140     02  BS-CR.
000150       03  BS-GKBCR      PIC 9.
000160       03  BS-PKBCR      PIC 9.
000170       03  BS-NAMCR      PIC X(20).
000180       03  BS-NAMCRR     REDEFINES    BS-NAMCR.
000190         04  BS-NAMCR1   PIC N(10).
000200       03  BS-KINCR      PIC S9(11).
000210     02  BS-RKB          PIC 9.
000220     02  FILLER          PIC X(14).
