000010 ENVIRONMENT         DIVISION.
000020 CONFIGURATION       SECTION.
000030 SOURCE-COMPUTER.    NEAC-SYSTEM100.
000040 OBJECT-COMPUTER.    NEAC-SYSTEM100
000050                     WITH    SUPERVISOR  CONTROL.
000060 INPUT-OUTPUT        SECTION.
000070 FILE-CONTROL.
000080 END
