SCREEN GR0200                                                              00010
MOD    K25                                                                 00020
*                                                                          00030
AREA (01,24)_                                                              00040
REV  (01,26)(,55)_                                                         00050
UND  (05,05)(,39)_                                                         00060
UND  (05,43)(,77)_                                                         00070
BOX  (08,12)(15,29)_                                                       00080
BOX  (08,40)(21,52)_                                                       00090
BOX  (08,63)(21,75)_                                                       00100
OVE  (10,12)(,29)_                                                         00110
OVE  (10,40)(,52)_                                                         00120
OVE  (10,63)(,75)_                                                         00130
VER  (08,19)(15)_                                                          00140
VER  (08,24)(15)_                                                          00150
VER  (08,47)(21)_                                                          00160
VER  (08,70)(21)_                                                          00170
*                                                                          00180
CON  (01,27)  NC"â»ñ⁄É}ÉXÉ^"_                                              00190
CON  (01,37)  NC"ÅiÇQÅj"_                                                  00200
CON  (01,43)  NC"ÉÅÉìÉeÉiÉìÉX"_                                            00210
CON  (05,06)  NC"â»ñ⁄ÉRÅ[Éh"_                                              00220
CON  (05,44)  NC"â»ñ⁄ñº"_                                                  00230
CON  (07,13)  NC"ë›éÿ"_                                                    00240
CON  (07,17)  NC"çXêVÉRÅ[Éh"_                                              00250
CON  (07,41)  NC"ëπâv"_                                                    00260
CON  (07,45)  NC"çXêVÉRÅ[Éh"_                                              00270
CON  (07,64)  NC"å¥âø"_                                                    00280
CON  (07,68)  NC"çXêVÉRÅ[Éh"_                                              00290
CON  (08,13)  NC"ë›Å@éÿ"_                                                  00300
CON  (08,20)  NC"ë›éÿ"_                                                    00310
CON  (08,25)  NC"åvéZ"_                                                    00320
CON  (08,41)  NC"ëπÅ@âv"_                                                  00330
CON  (08,48)  NC"åvéZ"_                                                    00340
CON  (08,64)  NC"å¥Å@âø"_                                                  00350
CON  (08,71)  NC"åvéZ"_                                                    00360
CON  (09,13)  NC"ÉRÅ[Éh"_                                                  00370
CON  (09,20)  NC"ãÊï™"_                                                    00380
CON  (09,25)  NC"ãÊï™"_                                                    00390
CON  (09,41)  NC"ÉRÅ[Éh"_                                                  00400
CON  (09,48)  NC"ãÊï™"_                                                    00410
CON  (09,64)  NC"ÉRÅ[Éh"_                                                  00420
CON  (09,71)  NC"ãÊï™"_                                                    00430
CON  (10,06)  NC"çáåvá@"_                                                  00440
CON  (10,34)  NC"çáåvá@"_                                                  00450
CON  (10,57)  NC"çáåvá@"_                                                  00460
CON  (11,10)  NC"áA"_                                                      00470
CON  (11,38)  NC"áA"_                                                      00480
CON  (11,61)  NC"áA"_                                                      00490
CON  (12,10)  NC"áB"_                                                      00500
CON  (12,38)  NC"áB"_                                                      00510
CON  (12,61)  NC"áB"_                                                      00520
CON  (13,10)  NC"áC"_                                                      00530
CON  (13,38)  NC"áC"_                                                      00540
CON  (13,61)  NC"áC"_                                                      00550
CON  (14,10)  NC"áD"_                                                      00560
CON  (14,38)  NC"áD"_                                                      00570
CON  (14,61)  NC"áD"_                                                      00580
CON  (15,10)  NC"áE"_                                                      00590
CON  (15,38)  NC"áE"_                                                      00600
CON  (15,61)  NC"áE"_                                                      00610
CON  (16,38)  NC"áF"_                                                      00620
CON  (16,61)  NC"áF"_                                                      00630
CON  (17,38)  NC"áG"_                                                      00640
CON  (17,61)  NC"áG"_                                                      00650
CON  (18,38)  NC"áH"_                                                      00660
CON  (18,61)  NC"áH"_                                                      00670
CON  (19,38)  NC"áI"_                                                      00680
CON  (19,61)  NC"áI"_                                                      00690
CON  (20,38)  NC"áJ"_                                                      00700
CON  (20,61)  NC"áJ"_                                                      00710
CON  (21,38)  NC"áK"_                                                      00720
CON  (21,61)  NC"áK"_                                                      00730
CON  (24,61)  NC"ämîF"_                                                    00740
CON  (24,66)    "OK=1,NO=9 ( )"_                                           00750
END_                                                                       00760
