SCREEN    GR0300                                                           00010
MOD       K25                                                              00020
ARE       (1,24)_                                                          00030
**                                                                         00040
REV  (01,29)(01,53)_                                                       00050
UND  (03,12)(03,70)_   UND (05,05)(05,39)_   UND (06,05)(06,39)_           00060
UND  (07,05)(07,39)_   UND (07,43)(07,77)_   UND (08,05)(08,39)_           00070
UND  (08,43)(08,77)_   UND (09,05)(09,39)_   UND (09,43)(09,77)_           00080
UND  (10,43)(10,77)_                                                       00090
CON  (01,30)  NC"貸借マスタメンテナンス"_                                  00100
CON  (03,13)  NC"処理区分"_       CON  (03,23)  NC"登録＝１，"_            00110
CON  (03,33)  NC"修正＝２，"_     CON  (03,43)  NC"削除＝３，"_            00120
CON  (03,53)  NC"終了＝ＰＦ９"_   CON  (03,66)  "( )"_                     00130
CON  (05,06)  NC"ライン№"_       CON  (06,06)  NC"改行数"_                00140
CON  (07,06)  NC"借方合計区分"_   CON  (07,44)  NC"貸方合計区分"_          00150
CON  (08,06)  NC"借方印字区分"_   CON  (08,44)  NC"貸方印字区分"_          00160
CON  (09,06)  NC"借方科目名"_     CON  (09,44)  NC"貸方科目名"_            00170
CON  (10,44)  NC"当期末処分利益区分"_                                      00180
CON  (24,61)  NC"確認"_                                                    00190
CON  (24,66)  "OK=1,NO=9 ( )"_                                             00200
END_                                                                       00210
