SCREEN    GR0350                                                           00010
MOD       K25                                                              00020
ARE       (1,24)_                                                          00030
**                                                                         00040
REV  (01,29)(,52)_                                                         00050
UND  (03,12)(,70)_        UND  (05,05)(,39)_       UND  (06,05)(,39)_      00060
UND  (07,05)(,39)_        UND  (08,05)(,39)_                               00070
UND  (07,43)(,77)_        UND  (08,43)(,77)_                               00080
CON  (01,30)  NC"損益マスタメンテナンス"_                                  00090
CON  (03,13)  NC"処理区分　登録＝１，修正＝２，削除＝３，終了＝ＰＦ９"_    00100
CON  (03,66)  "( )"_                                                       00110
CON  (05,06)  NC"ライン№"_          CON  (06,06)  NC"改行数"_             00120
CON  (07,06)  NC"合計区分"_          CON  (08,06)  NC"科目名"_             00130
CON  (07,44)  NC"売上区分"_          CON  (08,44)  NC"印字区分"_           00140
CON  (24,61)  NC"確認"_              CON  (24,66)  "OK=1,NO=9 ( )"_        00150
END_                                                                       00160
