SCREEN GRMENU                                                              00010
MOD    K25                                                                 00020
*                                                                          00030
AREA (01,24)_                                                              00040
BOX  (11,11)(,31)_                                                         00050
*                                                                          00060
*                                                                          00070
*                                                                          00080
CON  (02,09) NC"『財務管理システム』"_                                     00090
CON  (02,51) NC"前回月締年月"_     CON  (02,63)   ":"_                     00100
CON  (02,67) NC"年　月"_                                                   00110
*                                                                          00120
CON  (08,11) NC"何日の処理をしますか？"_                                   00130
*                                                                          00140
CON  (11,16) NC"年"_               CON  (11,22) NC"月"_                    00150
CON  (11,28) NC"日"_                                                       00160
*                                                                          00170
CON  (14,11) NC"月初日付"_         CON  (14,19)   ":"_                     00180
CON  (14,23) NC"年　月　日"_                                               00190
*                                                                          00200
CON  (16,11) NC"月末日付"_         CON  (16,19)   ":"_                     00210
CON  (16,23) NC"年　月　日"_                                               00220
*                                                                          00230
CON  (24,61) NC"確認"_                                                     00240
CON  (24,66)    "OK=1,NO=9 ( )"_                                           00250
END_                                                                       00260
