000010***  åªóaã‡É}ÉXÉ^     (64/4)
000020 FD  GYM
000030     BLOCK       CONTAINS    4       RECORDS
000040     LABEL       RECORD      STANDARD
000050     VALUE       OF          IDENTIFICATION    "GEYOKIN-M".
000060 01  GYM-R.
000070     02  GYM-KEY.
000080         03  GYM-01.
000090             04  GYM-011         PIC 9(04).                       â»ñ⁄ÇbÇc
000100             04  GYM-012         PIC 9(04).                       H 90.12
000110     02  GYM-03                  PIC S9(11).                      A 90.12
000120     02  GYM-04.                                                  ìñì˙î≠ê∂
000130         03  GYM-041             PIC S9(10).                      éÿï˚
000140         03  GYM-042             PIC S9(10).                      ë›ï˚
000150     02  FILLER                  PIC X(25).                       H 90.12
