000010***********************************************
000020*****                                     *****
000030*****      履物 得意先 統計 マスター      *****
000040*****         (  H T M  )  170/2          *****
000050***********************************************
000060 FD  HT-M
000070     BLOCK 3 RECORDS
000080     LABEL RECORD IS STANDARD
000090     VALUE OF IDENTIFICATION "HTM".
000100 01  HT-R.
000110     02  HT-KEY.                                                  ｺｰﾄﾞ
000120       03  HT-TCD     PIC 9(4).                                   得意先CD
000130*    * * *   統　計　項　目　 * * *
000140     02  HT-TD.
000150       03  HT-TZZ     PIC S9(9).                                  前月残高
000160       03  HT-TZZZ    PIC S9(7).                                  　消費税
000170       03  HT-TUZ     PIC S9(9).                                  売掛残高
000180       03  HT-TUZZ    PIC S9(7).                                  　消費税
000190       03  HT-TUA     PIC S9(9).                                  売上金額
000200       03  HT-TUAZ    PIC S9(7).                                  　消費税
000210       03  HT-TNB     PIC S9(8).                                  値引金額
000220       03  HT-TNBZ    PIC S9(6).                                  　消費税
000230       03  HT-TNK     PIC S9(9).                                  入金金額
000240       03  HT-TNKZ    PIC S9(7).                                  　消費税
000250       03  HT-TUG     PIC S9(9).                                  売上原価
000260*    * * *   請　求　項　目　 * * *
000270     02  HT-SD.
000280       03  HT-SZZ     PIC S9(9).                                  前回請求
000290       03  HT-SZZZ    PIC S9(7).                                  　消費税
000300       03  HT-SUA     PIC S9(9).                                  売上金額
000310       03  HT-SUAZ    PIC S9(7).                                  　消費税
000320       03  HT-STS     PIC S9(7).                                  調整金額
000330       03  HT-STSZ    PIC S9(5).                                  　消費税
000340       03  HT-SNK     PIC S9(9).                                  入金金額
000350       03  HT-SNKZ    PIC S9(7).                                  　消費税
000360*    * * *   区分　コード　 * * *
000370     02  HT-TKC       PIC 9(02).                                  地区
000380     02  HT-TNC       PIC 9(02).                                  担当者
000390     02  HT-FKC       PIC 9(2).                                   都道府県
000400     02  HT-BC        PIC 9.                                      部門ｺｰﾄﾞ
000410     02  F            PIC X(12).
