000010***********************************************
000020*****                                     *****
000030*****      工品他 得意先 統計 マスター    *****
000040*****         (  K T M  )  170/2          *****
000050***********************************************
000060 FD  KT-M
000070     BLOCK 3 RECORDS
000080     LABEL RECORD IS STANDARD
000090     VALUE OF IDENTIFICATION "KTM".
000100 01  KT-R.
000110     02  KT-KEY.                                                  ｺｰﾄﾞ
000120       03  KT-TCD     PIC 9(4).                                   得意先CD
000130*    * * *   統　計　項　目　 * * *
000140     02  KT-TD.
000150       03  KT-TZZ     PIC S9(9).                                  前月残高
000160       03  KT-TZZZ    PIC S9(7).                                  　消費税
000170       03  KT-TUZ     PIC S9(9).                                  売掛残高
000180       03  KT-TUZZ    PIC S9(7).                                  　消費税
000190       03  KT-TUA     PIC S9(9).                                  売上金額
000200       03  KT-TUAZ    PIC S9(7).                                  　消費税
000210       03  KT-TNB     PIC S9(8).                                  値引金額
000220       03  KT-TNBZ    PIC S9(6).                                  　消費税
000230       03  KT-TNK     PIC S9(9).                                  入金金額
000240       03  KT-TNKZ    PIC S9(7).                                  　消費税
000250       03  KT-TUG     PIC S9(9).                                  売上原価
000260*    * * *   請　求　項　目　 * * *
000270     02  KT-SD.
000280       03  KT-SZZ     PIC S9(9).                                  前回請求
000290       03  KT-SZZZ    PIC S9(7).                                  　消費税
000300       03  KT-SUA     PIC S9(9).                                  売上金額
000310       03  KT-SUAZ    PIC S9(7).                                  　消費税
000320       03  KT-STS     PIC S9(7).                                  調整金額
000330       03  KT-STSZ    PIC S9(5).                                  　消費税
000340       03  KT-SNK     PIC S9(9).                                  入金金額
000350       03  KT-SNKZ    PIC S9(7).                                  　消費税
000360*    * * *   区分　コード　 * * *
000370     02  KT-TKC       PIC 9(02).                                  地区
000380     02  KT-TNC       PIC 9(02).                                  担当者
000390     02  KT-FKC       PIC 9(2).                                   都道府県
000400     02  KT-BC        PIC 9.                                      部門ｺｰﾄﾞ
000410     02  F            PIC X(12).
