000010********************************************
000020*****    édÅ@ì¸Å@êÊÅ@É}Å@ÉXÅ@É^Å@Å[    *****
000030*****         (  S M  )  256/1         *****
000040********************************************
000050 FD  S-M
000060     BLOCK  1 RECORDS
000070     LABEL RECORD IS STANDARD
000080     VALUE OF IDENTIFICATION "SM".
000090 01  S-R.
000100     02  S-KEY.                                                   ÇjÇdÇx
000110       03  S-TCD        PIC  9(004).                              édì¸êÊCD
000120       03  S-TCDD  REDEFINES S-TCD.
000130         04  S-TCD1     PIC  9(001).
000140         04  S-TCD2     PIC  9(003).
000150     02  S-NAME         PIC  N(024).                              édì¸êÊñº
000160     02  S-JSU          PIC  N(024).                              èZèä(è„)
000170     02  S-JSS          PIC  N(012).                              èZèä(â∫)
000180*****02  S-UNO          PIC  X(006).                              D.960517
000190*****02  F              PIC  X(006).                              D.970127
000200*****02  S-TEL          PIC  X(012).                              D.970127
000210*****02  S-FAX          PIC  X(012).                              D.970127
000220     02  S-UNO          PIC  X(008).                              I.970127
000230     02  S-TEL          PIC  X(014).                              I.970127
000240     02  S-FAX          PIC  X(014).                              I.970127
000250     02  S-FKC          PIC  9(002).                              ï{åß∫∞ƒﬁ
000260     02  S-SZC          PIC  9(001).                              è¡îÔê≈C
000270     02  S-TTS          PIC  9(002).                              éxéËª≤ƒ
000280     02  S-THN          PIC  9(002).                              éxéË ì˙
000290     02  S-TMC          PIC  9(001).                              éxéËï°êî
000300     02  S-SKR          PIC  9(001).                              ëóã‡óøC
000310     02  S-PC           PIC  9(002).                              I.971105
000320     02  S-BKC          PIC  9(002).                              I.990603
000330*****02  F              PIC  X(102).                              D.950524
000340*****02  F              PIC  X(090).                              D.960517
000350*****02  S-UNO          PIC  X(008).                              D.970127
000360*****02  F              PIC  X(082).                              D.980217
000370*****02  F              PIC  X(084).                              D.971105
000380*****02  F              PIC  X(078).                              D.990603
000390     02  F              PIC  X(076).                              I.990603
000400     02  S-ENG          PIC  9(004).                              I.980217
000410     02  S-KKC          PIC  9(001).                              îÉä|ãÊï™
000420     02  S-SFC          PIC  9(001).                              êUçûãÊï™
000430     02  S-TGC          PIC  9(001).                              éËå`ãÊï™
