000010***********************************************
000020*****　　直　送　先　マ　ス　タ　ー       *****
000030*****         (  T C M  )  192/4          *****
000040***********************************************
000050 FD  TC-M
000060*****BLOCK  3 RECORDS                                             D.020305
000070     BLOCK  4 RECORDS                                             I.020305
000080     LABEL RECORD IS STANDARD
000090     VALUE OF IDENTIFICATION "TCM".
000100 01  TC-R.
000110     02  TC-KEY.                                                  ｺｰﾄﾞ
000120       03  TC-TCD       PIC  9(004).                              得意先CD
000130       03  TC-CCD       PIC  9(003).                              直送先CD
000140     02  TC-NAME        PIC  N(026).                              I.020306
000150     02  TC-JSU         PIC  N(020).                              I.020306
000160     02  TC-JSS         PIC  N(020).                              I.020306
000170*****02  TC-NAME        PIC  N(024).                              D.020306
000180*****02  TC-JSU         PIC  N(024).                              D.020306
000190*****02  TC-JSS         PIC  N(012).                              D.020306
000200*****02  TC-UNO         PIC  X(006).                              D.970122
000210*****02  TC-TEL         PIC  X(012).                              D.970122
000220     02  TC-UNO         PIC  X(008).                              I.970122
000230     02  TC-TEL         PIC  X(014).                              I.970122
000240     02  TC-FKC         PIC  9(002).                              府県ｺｰﾄﾞ
000250     02  TC-UCD         PIC  9(001).                              運送ｺｰﾄﾞ
000260     02  TC-STK         PIC  9(001).                              A 910821
000270     02  TC-BIK         PIC  9(001).                              I.981008
000280*****02  TC-DNO         PIC  9(003).                              D.010220
000290*****02  F              PIC  X(003).                              D.020308
000300     02  TC-DHC         PIC  9(001).                              I.000630
000310     02  F              PIC  X(019).                              I.020306
000320*****02  F              PIC  X(006).                              D.020306
000330*****02  F              PIC  X(007).                              D.000630
000340*****02  F              PIC  X(010).                              D.000124
000350*****02  F              PIC  X(015).                              D.970122
000360*****02  F              PIC  X(011).                              D.981008
000370     02  TC-DATE        PIC  9(006).                              I.940610
000380     02  TC-YMD   REDEFINES TC-DATE.                              年月日
000390         03  TC-YY      PIC  9(002).                                年
000400         03  TC-MM      PIC  9(002).                                月
000410         03  TC-DD      PIC  9(002).                                日
000420*****02  F              PIC  X(022).                              D.020306
