000010***********************************************
000020*****     得　意　先   マ　ス　タ　ー     *****
000030*****     ( TM1 , TM2 , TMD )  512/1      *****
000040***********************************************
000050 FD  T-M
000060     BLOCK  1 RECORDS
000070     LABEL RECORD IS STANDARD
000080     VALUE OF IDENTIFICATION "TM2".                               I.000217
000090 01  T-R.
000100     02  T-KEY2.                                                  I.000217
000110       03  T-NTCD       PIC  9(004).                              I.000217
000120       03  T-KEY.                                                 I.000217
000130         04  T-TCD      PIC  9(004).                              I.000217
000140     02  T-NAME         PIC  N(026).                              I.020319
000150     02  T-JSU          PIC  N(020).                              I.020319
000160     02  T-JSS          PIC  N(020).                              I.020319
000170*****02  T-NAME         PIC  N(024).                              D.020319
000180*****02  T-JSU          PIC  N(024).                              D.020319
000190*****02  T-JSS          PIC  N(012).                              D.020319
000200     02  T-UNO          PIC  X(008).                              I.970122
000210     02  T-TEL          PIC  X(014).                              I.970122
000220     02  T-FAX          PIC  X(014).                              I.970122
000230     02  T-FKC          PIC  9(002).                              都道府県
000240     02  T-BC           PIC  9(001).                              部門ｺｰﾄﾞ
000250     02  T-TKC          PIC  9(002).                              地区ｺｰﾄﾞ
000260     02  T-TNC          PIC  9(002).                              担当者
000270*****02  T-KL           PIC  9(001).                              D.020319
000280     02  T-SS           PIC  9(002).                              請求締日
000290*****02  T-PC           PIC  9(002).                              D.020319
000300     02  T-NKY          PIC  9(003).                              入金ｻｲﾄ
000310     02  T-DCC          PIC  9(001).                              I.020319
000320*****02  T-DNO          PIC  9(003).                              D.020319
000330     02  T-TGC          PIC  9(001).                              手形区分
000340     02  T-YG           PIC  9(006).                              与信限度
000350     02  T-BIK          PIC  9(001).                              I.981007
000360     02  F              PIC  X(010).                              I.000217
000370     02  T-TNA          PIC  N(016).                              得意先名
000380*****02  T-SNA          PIC  N(024).                              D.020319
000390*****02  T-SJSU         PIC  N(024).                              D.020319
000400*****02  T-SJSS         PIC  N(012).                              D.020319
000410     02  T-SNA          PIC  N(026).                              I.020319
000420     02  T-SJSU         PIC  N(020).                              I.020319
000430     02  T-SJSS         PIC  N(020).                              I.020319
000440     02  T-SUNO         PIC  X(008).                              I.970122
000450     02  T-STEL         PIC  X(014).                              I.970122
000460     02  T-SFAX         PIC  X(014).                              I.970122
000470*    取引条件
000480     02  T-SHD          PIC  9(002).                              I.990915
000490     02  T-SSI          PIC  9(003).                              I.990915
000500     02  T-SHC1         PIC  9(001).                              I.990915
000510     02  T-SHC2         PIC  9(001).                              I.990915
000520     02  T-SGT          PIC  9(001).                              I.990915
000530     02  T-SGR          PIC  9(001)V9(01).                        I.990915
000540     02  T-STT          PIC  9(001).                              I.990915
000550     02  T-STR          PIC  9(001)V9(01).                        I.990915
000560     02  T-SKR          PIC  9(004).                              I.990915
000570*
000580*****02  F              PIC  X(057).                              D.020319
000590     02  F              PIC  X(038).                              I.020319
000600     02  T-KANA         PIC  X(036).                              I.000217
000610     02  T-DNG          PIC  9(006).                              I.000211
000620     02  T-SNG          PIC  9(004).                              開始年月
000630     02  T-ENG          PIC  9(004).                              停止年月
