000010*****************************************************************
000020*    “`•[‡‚ƒtƒ@ƒCƒ‹          ( 256/1 )  INDEXED                 *
000030*****************************************************************
000040 FD  NS-DNO
000050     BLOCK       CONTAINS    1       RECORDS
000060     LABEL       RECORD      STANDARD
000070     VALUE       OF          IDENTIFICATION    "NS-DNO".
000080 01  DNO1-R.
000090     02  DNO1-KEY.
000100       03  DNO1-01            PIC X(02).
000110     02  DNO1-02.
000120       03  DNO1-021           PIC 9(06).
000130       03  DNO1-022           PIC 9(06).
000140       03  DNO1-023           PIC 9(06).
000150     02  FILLER              PIC X(236).
000160*
000170 01  DNO2-R.
000180     02  DNO2-KEY.
000190       03  DNO2-01            PIC X(02).
000200     02  DNO2-02.
000210       03  DNO2-021     OCCURS 10.
000220         04  DNO2-0211        PIC 9(04).
000230         04  DNO2-0212        PIC 9(04).
000240     02  DNO2-03.
000250       03  DNO2-031         PIC 9(04).
000260       03  DNO2-032         PIC 9(04).
000270     02  DNO2-04.
000280       03  DNO2-041.
000290         04  DNO2-0411     OCCURS 2.
000300           05  DNO2-04111   PIC 9(04).
000310           05  DNO2-04112   PIC 9(04).
000320       03  DNO2-042.
000330         04  DNO2-0421     OCCURS 2.
000340           05  DNO2-04211   PIC 9(04).
000350           05  DNO2-04212   PIC 9(04).
000360     02  DNO2-05.
000370       03  DNO2-051     OCCURS 3.
000380         04  DNO2-0511     OCCURS 2.
000390           05  DNO2-05111   PIC 9(04).
000400           05  DNO2-05112   PIC 9(04).
000410     02  DNO2-06.
000420       03  DNO2-061     OCCURS 3.
000430         04  DNO2-0611      PIC 9(03).
000440         04  DNO2-0612      PIC 9(03).
000450     02  DNO2-07.
000460       03  DNO2-071.
000470         04  DNO2-0711      PIC 9(03)     OCCURS 2.
000480       03  DNO2-072.
000490         04  DNO2-0721      PIC 9(03)     OCCURS 2.
000500     02  FILLER            PIC X(56).
