000010*****************************************************************
000020*    ì¸èoã‡ê⁄ë±ÉèÅ[ÉN          ( 128/2 )  INDEXED               *
000030*****************************************************************
000040 FD  NS-NSW
000050     BLOCK       CONTAINS    2       RECORDS
000060     LABEL       RECORD      STANDARD
000070     VALUE       OF          IDENTIFICATION    "NS-NSW".
000080 01  NSW-R.
000090     02  NSW-01              PIC 9(06).
000100     02  NSW-02              PIC 9(02).
000110     02  NSW-03              PIC X(01).
000120     02  NSW-04              PIC 9(06).
000130     02  NSW-04R REDEFINES  NSW-04.
000140         03  NSW-041         PIC 9(02).
000150         03  NSW-042         PIC 9(02).
000160         03  NSW-043         PIC 9(02).
000170     02  NSW-05              PIC 9(04).
000180     02  NSW-06              PIC 9(02).
000190     02  NSW-07              PIC 9(04).
000200     02  NSW-08              PIC S9(10).
000210     02  NSW-09              PIC 9(06).
000220     02  NSW-09R  REDEFINES  NSW-09.
000230         03  NSW-091         PIC 9(02).
000240         03  NSW-092         PIC 9(02).
000250         03  NSW-093         PIC 9(02).
000260     02  NSW-10              PIC 9(04).
000270     02  NSW-11              PIC N(24).
000280     02  NSW-12              PIC 9(01).
000290     02  FILLER              PIC X(33).
000300     02  NSW-99              PIC 9(01).
