000010*****************************************************************
000020*    仕訳接続ワーク　        ( 170/3 )  SEQUENTIAL              *
000030*****************************************************************
000040 FD  NS-SIW
000050     BLOCK       CONTAINS    3       RECORDS
000060     LABEL       RECORD      STANDARD
000070     VALUE       OF          IDENTIFICATION    "NS-SIW".
000080 01  SIW-R.
000090*****02  SIW-01          PIC 9(06).                               D.971111
000100     02  SIW-01          PIC 9(08).                               I.971111
000110     02  SIW-02          PIC 9(06).
000120     02  SIW-03          PIC 9(02).
000130     02  SIW-04.
000140       03  SIW-041.
000150         04  SIW-0411      PIC 9(04).
000160         04  SIW-0412      PIC 9(04).
000170       03  SIW-042         PIC 9(04).
000180       03  SIW-043         PIC 9(03).
000190       03  SIW-044         PIC X(01).
000200       03  SIW-045         PIC S9(10).
000210       03  SIW-046         PIC 9(02).
000220*****  03  SIW-047         PIC X(08).                             D.980227
000230     02  SIW-05.
000240       03  SIW-051.
000250         04  SIW-0511      PIC 9(04).
000260         04  SIW-0512      PIC 9(04).
000270       03  SIW-052         PIC 9(04).
000280       03  SIW-053         PIC 9(03).
000290       03  SIW-054         PIC X(01).
000300       03  SIW-055         PIC S9(10).
000310       03  SIW-056         PIC 9(02).
000320*****  03  SIW-057         PIC X(08).                             D.980227
000330     02  SIW-06            PIC 9(05).
000340     02  SIW-07            PIC 9(03).
000350     02  SIW-08            PIC N(20).
000360     02  SIW-09            PIC X(01).
000370*****02  FILLER            PIC X(21).                             D.970403
000380*****02  FILLER            PIC X(20).                             D.971111
000390*****02  FILLER            PIC X(14).                             D.980307
000400     02  SIW-10            PIC N(10).                             I.980307
000410     02  F                 PIC X(10).                             I.980307
000420     02  SIW-90            PIC 9(01).                             I.970403
000430     02  SIW-97.
000440*****  03  SIW-971         PIC 9(06).                             D.971111
000450       03  SIW-971         PIC 9(08).                             I.971111
000460       03  SIW-971R REDEFINES  SIW-971.
000470*****    04  SIW-9711      PIC 9(02).                             D.971111
000480         04  SIW-9711      PIC 9(04).                             I.971111
000490         04  SIW-9712      PIC 9(02).
000500         04  SIW-9713      PIC 9(02).
000510*****  03  SIW-972         PIC 9(06).                             D.971111
000520       03  SIW-972         PIC 9(08).                             I.971111
000530       03  SIW-972R REDEFINES  SIW-972.
000540*****    04  SIW-9721      PIC 9(02).                             D.971111
000550         04  SIW-9721      PIC 9(04).                             I.971111
000560         04  SIW-9722      PIC 9(02).
000570         04  SIW-9723      PIC 9(02).
000580     02  SIW-98            PIC 9(01).
000590     02  SIW-99            PIC X(01).
