000010*****************************************************************
000020*    éxï•èÓïÒÉtÉ@ÉCÉã        ( 128/2 )  INDEXED                 *
000030*****************************************************************
000040 FD  NS-SIH
000050     BLOCK       CONTAINS    2       RECORDS
000060     LABEL       RECORD      STANDARD
000070     VALUE       OF          IDENTIFICATION    "NS-SIH".
000080 01  SIH-R.
000090     02  SIH-KEY.
000100       03  SIH-01          PIC 9(06).
000110       03  SIH-02          PIC 9(02).
000120     02  SIH-03            PIC X(01).
000130     02  SIH-04            PIC 9(06).
000140     02  SIH-04R  REDEFINES  SIH-04.
000150       03  SIH-041         PIC 9(02).
000160       03  SIH-042         PIC 9(02).
000170       03  SIH-043         PIC 9(02).
000180     02  SIH-05            PIC 9(04).
000190     02  SIH-06            PIC 9(02).
000200     02  SIH-07            PIC 9(04).
000210     02  SIH-08            PIC S9(10).
000220     02  SIH-09            PIC 9(06).
000230     02  SIH-09R REDEFINES  SIH-09.
000240       03  SIH-091         PIC 9(02).
000250       03  SIH-092         PIC 9(02).
000260       03  SIH-093         PIC 9(02).
000270     02  SIH-10            PIC 9(04).
000280     02  SIH-11.
000290       03  SIH-111         PIC S9(08).
000300       03  SIH-112         PIC S9(08).
000310       03  SIH-113         PIC S9(08).
000320       03  SIH-114         PIC S9(08).
000330       03  SIH-115         PIC S9(08).
000340       03  SIH-116         PIC S9(08).
000350       03  SIH-117         PIC S9(08).
000360     02  SIH-12.
000370       03  SIH-121         PIC S9(07).
000380       03  SIH-122         PIC S9(07).
000390     02  FILLER            PIC X(13).
