000010*****************************************************************
000020*    ワークファイル          (  64/4 )  SEQUENTIAL              *
000030*****************************************************************
000040 FD  NS-W01
000050*****BLOCK       CONTAINS    2       RECORDS                      D.970530
000060     BLOCK       CONTAINS    4       RECORDS                      I.970530
000070     LABEL       RECORD      STANDARD
000080*****VALUE       OF          IDENTIFICATION    "TK128".           D.970530
000090     VALUE       OF          IDENTIFICATION    WK0064ID.          I.970530
000100 01  W01-R.
000110     02  W01-01            PIC 9(01).
000120*****02  W01-02            PIC 9(06).                             D.971201
000130     02  W01-02            PIC 9(08).                             I.971201
000140     02  W01-02R  REDEFINES  W01-02.
000150*****  03  W01-021         PIC 9(02).                             D.971201
000160       03  W01-021         PIC 9(04).                             I.971201
000170       03  W01-022         PIC 9(02).
000180       03  W01-023         PIC 9(02).
000190     02  W01-03            PIC 9(04).
000200     02  W01-04            PIC 9(04).
000210     02  W01-05            PIC 9(04).
000220     02  W01-06            PIC 9(02).
000230     02  W01-07            PIC 9(02).
000240     02  W01-08            PIC S9(10).
000250*****02  W01-09            PIC 9(06).                             D.971201
000260     02  W01-09            PIC 9(08).                             I.971201
000270     02  W01-09R  REDEFINES  W01-09.
000280*****  03  W01-091         PIC 9(02).                             D.971201
000290       03  W01-091         PIC 9(04).                             I.971201
000300       03  W01-092         PIC 9(02).
000310       03  W01-093         PIC 9(02).
000320     02  FILLER            PIC X(21).                             I.971201
000330*****02  FILLER            PIC X(25).                             D.971201
000340*****02  FILLER            PIC X(89).                             D.970530
