000010**********************************************************
000020*****                                                *****
000030*****     プリント　ファイル　(６６行／２０６列)     *****
000040*****                                                *****
000050**********************************************************
000060 FD  SP-F
000070     LABEL RECORD IS OMITTED
000080     LINAGE IS 66 LINES.
000090 01  SP-R           PIC X(206).
