000010****************************************
000020*****     ÇdÇmÇcÅ@ÇrÇsÇ`ÇsÇtÇr     *****
000030****************************************
000040 01  W-STAT.
000050     02  HTB            PIC  X(002) VALUE "01".                   ÿ¿∞›
000060     02  C1             PIC  X(002) VALUE "02".                   áT
000070     02  C2             PIC  X(002) VALUE "03".                   áU
000080     02  ADV            PIC  X(002) VALUE "04".                   ADVANCE
000090     02  FUK            PIC  X(002) VALUE "05".                   SHIFT+ÿ
000100     02  SKP            PIC  X(002) VALUE "06".                   SKIP
000110     02  BTB            PIC  X(002) VALUE "09".                   B SKIP
000120     02  PF9            PIC  X(002) VALUE "P9".                   PF9
000130     02  PF17           PIC  X(002) VALUE "FW".                   PF17
000140     02  PF18           PIC  X(002) VALUE "BW".                   PF18
000150     02  PF21           PIC  X(002) VALUE "UP".                   PF21
000160     02  PF22           PIC  X(002) VALUE "DW".                   PF22
000170     02  DW             PIC  X(002) VALUE "DW".                   PF22
