000010*    Ã·Ö³ Ï½À°        *
000020 FD  TKI
000030     BLOCK      CONTAINS     5      RECORDS
000040     LABEL      RECORD       STANDARD
000050     VALUE      OF           IDENTIFICATION      "TEKIYO-K".
000060 01  TKI-R.
000070     02  TKI-KEY.
000080         03  TKI-01      PIC 9(3).                                “E—v‚b‚c
000090     02  TKI-02          PIC N(20).                               “E—v–¼
000100     02  FILLER          PIC X(8).
