000010**************************************
000020*    月別経費集計ファイル　　        *
000030*      IS                            *
000040*      BKS-WK        (170/3)         *
000050**************************************
000060 FD  ZH-BKW
000070     LABEL   RECORD   STANDARD
000080     BLOCK   3        RECORDS
000090     VALUE   OF       IDENTIFICATION    "BKS-WK".
000100*
000110 01  BKW-R.
000120     02  BKW-KEY.
000130         03  BKW-01.                                              部門ｺｰﾄﾞ
000140             04  BKW-011     PIC  9(02).                          (1)
000150             04  BKW-012     PIC  9(02).                          (2)
000160         03  BKW-02          PIC  9(04).                          科目ｺｰﾄﾞ
000170         03  BKW-03          PIC  9(03).                          補助ｺｰﾄﾞ
000180     02  BKW-04.                                                  当期欄
000190         03  BKW-041         PIC S9(11)    OCCURS  12.            1～12月
000200     02  BKW-05              PIC  9(03).                          合計ｺｰﾄﾞ
000210     02  BKW-06              PIC  9(01).                          改行数
000220     02  FILLER              PIC  X(23).
000230*****          ライブラリー　エンド　        *****
