SCREEN  SCPR01                                                             00010
ARE (01,24)_                                                               00020
CON (01,15) NC"＊＊＊　　残高表マスタ　メンテナンス　　＊＊＊"_            00030
CON (03,23) "登録=1 削除=3 作表=4 終了=9   "_                              00040
BOX (06,19) (07,56)_  VER (06,30) (07)_                                    00050
BOX (09,19) (11,56)_  BOX (12,19) (14,56)_                                 00060
UND (09,19) (,56)_    UND (12,19) (,56)_                                   00070
VER (10,30) (11)_     VER (13,30) (14)_                                    00080
CON (06,20) NC"頁　区　分"_                                                00090
CON (07,20) NC"科目コード"_                                                00100
CON (09,20) NC"明　細　①"_                                                00110
CON (10,20) NC"科目コード"_                                                00120
CON (11,20) NC"補助コード"_                                                00130
CON (12,20) NC"明　細　②"_                                                00140
CON (13,20) NC"科目コード"_                                                00150
CON (14,20) NC"補助コード"_                                                00160
CON (20,27) "確認  OK=1 NO=9   ﾘﾀｰﾝ"_                                      00170
END_                                                                       00180
