000010***********************************************
000020**   　　受注ダミーファイル（化成用）　　　　**
000030*****         ( G D M M  )  16/16         *****
000040***********************************************
000050 FD  GDMM
000060     BLOCK 16 RECORDS
000070     LABEL RECORD IS STANDARD
000080     VALUE OF IDENTIFICATION "GDMM".
000090 01  GDMM-R.
000100     02  GDMM-KEY.                                                KEY
000110         03  GDMM-01  PIC 9(01).
000120     02  F            PIC X(15).
