000010 FD  JKSM                                                         ¶º³»·
000020     BLOCK    1     RECORDS                                       Ï½À°
000030     LABEL    RECORD   STANDARD
000040     VALUE    OF  IDENTIFICATION  "JKSM".
000050*
000060 01  JKSM-R.
000070     02   JKSM-KEY.                                               KEY
000080          03    JKSM-01         PIC 9(4).                         ¶º³»·º°Ä
000090     02   JKSM-02               PIC N(24).                        ¶º³»·Ò²
000100     02   FILLER                PIC X(204).
