000010***********************************************
000020*****                                     *****
000030**   Å@Å@ÇnÅ^ÇkëóêMÅ@ÉtÉ@ÉCÉãÇQ          Å@**
000040*****         ( JOLSF2  )  256/1          *****
000050***********************************************
000060 FD  JOLSF2
000070     BLOCK 1 RECORDS
000080     LABEL RECORD IS STANDARD
000090     VALUE OF  IDENTIFICATION "JOLSF2".
000100*
000110*----ÉRÉìÉgÉçÅ[ÉãÇeóp      ÅiãÊï™ÅÅÇOÇPÅj
000120 01  JOLSF21-REC.
000130     02  JOLSF21-01         PIC  9(02).                           ÇqÇbãÊï™
000140     02  JOLSF221-KEYW.
000150         03  JOLSF21-02     PIC  9(01).                           ID
000160         03  JOLSF21-03     PIC  9(01).                           â^&ëqCD
000170     02  JOLSF21-04         PIC  N(06).                           â^&ëqñº
000180     02  JOLSF21-05         PIC  X(18).                           FILLER
000190     02  F                  PIC  X(221).
000200     02  JOLSF21-99         PIC  9(01).                           ëóêMêÊ
000210*
000220*----íºëóêÊÉ}ÉXÉ^óp        ÅiãÊï™ÅÅÇOÇQÅj
000230 01  JOLSF22-REC.
000240     02  JOLSF22-01         PIC  9(02).                           ÇqÇbãÊï™
000250     02  JOLSF22-KEYW.
000260         03  JOLSF22-02     PIC  9(04).                           ìæà”êÊCD
000270         03  JOLSF22-03     PIC  9(03).                           íºëóêÊCD
000280     02  JOLSF22-04         PIC  N(26).                           I.020418
000290     02  JOLSF22-05         PIC  N(20).                           I.020418
000300     02  JOLSF22-06         PIC  N(20).                           I.020418
000310*****02  JOLSF22-04         PIC  N(24).                           D.020418
000320*****02  JOLSF22-05         PIC  N(24).                           D.020418
000330*****02  JOLSF22-06         PIC  N(12).                           D.020418
000340*****02  JOLSF22-07         PIC  X(06).                           D.970130
000350*****02  JOLSF22-08         PIC  X(12).                           D.970130
000360     02  JOLSF22-07         PIC  X(08).                           I.970130
000370     02  JOLSF22-08         PIC  X(14).                           I.970130
000380     02  JOLSF22-09         PIC  9(02).                           ï{åß∫∞ƒﬁ
000390     02  JOLSF22-10         PIC  9(01).                           â^ëó∫∞ƒﬁ
000400*****02  JOLSF22-11         PIC  X(22).                           D.970130
000410*****02  JOLSF22-11         PIC  X(18).                           D.020418
000420     02  JOLSF22-11         PIC  X(28).                           I.020418
000430     02  JOLSF22-12         PIC  9(01).                           ACT
000440*****02  F                  PIC  X(82).                           D.020418
000450     02  F                  PIC  X(60).                           I.020418
000460     02  JOLSF22-99         PIC  9(01).                           ëóêMêÊ
000470*
000480*----ïiñºÉtÉ@ÉCÉã          ÅiãÊï™ÅÅÇOÇRÅj
000490 01  JOLSF23-REC.
000500     02  JOLSF23-01         PIC  9(02).                           ÇqÇbãÊï™
000510     02  JOLSF23-KEYW.
000520       03  JOLSF23-MHCD     PIC  9(006).                          I.010810
000530       03  JOLSF23-HCD      PIC  9(006).                          I.010810
000540     02  JOLSF23-NAME       PIC  N(024).                          I.010810
000550     02  JOLSF23-BC.                                              I.010810
000560       03  JOLSF23-BC1      PIC  9(002).                          I.010810
000570       03  JOLSF23-BC2      PIC  9(002).                          I.010810
000580       03  JOLSF23-BC3      PIC  9(002).                          I.010810
000590     02  JOLSF23-ASSD.                                            I.010810
000600       03  JOLSF23-SSD   OCCURS  4.                               I.010810
000610         04  JOLSF23-SS     PIC  9(010).                          I.010810
000620     02  JOLSF23-ASKD  REDEFINES JOLSF23-ASSD.                    I.010810
000630       03  JOLSF23-SKD   OCCURS  4.                               I.010810
000640         04  JOLSF23-SK    OCCURS 10.                             I.010810
000650           05  JOLSF23-S    PIC  9(001).                          I.010810
000660     02  JOLSF23-AHSD  REDEFINES JOLSF23-ASSD.                    I.010810
000670       03  JOLSF23-HSD.                                           I.010810
000680         04  JOLSF23-SS1    PIC  9(010).                          I.010810
000690         04  JOLSF23-SD1   REDEFINES JOLSF23-SS1.                 I.010810
000700           05  JOLSF23-S1    OCCURS  10  PIC  9(001).             I.010810
000710         04  JOLSF23-SS2    PIC  9(010).                          I.010810
000720         04  JOLSF23-SD2    REDEFINES JOLSF23-SS2.                I.010810
000730           05  JOLSF23-S2    OCCURS  10  PIC  9(001).             I.010810
000740         04  JOLSF23-SS3    PIC  9(010).                          I.010810
000750         04  JOLSF23-SD3    REDEFINES JOLSF23-SS3.                I.010810
000760           05  JOLSF23-S3    OCCURS  10  PIC  9(001).             I.010810
000770         04  JOLSF23-SS4    PIC  9(010).                          I.010810
000780         04  JOLSF23-SD4    REDEFINES JOLSF23-SS4.                I.010810
000790           05  JOLSF23-S4    OCCURS  10  PIC  9(001).             I.010810
000800     02  JOLSF23-SB         PIC  9(005).                          I.010810
000810     02  JOLSF23-FT         PIC  9(005).                          I.010810
000820     02  F                  PIC  X(019).                          I.090126
000830*****02  JOLSF23-ZRG        PIC  9(005).                          D.090126
000840*****02  JOLSF23-SKG        PIC  9(005).                          D.090126
000850*****02  JOLSF23-GKG        PIC  9(005).                          D.090126
000860*****02  JOLSF23-KNG        PIC  9(004).                          D.090126
000870     02  JOLSF23-KT         PIC  9(005).                          I.010810
000880     02  JOLSF23-TCD        PIC  9(004).                          I.010810
000890     02  JOLSF23-ISU        PIC  9(003).                          I.010810
000900*****    03  JOLSF23-02     PIC  9(06).                           D.010810
000910*****02  JOLSF23-03         PIC  N(24).                           D.010810
000920*****02  JOLSF23-04         PIC  9(1).                            D.010810
000930*****02  JOLSF23-05.                                              D.010810
000940*****    03  JOLSF23-051.                                         D.010810
000950*****        04  JOLSF23-0511  OCCURS  10  PIC  9(01).            D.010810
000960*****    03  JOLSF23-052.                                         D.010810
000970*****        04  JOLSF23-0521  OCCURS  10  PIC  9(01).            D.010810
000980*****    03  JOLSF23-053.                                         D.010810
000990*****        04  JOLSF23-0531  OCCURS  10  PIC  9(01).            D.010810
001000*****    03  JOLSF23-054.                                         D.010810
001010*****        04  JOLSF23-0541  OCCURS  10  PIC  9(01).            D.010810
001020*****02  JOLSF23-06         PIC  9(02).                           D.010810
001030*****02  JOLSF23-07         PIC  N(15).                           D.010810
001040*****02  JOLSF23-08         PIC  9(03).                           D.010810
001050*****02  JOLSF23-09.                                              D.010810
001060*****    03  JOLSF23-091.                                         D.010810
001070*****        04  JOLSF23-0911  OCCURS  10  PIC  9(01).            D.010810
001080*****    03  JOLSF23-092.                                         D.010810
001090*****        04  JOLSF23-0921  OCCURS  10  PIC  9(01).            D.010810
001100*****    03  JOLSF23-093.                                         D.010810
001110*****        04  JOLSF23-0931  OCCURS  10  PIC  9(01).            D.010810
001120*****    03  JOLSF23-094.                                         D.010810
001130*****        04  JOLSF23-0941  OCCURS  10  PIC  9(01).            D.010810
001140     02  JOLSF23-10         PIC  9(01).                           ACT
001150     02  JOLSF23-SCC        PIC  9(001).                          I.090126
001160     02  JOLSF23-BMC        PIC  9(002).                          I.090126
001170     02  JOLSF23-BMNO       PIC  9(001).                          I.090126
001180     02  JOLSF23-YG         PIC  9(005).                          I.090126
001190     02  JOLSF23-HKB        PIC  9(001).                          I.090126
001200     02  JOLSF23-HPV        PIC  9(001).                          I.090126
001210     02  JOLSF23-BC4        PIC  9(001).                          I.090126
001220     02  F                  PIC  X(011).                          I.090126
001230     02  JOLSF23-SMS        PIC  N(016).                          I.090126
001240     02  JOLSF23-UNG        PIC  9(006).                          I.090126
001250     02  JOLSF23-NNG        PIC  9(006).                          I.090126
001260     02  F                  PIC  X(001).                          I.090126
001270     02  JOLSF23-CS         PIC  N(010).                          I.090126
001280     02  F                  PIC  X(003).                          I.090126
001290     02  JOLSF23-DNG        PIC  9(006).                          I.090126
001300     02  JOLSF23-SNG        PIC  9(004).                          I.090126
001310     02  JOLSF23-ENG        PIC  9(004).                          I.090126
001320*****02 F                   PIC  X(105).                          D.090126
001330*****02 F                   PIC  X(82).                           D.010810
001340     02 JOLSF23-99          PIC  9(01).                           ëóêMêÊ
001350*
001360*----ÉèÅ[ÉNÉ}ÉììXñº        ÅiãÊï™ÅÅÇOÇSÅj
001370 01  JOLSF24-REC.                                                 I.080326
001380     02  JOLSF24-01         PIC  9(02).                           I.080326
001390     02  JOLSF24-KEYW.                                            I.080326
001400       03  JOLSF24-TNC      PIC  9(004).                          I.100922
001410*****  03  JOLSF24-TNC      PIC  9(003).                          D.100922
001420     02  JOLSF24-NAME       PIC  N(026).                          I.080326
001430     02  JOLSF24-BSC        PIC  9(001).                          I.080326
001440     02  F                  PIC  X(007).                          I.100922
001450*****02  F                  PIC  X(008).                          D.100922
001460     02 JOLSF24-10          PIC  9(01).                           I.080326
001470     02  F                  PIC  X(188).                          I.080326
001480     02 JOLSF24-99          PIC  9(01).                           I.080326
001490*
001500*----èoâ◊éwé¶ÉgÉâÉì        ÅiãÊï™ÅÅÇPÇPÅj
001510 01  JOLSF211-REC.
001520     02  JOLSF211-01        PIC 9(02).                            ÇqÇbãÊï™
001530     02  JOLSF211-KEYW.
001540         03  JOLSF211-02    PIC 9(06).                               º≠Ø∂º
001550         03  JOLSF211-03    PIC 9(01).                               ∑ﬁÆ≥
001560     02  JOLSF211-04        PIC 9(01).                               √ﬁ›∏
001570     02  JOLSF211-05.                                                º≠Ø∂À
001580*****    03  JOLSF211-051   PIC 9(02).                            D.980515
001590         03  JOLSF211-051   PIC 9(04).                            I.980515
001600         03  JOLSF211-052   PIC 9(02).                               ¬∑
001610         03  JOLSF211-053   PIC 9(02).                               À
001620     02  JOLSF211-06.                                                º≠Ø∂À
001630*****    03  JOLSF211-061   PIC 9(02).                            D.980515
001640         03  JOLSF211-061   PIC 9(04).                            I.980515
001650         03  JOLSF211-062   PIC 9(02).                               ¬∑
001660         03  JOLSF211-063   PIC 9(02).                               À
001670     02  JOLSF211-07.                                                ¡Æ∏ø≥
001680         03  JOLSF211-071   PIC 9(04).                               ƒ∏≤∫∞
001690         03  JOLSF211-072   PIC 9(03).                               ¡Æ∏ N
001700     02  JOLSF211-08        PIC 9(01).                               ∏◊ ∫∞
001710     02  JOLSF211-09.                                                ºﬁ≠¡≠
001720         03  JOLSF211-091   PIC 9(06).                               ºﬁ≠¡≠
001730         03  JOLSF211-092   PIC 9(01).                               ∑ﬁÆ≥
001740     02  JOLSF211-10        PIC 9(06).                               À›∫∞ƒ
001750     02  JOLSF211-11        PIC 9(01).                               ª≤Ωﬁ∏
001760     02  JOLSF211-12.                                                º≠Ø∂ª
001770         03  JOLSF211-121   OCCURS  10.                              ª≤ΩﬁÕ
001780             04  JOLSF211-1211      PIC  9(04).
001790             04  JOLSF211-1211S     PIC  9(01).                   0:+,1:-
001800         03  JOLSF211-122   PIC  9(05).                           I.981006
001810         03  JOLSF211-122S  PIC  9(01).                           0:+,1:-
001820*****    03  JOLSF211-122   PIC S9(06).                           D.981006
001830     02  JOLSF211-13.                                                º≠Ø∂º
001840         03  JOLSF211-131   OCCURS  10.                              ª≤ΩﬁÕ
001850             04  JOLSF211-1311      PIC  9(04).
001860             04  JOLSF211-1311S     PIC  9(01).                   0:+,1:-
001870         03  JOLSF211-132   PIC  9(05).                           I.981006
001880         03  JOLSF211-132S  PIC  9(01).                           0:+,1:-
001890*****    03  JOLSF211-132   PIC S9(06).                           D.981006
001900     02  JOLSF211-14        PIC 9(01).                               ±Ωﬁ∂ÿ
001910     02  JOLSF211-15        PIC 9(01).                               â^ëó 
001920     02  JOLSF211-15A       PIC 9(03).                               ÉZÉb 
001930     02  JOLSF211-15B       PIC 9(06).                               ëóÇË 
001940     02  JOLSF211-15C       PIC 9(02).                               é}î‘
001950*****02  FILLER             PIC X(3).                             D.981006
001960*****02  FILLER             PIC X(2).                             D.980930
001970*****02  JOLSF211-99        PIC 9(01).                            D.980930
001980     02  JOLSF211-15D       PIC N(09).                               îzíB
001990     02  JOLSF211-16        PIC N(23).                               ìEóv
002000     02  JOLSF211-20        PIC X(10).                            I.981006
002010     02  JOLSF211-16A       PIC  9(03).                           å¬êî
002020     02  JOLSF211-16AS      PIC  9(01).                           0:+,1:-
002030*****02  JOLSF211-18A.                                            D.980930
002040*****    03  JOLSF211-181   PIC 9(06).                            D.980930
002050*****    03  JOLSF211-182   PIC 9(01).                            D.980930
002060*****02  FILLER             PIC X(26).                            D.980515
002070*****02  FILLER             PIC X(22).                            D.980930
002080*****02  FILLER             PIC X(29).                            D.981006
002090     02  FILLER             PIC X(01).                            I.981006
002100     02  JOLSF211-19        PIC X(01).                            èàóùïîèê
002110     02  JOLSF211-168       PIC 9(01).                            àÛéöª≤›
002120     02  JOLSF211-17        PIC 9(01).                            àÍî ã≥àÁ
002130     02  JOLSF211-18        PIC 9(01).                            çXêVª≤›
002140*
002150*----â◊éDÉgÉâÉì            ÅiãÊï™ÅÅÇPÇQÅj
002160 01  JOLSF212-REC.
002170     02  JOLSF212-01        PIC 9(02).                            ÇqÇbãÊï™
002180*
002190     02  JOLSF2121-A.                                             çsNOT=7
002200         03  JOLSF2121-1KEYW.
002210             04  JOLSF2121-01  PIC 9(6).                             √ﬁ›Àﬂ
002220             04  JOLSF2121-02  PIC 9(1).                             ∑ﬁÆ≥
002230         03  JOLSF2121-03   PIC 9(6).                                À›∫∞ƒ
002240         03  JOLSF2121-04.                                            Øø≥À
002250             04  JOLSF2121-041 PIC 9(2).                             »›
002260             04  JOLSF2121-042 PIC 9(2).                             ¬∑
002270             04  JOLSF2121-043 PIC 9(2).                             À
002280         03  JOLSF2121-05.                                           ¡Æ∏∫∞
002290             04  JOLSF2121-051 PIC 9(4).                             ƒ∏≤∫∞
002300             04  JOLSF2121-052 PIC 9(3).                             ¡Æ∏ N
002310         03  JOLSF2121-06   PIC 9(1).                                ≥›ø≥
002320         03  JOLSF2121-07   PIC 9(1).                                ø≥∫∞ƒ
002330         03  JOLSF2121-08   PIC 9(3).                                ∫Ω≥
002340         03  JOLSF2121-08S  PIC 9(1).                             0:+,1:-
002350         03  JOLSF2121-09  OCCURS  27.                               ºØ∂Ω≥
002360             04  JOLSF2121-091  PIC  9(3).                           ª≤ΩﬁÕ
002370             04  JOLSF2121-091S PIC  9(1).                        0:+,1:-
002380         03  JOLSF2121-10   PIC 9(1).                                ≤›ºﬁª
002390         03  JOLSF2121-11   PIC 9(1).                                ∆≠≥ÿÆ
002400         03  JOLSF2121-12   PIC 9(1).                                º≠Ø∂ª
002410         03  JOLSF2121-13   PIC 9(3).                                œ≤Ω≥
002420         03  JOLSF2121-13S  PIC 9(1).                             0:+,1:-
002430         03  JOLSF2121-13A  PIC 9(01).                            àÍî ã≥àÁ
002440         03  FILLER         PIC X(2).
002450         03  JOLSF2121-14   PIC 9(6).                                µ∏ÿºﬁ
002460         03  FILLER         PIC X(98).
002470*
002480     02  JOLSF2122-A        REDEFINES  JOLSF2121-A.               çsÅÅÇV
002490         03  JOLSF2122-1KEYW.
002500             04  JOLSF2122-01  PIC 9(6).                             √ﬁ›Àﬂ
002510             04  JOLSF2122-02  PIC 9(1).                             ∑ﬁÆ≥
002520         03  JOLSF2122-02A  PIC N(9).                                 ≤¿¬
002530         03  JOLSF2122-03   PIC N(23).                               √∑÷≥
002540         03  FILLER         PIC X(69).
002550         03  JOLSF2122-04   PIC 9(1).                                ≤›ºﬁª
002560         03  JOLSF2122-05   PIC 9(1).                                ∆Æ≥ÿÆ
002570         03  JOLSF2122-06   PIC 9(1).                                º≠Ø∂ª
002580         03  JOLSF2122-07   PIC 9(3).                                œ≤Ω≥
002590         03  JOLSF2122-07S  PIC 9(1).                             0:+,1:-
002600         03  JOLSF2122-07A  PIC 9(1).                             àÍî ã≥àÁ
002610         03  FILLER         PIC X(2).
002620         03  JOLSF2122-08   PIC 9(6).                                µ∏ÿºﬁ
002630         03  FILLER         PIC X(98).
002640*
002650*----ëóÇËèÛÉtÉ@ÉCÉã        ÅiãÊï™ÅÅÇPÇRÅj
002660 01  JOLSF213-REC.
002670     02  JOLSF213-01        PIC 9(02).                            ÇqÇbãÊï™
002680     02  JOLSF213-TBL       OCCURS  4.
002690         03  JOLSF213-KEY   .
002700           04  JOLSF213-02  PIC 9(06).                               ëóÇË 
002710         03  JOLSF213-03    PIC 9(01).                               â^ëó 
002720         03  JOLSF213-04    PIC 9(06).                               îNåé 
002730         03  JOLSF213-05    PIC 9(01).                               ëqå… 
002740         03  JOLSF213-06    PIC 9(07).                               íºëó 
002750         03  JOLSF213-07    PIC N(09).                               îzíB 
002760         03  JOLSF213-08    PIC 9(03).                               å¬êî
002770         03  JOLSF213-09    PIC 9(01).                               àÛéö
002780         03  JOLSF213-10    PIC 9(01).                               ãÊï™
002790         03  JOLSF213-11    PIC 9(01).                               çXêV
002800*****    03  F              PIC X(06).                            D.960829
002810         03  JOLSF213-12    PIC 9(05).                            I.960829
002820         03  JOLSF213-13    PIC 9(06).                            I.040628
002830         03  F              PIC X(07).                            I.040628
002840     02  F                  PIC X(02).                            I.040628
002850*****    03  F              PIC X(01).                            D.040628
002860*****02  F                  PIC X(50).                            D.040628
002870*----ÉèÅ[ÉNÉ}Éìì`ï[Çe      ÅiãÊï™ÅÅÇPÇSÅj
002880 01  JOLSF214-REC.                                                I.040922
002890     02  JOLSF214-01            PIC 9(02).                        I.040922
002900*
002910     02  JOLSF2141-A.                                             I.040922
002920         03  JOLSF2141-KEY.                                       I.040922
002930           04  JOLSF2141-STC.                                     I.040922
002940             05  F              PIC  9(002).                      I.040922
002950             05  JOLSF2141-SCD  PIC  9(002).                      I.040922
002960             05  F              PIC  9(001).                      I.100922
002970             05  JOLSF2141-TCD  PIC  9(004).                      I.100922
002980*****        05  F              PIC  9(002).                      D.100922
002990*****        05  JOLSF2141-TCD  PIC  9(003).                      D.100922
003000           04  JOLSF2141-DNO.                                     I.040922
003010             05  F              PIC  9(002).                      I.040922
003020             05  JOLSF2141-DNOD PIC  9(007).                      I.040922
003030           04  JOLSF2141-DGN    PIC  9(002).                      I.040922
003040         03  JOLSF2141-BC.                                        I.040922
003050           04  JOLSF2141-BCD    PIC  9(002).                      I.040922
003060           04  F                PIC  9(001).                      I.040922
003070         03  JOLSF2141-SHC      PIC  9(001).                      I.040922
003080         03  JOLSF2141-DPC      PIC  X(002).                      I.040922
003090         03  JOLSF2141-HNGP     PIC  9(006).                      I.040922
003100         03  JOLSF2141-NNGP     PIC  9(006).                      I.040922
003110         03  JOLSF2141-THC      PIC  9(006).                      I.040922
003120         03  JOLSF2141-MHC      PIC  X(001).                      I.040922
003130         03  F                  PIC  X(001).                      I.040922
003140         03  JOLSF2141-SNA      PIC  X(020).                      I.040922
003150         03  JOLSF2141-TNA      PIC  X(020).                      I.040922
003160         03  JOLSF2141-HCC      PIC  9(001).                      I.040922
003170         03  JOLSF2141-HSP      PIC  X(001).                      I.040922
003180         03  JOLSF2141-DHC      PIC  X(001).                      I.040922
003190         03  JOLSF2141-KHC      PIC  X(001).                      I.040922
003200         03  JOLSF2141-KCC      PIC  X(001).                      I.040922
003210         03  JOLSF2141-UBC      PIC  X(001).                      I.040922
003220         03  JOLSF2141-NCC      PIC  9(001).                      I.040922
003230         03  JOLSF2141-EDI      PIC  9(001).                      I.040922
003240         03  JOLSF2141-NKC      PIC  9(001).                      I.040922
003250         03  JOLSF2141-ZAC      PIC  9(001).                      I.040922
003260         03  F                  PIC  X(157).                      I.040922
003270         03  JOLSF2141-PC       PIC  9(001).                      I.040922
003280*
003290     02  JOLSF2142-A        REDEFINES  JOLSF2141-A.               I.040922
003300         03  JOLSF2142-KEY.                                       I.040922
003310           04  JOLSF2142-STC.                                     I.040922
003320             05  F              PIC  9(002).                      I.040922
003330             05  JOLSF2142-SCD  PIC  9(002).                      I.040922
003340             05  F              PIC  9(001).                      I.100922
003350             05  JOLSF2142-TCD  PIC  9(004).                      I.100922
003360*****        05  F              PIC  9(002).                      D.100922
003370*****        05  JOLSF2142-TCD  PIC  9(003).                      D.100922
003380           04  JOLSF2142-DNO.                                     I.040922
003390             05  F              PIC  9(002).                      I.040922
003400             05  JOLSF2142-DNOD PIC  9(007).                      I.040922
003410           04  JOLSF2142-DGN    PIC  9(002).                      I.040922
003420         03  JOLSF2142-HCD      PIC  X(013).                      I.040922
003430         03  JOLSF2142-ISU      PIC  9(003)V9(01).                I.040922
003440         03  JOLSF2142-KSU      PIC  9(004).                      I.040922
003450         03  JOLSF2142-HTC      PIC  X(002).                      I.040922
003460         03  JOLSF2142-SU       PIC  9(005)V9(01).                I.040922
003470         03  JOLSF2142-GTN      PIC  9(007)V9(02).                I.040922
003480         03  JOLSF2142-UTN      PIC  9(007).                      I.040922
003490         03  JOLSF2142-GKIN     PIC  9(010).                      I.040922
003500         03  JOLSF2142-UKIN     PIC  9(010).                      I.040922
003510         03  JOLSF2142-GCN      PIC  9(006).                      I.040922
003520         03  JOLSF2142-CCD      PIC  X(003).                      I.040922
003530         03  JOLSF2142-SHN      PIC  X(025).                      I.040922
003540         03  JOLSF2142-JAN      PIC  X(013).                      I.040922
003550         03  F                  PIC  X(004).                      I.040922
003560         03  JOLSF2142-TSH      PIC  9(005).                      I.040922
003570         03  JOLSF2142-TKC      PIC  X(001).                      I.040922
003580         03  F                  PIC  X(001).                      I.040922
003590         03  F                  PIC  X(110).                      I.040922
003600         03  JOLSF2142-PC       PIC  9(001).                      I.040922
003610*----ÉiÉtÉRì`ï[Çe Å@Å@     ÅiãÊï™ÅÅÇPÇTÅj
003620 01  JOLSF215-REC.                                                I.050108
003630     02  JOLSF215-01            PIC 9(02).                        I.050108
003640*
003650     02  JOLSF2151-A.                                             I.050108
003660         03  JOLSF2151-KEY.                                       I.050108
003670           04  JOLSF2151-STC.                                     I.050108
003680             05  JOLSF2151-SCD  PIC  9(002).                      I.050108
003690             05  JOLSF2151-TCD  PIC  9(003).                      I.050108
003700             05  F              PIC  X(004).                      I.050108
003710           04  JOLSF2151-DNO.                                     I.050108
003720             05  F              PIC  X(002).                      I.050108
003730             05  JOLSF2151-DNOD PIC  9(007).                      I.050108
003740           04  JOLSF2151-DGN    PIC  9(002).                      I.050108
003750         03  F                  PIC  X(002).                      I.050108
003760         03  JOLSF2151-BCD      PIC  9(002).                      I.050108
003770         03  JOLSF2151-DPC      PIC  9(002).                      I.050108
003780         03  JOLSF2151-HNGP     PIC  9(006).                      I.050108
003790         03  JOLSF2151-HNGPD REDEFINES JOLSF2151-HNGP.            I.050108
003800           04  JOLSF2151-HNEN   PIC  9(002).                      I.050108
003810           04  JOLSF2151-HGET   PIC  9(002).                      I.050108
003820           04  JOLSF2151-HPEY   PIC  9(002).                      I.050108
003830         03  JOLSF2151-NNGP     PIC  9(006).                      I.050108
003840         03  JOLSF2151-NNGPD REDEFINES JOLSF2151-NNGP.            I.050108
003850           04  JOLSF2151-NNEN   PIC  9(002).                      I.050108
003860           04  JOLSF2151-NGET   PIC  9(002).                      I.050108
003870           04  JOLSF2151-NPEY   PIC  9(002).                      I.050108
003880         03  JOLSF2151-THC      PIC  9(006).                      I.050108
003890         03  JOLSF2151-STA      PIC  X(002).                      I.050108
003900         03  JOLSF2151-SNA      PIC  X(015).                      I.050108
003910         03  JOLSF2151-TNA      PIC  X(015).                      I.050108
003920         03  JOLSF2151-TSN      PIC  X(015).                      I.050108
003930         03  JOLSF2151-TST      PIC  X(012).                      I.050108
003940         03  JOLSF2151-HCC      PIC  9(001).                      I.050108
003950         03  F                  PIC  X(024).                      I.050108
003960         03  JOLSF2151-AR       PIC  X(007).                      I.050108
003970         03  JOLSF2151-DUR      PIC  X(026).                      I.050108
003980         03  JOLSF2151-DSHR     PIC  X(014).                      I.050108
003990         03  JOLSF2151-DSMR     PIC  X(007).                      I.050108
004000         03  JOLSF2151-ER       PIC  X(005).                      I.050108
004010         03  JOLSF2151-FSR      PIC  X(015).                      I.050108
004020         03  JOLSF2151-FUR      PIC  X(007).                      I.050108
004030         03  JOLSF2151-LCR      PIC  X(016).                      I.050108
004040         03  JOLSF2151-LUR      PIC  X(020).                      I.050108
004050         03  JOLSF2151-LSR      PIC  X(007).                      I.050108
004060         03  F                  PIC  X(001).                      I.050108
004070         03  JOLSF2151-PC       PIC  9(001).                      I.050108
004080*
004090     02  JOLSF2152-A        REDEFINES  JOLSF2151-A.               I.050108
004100         03  JOLSF2152-KEY.                                       I.050108
004110           04  JOLSF2152-STC.                                     I.050108
004120             05  JOLSF2152-SCD  PIC  9(002).                      I.050108
004130             05  JOLSF2152-TCD  PIC  9(003).                      I.050108
004140             05  F              PIC  X(004).                      I.050108
004150           04  JOLSF2152-DNO.                                     I.050108
004160             05  F              PIC  X(002).                      I.050108
004170             05  JOLSF2152-DNOD PIC  9(007).                      I.050108
004180           04  JOLSF2152-DGN    PIC  9(002).                      I.050108
004190         03  JOLSF2152-JAN      PIC  X(013).                      I.050108
004200         03  JOLSF2152-GAR      PIC  X(006).                      I.050108
004210         03  F                  PIC  X(001).                      I.050108
004220         03  JOLSF2152-TNI      PIC  X(003).                      I.050108
004230         03  JOLSF2152-SU       PIC  9(005).                      I.050108
004240         03  F                  PIC  X(001).                      I.050108
004250         03  JOLSF2152-GTN      PIC  9(007).                      I.050108
004260         03  F                  PIC  X(002).                      I.050108
004270         03  JOLSF2152-UTN      PIC  9(007).                      I.050108
004280         03  JOLSF2152-GKIN     PIC  9(010).                      I.050108
004290         03  JOLSF2152-UKIN     PIC  9(010).                      I.050108
004300         03  F                  PIC  X(009).                      I.050108
004310         03  JOLSF2152-SHN      PIC  X(025).                      I.050108
004320         03  JOLSF2152-HSC      PIC  X(008).                      I.050108
004330         03  JOLSF2152-COR      PIC  X(006).                      I.050108
004340         03  JOLSF2152-SIZ      PIC  X(005).                      I.050108
004350         03  F                  PIC  X(004).                      I.050108
004360         03  JOLSF2152-KKK      PIC  X(025).                      I.050108
004370         03  JOLSF2152-PCH      PIC  X(001).                      I.050108
004380         03  JOLSF2152-PSI      PIC  X(001).                      I.050108
004390         03  JOLSF2152-PBM      PIC  9(002).                      I.050108
004400         03  JOLSF2152-PJAN     PIC  X(013).                      I.050108
004410         03  JOLSF2152-PSHN     PIC  X(020).                      I.050108
004420         03  JOLSF2152-PKKK     PIC  X(020).                      I.050108
004430         03  JOLSF2152-PUTN     PIC  9(007).                      I.050108
004440         03  JOLSF2152-PMS      PIC  9(005).                      I.050108
004450         03  F                  PIC  X(017).                      I.050108
004460         03  JOLSF2152-PC       PIC  9(001).                      I.050108
004470*----ÉgÉâÉXÉRëºìùàÍì`ï[    ÅiãÊï™ÅÅÇPÇUÅj
004480 01  JOLSF216-REC.                                                I.080325
004490     02  JOLSF216-01            PIC 9(02).                        I.080325
004500     02  JOLSF216-A.                                              I.080325
004510         03  JOLSF216-KEY.                                        I.080325
004520             04  JOLSF216-DNO   PIC  9(006).                      I.080325
004530             04  JOLSF216-GNO   PIC  9(001).                      I.080325
004540         03  JOLSF216-DATE      PIC  9(006).                      I.080325
004550         03  JOLSF216-TCD       PIC  9(004).                      I.080325
004560         03  JOLSF216-CCD       PIC  9(003).                      I.080325
004570*****    03  JOLSF216-TPC       PIC  9(003).                      D.100922
004580         03  JOLSF216-TPC       PIC  9(004).                      I.100922
004590         03  JOLSF216-HCD       PIC  9(006).                      I.080325
004600         03  JOLSF216-SIZ       PIC  X(003).                      I.080325
004610         03  JOLSF216-SKB       PIC  9(001).                      I.080325
004620         03  JOLSF216-SNO       PIC  9(002).                      I.080325
004630*****    03  JOLSF216-SU        PIC S9(005).                      D.080401
004640         03  JOLSF216-SU        PIC  9(005).                      I.080401
004650         03  JOLSF216-SUS       PIC  9(001).                      I.080401
004660         03  JOLSF216-GT        PIC  9(007).                      I.080325
004670         03  JOLSF216-UT        PIC  9(007).                      I.080325
004680         03  JOLSF216-GKIN      PIC  9(008).                      I.080401
004690         03  JOLSF216-GKINS     PIC  9(001).                      I.080401
004700         03  JOLSF216-UKIN      PIC  9(008).                      I.080401
004710         03  JOLSF216-UKINS     PIC  9(001).                      I.080401
004720*****    03  JOLSF216-GKIN      PIC S9(008).                      D.080401
004730*****    03  JOLSF216-UKIN      PIC S9(008).                      D.080401
004740         03  JOLSF216-JNOD.                                       I.080325
004750             04  JOLSF216-JNO   PIC  9(006).                      I.080325
004760             04  JOLSF216-JGN   PIC  9(001).                      I.080325
004770         03  JOLSF216-SOK       PIC  9(001).                      I.080325
004780         03  JOLSF216-UNS       PIC  9(001).                      I.080325
004790         03  JOLSF216-ISU       PIC  9(003).                      I.080325
004800         03  JOLSF216-HNO       PIC  X(010).                      I.080325
004810         03  JOLSF216-TEKI      PIC  N(028).                      I.080325
004820         03  JOLSF216-TED   REDEFINES JOLSF216-TEKI.              I.080325
004830             04  JOLSF216-THT   PIC  N(009).                      I.080325
004840             04  JOLSF216-TTE   PIC  N(019).                      I.080325
004850         03  JOLSF216-TRN       PIC  X(020).                      I.080325
004860         03  JOLSF216-JAN       PIC  X(013).                      I.100922
004870         03  JOLSF216-PRC       PIC  9(001).                      I.080325
004880         03  JOLSF216-UPC       PIC  9(001).                      I.080325
004890         03  F                  PIC  X(067).                      I.100922
004900*****02  F                      PIC  X(081).                      D.100922
004910*****02  F                      PIC  X(084).                      D.080401
004920*----ê‘ÇøÇ·ÇÒñ{ï‹ìùàÍì`ï[    ÅiãÊï™ÅÅÇPÇVÅj
004930 01  JOLSF217-REC.                                                I.091221
004940     02  JOLSF217-01           PIC 9(02).                         I.091221
004950     02  JOLSF217-KEY.                                            I.091221
004960         03  JOLSF217-STC      PIC  9(007).                       I.091221
004970*****    03  JOLSF217-DNO      PIC  9(006).                       D.100901
004980         03  JOLSF217-DNO      PIC  9(007).                       I.100901
004990         03  JOLSF217-DGN      PIC  9(002).                       I.091221
005000     02  JOLSF217-JAN          PIC  X(013).                       I.091221
005010     02  JOLSF217-SU           PIC  9(006).                       I.091221
005020     02  JOLSF217-SUS          PIC  9(001).                       I.091221
005030     02  JOLSF217-GTN          PIC  9(007).                       I.091221
005040     02  JOLSF217-UTN          PIC  9(007).                       I.091221
005050     02  JOLSF217-GKIN         PIC  9(010).                       I.091221
005060     02  JOLSF217-GKINS        PIC  9(001).                       I.091221
005070     02  JOLSF217-UKIN         PIC  9(010).                       I.091221
005080     02  JOLSF217-UKINS        PIC  9(001).                       I.091221
005090     02  JOLSF217-DPM          PIC  X(002).                       I.091221
005100     02  JOLSF217-CLS          PIC  X(003).                       I.091221
005110     02  JOLSF217-SHM          PIC  X(013).                       I.091221
005120     02  JOLSF217-MKH          PIC  X(010).                       I.091221
005130     02  JOLSF217-MSB          PIC  X(010).                       I.091221
005140     02  JOLSF217-TY           PIC  X(002).                       I.091221
005150     02  JOLSF217-HCD          PIC  9(006).                       I.091221
005160     02  JOLSF217-COR          PIC  N(004).                       I.091221
005170     02  JOLSF217-SIZ          PIC  X(004).                       I.091221
005180     02  JOLSF217-NSU          PIC  9(006).                       I.091221
005190     02  JOLSF217-TSC          PIC  9(001).                       I.091221
005200*****02  F                     PIC  X(009).                       D.100901
005210     02  F                     PIC  X(008).                       I.100901
005220     02  JOLSF217-CCD          PIC  9(003).                       I.091221
005230     02  JOLSF217-TNA          PIC  N(014).                       I.091221
005240     02  JOLSF217-HNO          PIC  9(009).                       I.091221
005250     02  JOLSF217-HNGP         PIC  9(006).                       I.091221
005260     02  JOLSF217-NNGP         PIC  9(006).                       I.091221
005270     02  JOLSF217-THC          PIC  9(006).                       I.091221
005280     02  JOLSF217-BI           PIC  X(010).                       I.091221
005290     02  JOLSF217-SNGP         PIC  9(008).                       I.091221
005300     02  JOLSF217-HNA          PIC  X(006).                       I.091221
005310     02  JOLSF217-ZON          PIC  X(004).                       I.091221
005320     02  JOLSF217-DC           PIC  9(002).                       I.091221
005330     02  F                     PIC  X(002).                       I.091221
005340     02  JOLSF217-DNGP         PIC  9(008).                       I.091221
005350     02  JOLSF217-NRC          PIC  9(001).                       I.091221
005360     02  F                     PIC  X(008).                       I.091221
005370     02  JOLSF217-PC           PIC  9(001).                       I.091221
005380     02  JOLSF217-RC           PIC  9(001).                       I.091221
