000010***********************************************
000020*****                                     *****
000030**   Å@Å@  ÇnÅ^ÇkëóêMó›êœÉtÉ@ÉCÉãÅ@Å@Å@Å@Å@Å@**
000040*****         ( JOLSR   )  341/3          *****
000050***********************************************
000060 FD  JOLSR
000070*****BLOCK 1 RECORDS                                              D.090126
000080     BLOCK 3 RECORDS                                              I.090126
000090     LABEL RECORD IS STANDARD
000100     VALUE OF IDENTIFICATION "JOLSR".
000110*
000120*----ÉRÉìÉgÉçÅ[ÉãÇeóp      ÅiãÊï™ÅÅÇOÇPÅj
000130 01  JOLSR1-REC.
000140     02  JOLSR1-01         PIC  9(02).                            ÇqÇbãÊï™
000150     02  JOLSR1-02         PIC  9(01).                            ID
000160     02  JOLSR1-03         PIC  9(01).                            â^&ëqCD
000170     02  JOLSR1-04         PIC  N(06).                            â^&ëqCD
000180     02  JOLSR1-05         PIC  X(18).                            FILLER
000190     02  F                 PIC  X(221).
000200     02  JOLSR1-99         PIC  9(01).                            ëóêMêÊ
000210     02  F                 PIC  X(083).                           I.030409
000220     02  JOLSR1-NO         PIC  9(02).                            I.030409
000230*
000240*----íºëóêÊÉ}ÉXÉ^óp        ÅiãÊï™ÅÅÇOÇQÅj
000250 01  JOLSR2-REC.
000260     02  JOLSR2-01         PIC  9(02).                            ÇqÇbãÊï™
000270     02  JOLSR2-02         PIC  9(04).                            ìæà”êÊCD
000280     02  JOLSR2-03         PIC  9(03).                            íºëóêÊCD
000290     02  JOLSR2-04         PIC  N(26).                            I.020418
000300     02  JOLSR2-05         PIC  N(20).                            I.020418
000310     02  JOLSR2-06         PIC  N(20).                            I.020418
000320*****02  JOLSR2-04         PIC  N(24).                            D.020418
000330*****02  JOLSR2-05         PIC  N(24).                            D.020418
000340*****02  JOLSR2-06         PIC  N(12).                            D.020418
000350*****02  JOLSR2-07         PIC  X(06).                            D.970130
000360*****02  JOLSR2-08         PIC  X(12).                            D.970130
000370     02  JOLSR2-07         PIC  X(08).                            I.970130
000380     02  JOLSR2-08         PIC  X(14).                            I.970130
000390     02  JOLSR2-09         PIC  9(02).                            ï{åß∫∞ƒﬁ
000400     02  JOLSR2-10         PIC  9(01).                            â^ëó∫∞ƒﬁ
000410*****02  JOLSR2-11         PIC  X(22).                            D.970130
000420*****02  JOLSR2-11         PIC  X(18).                            D.020418
000430     02  JOLSR2-11         PIC  X(28).                            I.020418
000440     02  JOLSR2-12         PIC  9(01).                            ACT
000450*****02  F                 PIC  X(82).                            D.020418
000460     02  F                 PIC  X(60).                            I.020418
000470     02  JOLSR2-99         PIC  9(01).                            ëóêMêÊ
000480     02  F                 PIC  X(083).                           I.030409
000490     02  JOLSR2-NO         PIC  9(02).                            I.030409
000500*
000510*----ïiñºÉtÉ@ÉCÉã      ÅiãÊï™ÅÅÇOÇRÅj
000520 01  JOLSR3-REC.
000530     02  JOLSR3-01         PIC  9(02).                            ÇqÇbãÊï™
000540     02  JOLSR3-KEY2.                                             I.090126
000550         03  JOLSR3-MHCD   PIC  9(006).                           I.090126
000560         03  JOLSR3-HCD    PIC  9(006).                           I.090126
000570     02  JOLSR3-NAME       PIC  N(024).                           I.090126
000580     02  JOLSR3-BC.                                               I.090126
000590         03  JOLSR3-BC1    PIC  9(002).                           I.090126
000600         03  JOLSR3-BC2    PIC  9(002).                           I.090126
000610         03  JOLSR3-BC3    PIC  9(002).                           I.090126
000620     02  JOLSR3-ASSD.                                             I.090126
000630       03  JOLSR3-SSD   OCCURS  4.                                I.090126
000640         04  JOLSR3-SS     PIC  9(010).                           I.090126
000650     02  JOLSR3-ASKD  REDEFINES JOLSR3-ASSD.                      I.090126
000660       03  JOLSR3-SKD   OCCURS  4.                                I.090126
000670         04  JOLSR3-SK    OCCURS 10.                              I.090126
000680           05  JOLSR3-S    PIC  9(001).                           I.090126
000690     02  JOLSR3-AHSD  REDEFINES JOLSR3-ASSD.                      I.090126
000700       03  JOLSR3-HSD.                                            I.090126
000710         04  JOLSR3-SS1    PIC  9(010).                           I.090126
000720         04  JOLSR3-SD1   REDEFINES JOLSR3-SS1.                   I.090126
000730           05  JOLSR3-S1    OCCURS  10  PIC  9(001).              I.090126
000740         04  JOLSR3-SS2    PIC  9(010).                           I.090126
000750         04  JOLSR3-SD2    REDEFINES JOLSR3-SS2.                  I.090126
000760           05  JOLSR3-S2    OCCURS  10  PIC  9(001).              I.090126
000770         04  JOLSR3-SS3    PIC  9(010).                           I.090126
000780         04  JOLSR3-SD3    REDEFINES JOLSR3-SS3.                  I.090126
000790           05  JOLSR3-S3    OCCURS  10  PIC  9(001).              I.090126
000800         04  JOLSR3-SS4    PIC  9(010).                           I.090126
000810         04  JOLSR3-SD4    REDEFINES JOLSR3-SS4.                  I.090126
000820           05  JOLSR3-S4    OCCURS  10  PIC  9(001).              I.090126
000830*****02  JOLSR3-02         PIC  9(06).                            D.090126
000840*****02  JOLSR3-03         PIC  N(24).                            D.090126
000850*****02  JOLSR3-04         PIC  9(1).                             D.090126
000860*****02  JOLSR3-05.                                               D.090126
000870*****    03  JOLSR3-051.                                          D.090126
000880*****        04  JOLSR3-0511  OCCURS  10  PIC  9(01).             D.090126
000890*****    03  JOLSR3-052.                                          D.090126
000900*****        04  JOLSR3-0521  OCCURS  10  PIC  9(01).             D.090126
000910*****    03  JOLSR3-053.                                          D.090126
000920*****        04  JOLSR3-0531  OCCURS  10  PIC  9(01).             D.090126
000930*****    03  JOLSR3-054.                                          D.090126
000940*****        04  JOLSR3-0541  OCCURS  10  PIC  9(01).             D.090126
000950*****02  JOLSR3-06         PIC  9(02).                            D.090126
000960*****02  JOLSR3-07         PIC  N(15).                            D.090126
000970*****02  JOLSR3-08         PIC  9(03).                            D.090126
000980*****02  JOLSR3-09.                                               D.090126
000990*****    03  JOLSR3-091.                                          D.090126
001000*****        04  JOLSR3-0911  OCCURS  10  PIC  9(01).             D.090126
001010*****    03  JOLSR3-092.                                          D.090126
001020*****        04  JOLSR3-0921  OCCURS  10  PIC  9(01).             D.090126
001030*****    03  JOLSR3-093.                                          D.090126
001040*****        04  JOLSR3-0931  OCCURS  10  PIC  9(01).             D.090126
001050*****    03  JOLSR3-094.                                          D.090126
001060*****        04  JOLSR3-0941  OCCURS  10  PIC  9(01).             D.090126
001070     02  JOLSR3-SB         PIC  9(005).                           I.090126
001080     02  JOLSR3-FT         PIC  9(005).                           I.090126
001090     02  F                 PIC  X(019).                           I.090126
001100     02  JOLSR3-KT         PIC  9(005).                           I.090126
001110     02  JOLSR3-TCD        PIC  9(004).                           I.090126
001120     02  JOLSR3-ISU        PIC  9(003).                           I.090126
001130     02  JOLSR3-10         PIC  9(01).                            ACT
001140     02  JOLSR3-SCC        PIC  9(001).                           I.090126
001150     02  JOLSR3-BMC        PIC  9(002).                           I.090126
001160     02  JOLSR3-BMNO       PIC  9(001).                           I.090126
001170     02  JOLSR3-YG         PIC  9(005).                           I.090126
001180     02  JOLSR3-HKB        PIC  9(001).                           I.090126
001190     02  JOLSR3-HPV        PIC  9(001).                           I.090126
001200     02  JOLSR3-BC4        PIC  9(001).                           I.090126
001210     02  F                 PIC  X(011).                           I.090126
001220     02  JOLSR3-SMS        PIC  N(016).                           I.090126
001230     02  JOLSR3-UNG        PIC  9(006).                           I.090126
001240     02  JOLSR3-NNG        PIC  9(006).                           I.090126
001250     02  F                 PIC  X(001).                           I.090126
001260     02  JOLSR3-CS         PIC  N(010).                           I.090126
001270     02  F                 PIC  X(003).                           I.090126
001280     02  JOLSR3-DNG        PIC  9(006).                           I.090126
001290     02  JOLSR3-SNG        PIC  9(004).                           I.090126
001300     02  JOLSR3-ENG        PIC  9(004).                           I.090126
001310*****02  F                 PIC  X(82).                            D.090126
001320     02  JOLSR3-99         PIC  9(01).                            ëóêMêÊ
001330     02  F                 PIC  X(083).                           I.030409
001340     02  JOLSR3-NO         PIC  9(02).                            I.030409
001350*
001360*----ÉèÅ[ÉNÉ}ÉììXñºÉtÉ@ÉCÉãÅiãÊï™ÅÅÇOÇSÅj
001370 01  JOLSR4-REC.                                                  I.080328
001380     02  JOLSR4-01         PIC  9(02).                            I.080328
001390*****02  JOLSR4-02         PIC  9(03).                            D.100922
001400     02  JOLSR4-02         PIC  9(04).                            I.100922
001410     02  JOLSR4-03         PIC  N(26).                            I.080328
001420     02  JOLSR4-04         PIC  9(1).                             I.080328
001430     02  F                 PIC  X(07).                            I.100922
001440*****02  F                 PIC  X(08).                            D.100922
001450     02  F                 PIC  X(189).                           I.100922
001460     02  JOLSR4-99         PIC  9(01).                            I.080328
001470     02  F                 PIC  X(083).                           I.100922
001480*****02  F                 PIC  X(187).                           D.100922
001490     02  JOLSR4-NO         PIC  9(02).                            I.080328
001500*
001510*----èoâ◊éwé¶ÉgÉâÉì        ÅiãÊï™ÅÅÇPÇPÅj
001520 01  JOLSR11-REC.
001530     02  JOLSR11-01        PIC 9(02).                             ÇqÇbãÊï™
001540     02  JOLSR11-02        PIC 9(06).                                º≠Ø∂º
001550     02  JOLSR11-03        PIC 9(01).                                ∑ﬁÆ≥
001560     02  JOLSR11-04        PIC 9(01).                                √ﬁ›∏
001570     02  JOLSR11-05.                                                 º≠Ø∂À
001580*****    03  JOLSR11-051   PIC 9(02).                             D.980515
001590         03  JOLSR11-051   PIC 9(04).                             I.980515
001600         03  JOLSR11-052   PIC 9(02).                                ¬∑
001610         03  JOLSR11-053   PIC 9(02).                                À
001620     02  JOLSR11-06.                                                 º≠Ø∂À
001630*****    03  JOLSR11-061   PIC 9(02).                             D.980515
001640         03  JOLSR11-061   PIC 9(04).                             I.980515
001650         03  JOLSR11-062   PIC 9(02).                                ¬∑
001660         03  JOLSR11-063   PIC 9(02).                                À
001670     02  JOLSR11-07.                                                 ¡Æ∏ø≥
001680         03  JOLSR11-071   PIC 9(04).                                ƒ∏≤∫∞
001690         03  JOLSR11-072   PIC 9(03).                                ¡Æ∏ N
001700     02  JOLSR11-08        PIC 9(01).                                ∏◊ ∫∞
001710     02  JOLSR11-09.                                                 ºﬁ≠¡≠
001720         03  JOLSR11-091   PIC 9(06).                                ºﬁ≠¡≠
001730         03  JOLSR11-092   PIC 9(01).                                ∑ﬁÆ≥
001740     02  JOLSR11-10        PIC 9(06).                                À›∫∞ƒ
001750     02  JOLSR11-11        PIC 9(01).                                ª≤Ωﬁ∏
001760     02  JOLSR11-12.                                                 º≠Ø∂ª
001770         03  JOLSR11-121   OCCURS  10.                               ª≤ΩﬁÕ
001780             04  JOLSR11-1211      PIC S9(04).
001790         03  JOLSR11-122   PIC S9(05).                            I.981006
001800*****    03  JOLSR11-122   PIC S9(06).                            D.981006
001810     02  JOLSR11-13.                                                 º≠Ø∂º
001820         03  JOLSR11-131   OCCURS  10.                               ª≤ΩﬁÕ
001830             04  JOLSR11-1311      PIC S9(04).
001840         03  JOLSR11-132   PIC S9(05).                            I.981006
001850*****    03  JOLSR11-132   PIC S9(06).                            D.981006
001860     02  JOLSR11-14        PIC 9(01).                                ±Ωﬁ∂ÿ
001870     02  JOLSR11-15        PIC 9(01).                                â^ëó 
001880     02  JOLSR11-15A       PIC 9(03).                                ÉZÉb 
001890     02  JOLSR11-15B       PIC 9(06).                                ëóÇË 
001900     02  JOLSR11-15C       PIC 9(02).                                é}î‘
001910*****02  FILLER            PIC X(3).                              D.981006
001920*****02  FILLER            PIC X(2).                              D.980930
001930*****02  JOLSR11-99        PIC 9(01).                             D.980930
001940     02  JOLSR11-15D       PIC N(09).                                îzíB
001950     02  JOLSR11-16        PIC N(23).                                ìEóv
001960     02  JOLSR11-20        PIC X(10).                             I.981006
001970     02  JOLSR11-16A       PIC S9(03).                            å¬êî
001980*****02  JOLSR11-18A.                                             D.980930
001990*****    03  JOLSR11-181   PIC 9(06).                             D.980930
002000*****    03  JOLSR11-182   PIC 9(01).                             D.980930
002010*****02  FILLER            PIC X(26).                             D.980515
002020*****02  FILLER            PIC X(22).                             D.980930
002030*****02  FILLER            PIC X(29).                             D.981006
002040     02  FILLER            PIC X(24).                             I.981006
002050     02  JOLSR11-19        PIC X(01).                             èàóùïîèê
002060     02  JOLSR11-168       PIC 9(01).                                A-890
002070     02  JOLSR11-17        PIC 9(01).                                àÍî  
002080     02  JOLSR11-18        PIC 9(01).                                çXêVª
002090     02  F                 PIC  X(083).                           I.030409
002100     02  JOLSR11-NO        PIC  9(02).                            I.030409
002110*
002120*----â◊éDÉgÉâÉì            ÅiãÊï™ÅÅÇPÇQÅj
002130 01  JOLSR12-REC.
002140     02  JOLSR12-01        PIC 9(02).                             ÇqÇbãÊï™
002150*
002160     02  JOLSR121-A.                                              çsNOT=7
002170         03  JOLSR121-01   PIC 9(6).                                 √ﬁ›Àﬂ
002180         03  JOLSR121-02   PIC 9(1).                                 ∑ﬁÆ≥
002190         03  JOLSR121-03   PIC 9(6).                                 À›∫∞ƒ
002200         03  JOLSR121-04.                                             Øø≥À
002210          04  JOLSR121-041 PIC 9(2).                                 »›
002220          04  JOLSR121-042 PIC 9(2).                                 ¬∑
002230          04  JOLSR121-043 PIC 9(2).                                 À
002240         03  JOLSR121-05.                                            ¡Æ∏∫∞
002250          04  JOLSR121-051 PIC 9(4).                                 ƒ∏≤∫∞
002260          04  JOLSR121-052 PIC 9(3).                                 ¡Æ∏ N
002270         03  JOLSR121-06   PIC 9(1).                                 ≥›ø≥
002280         03  JOLSR121-07   PIC 9(1).                                 ø≥∫∞ƒ
002290         03  JOLSR121-08   PIC S9(3).                                ∫Ω≥
002300         03   JOLSR121-09  OCCURS  27.                               ºØ∂Ω≥
002310          04  JOLSR121-091 PIC S9(3).                                ª≤ΩﬁÕ
002320         03  JOLSR121-10   PIC 9(1).                                 ≤›ºﬁª
002330         03  JOLSR121-11   PIC 9(1).                                 ∆≠≥ÿÆ
002340         03  JOLSR121-12   PIC 9(1).                                 º≠Ø∂ª
002350         03  JOLSR121-13   PIC S9(3).                                œ≤Ω≥
002360         03  JOLSR121-13A  PIC 9(1).                              àÍî ã≥àÁ
002370         03  FILLER        PIC X(2).
002380         03  JOLSR121-14   PIC 9(6).                                 µ∏ÿºﬁ
002390*
002400     02  JOLSR122-A        REDEFINES  JOLSR121-A.                 çsÅÅÇV
002410         03  JOLSR122-01   PIC 9(6).                                 √ﬁ›Àﬂ
002420         03  JOLSR122-02   PIC 9(1).                                 ∑ﬁÆ≥
002430         03  JOLSR122-02A  PIC N(9).                                  ≤¿¬
002440         03  JOLSR122-03   PIC N(23).                                √∑÷≥
002450         03  FILLER        PIC X(41).
002460         03  JOLSR122-04   PIC 9(1).                                 ≤›ºﬁª
002470         03  JOLSR122-05   PIC 9(1).                                 ∆Æ≥ÿÆ
002480         03  JOLSR122-06   PIC 9(1).                                 º≠Ø∂ª
002490         03  JOLSR122-07   PIC S9(3).                                œ≤Ω≥
002500         03  JOLSR122-07A  PIC 9(1).                              àÍî ã≥àÁ
002510         03  FILLER        PIC X(2).
002520         03  JOLSR122-08   PIC 9(6).                                 µ∏ÿºﬁ
002530*
002540     02  JOLSR121-B.                                              çsNOT=7
002550         03  JOLSR121-21   PIC 9(6).                                 √ﬁ›Àﬂ
002560         03  JOLSR121-22   PIC 9(1).                                 ∑ﬁÆ≥
002570         03  JOLSR121-23   PIC 9(6).                                 À›∫∞ƒ
002580         03  JOLSR121-24.                                             Øø≥À
002590          04  JOLSR121-241 PIC 9(2).                                 »›
002600          04  JOLSR121-242 PIC 9(2).                                 ¬∑
002610          04  JOLSR121-243 PIC 9(2).                                 À
002620         03  JOLSR121-25.                                            ¡Æ∏∫∞
002630          04  JOLSR121-251 PIC 9(4).                                 ƒ∏≤∫∞
002640          04  JOLSR121-252 PIC 9(3).                                 ¡Æ∏ N
002650         03  JOLSR121-26   PIC 9(1).                                 ≥›ø≥
002660         03  JOLSR121-27   PIC 9(1).                                 ø≥∫∞ƒ
002670         03  JOLSR121-28   PIC S9(3).                                ∫Ω≥
002680         03   JOLSR121-29  OCCURS  27.                               ºØ∂Ω≥
002690          04  JOLSR121-291 PIC S9(3).                                ª≤ΩﬁÕ
002700         03  JOLSR121-30   PIC 9(1).                                 ≤›ºﬁª
002710         03  JOLSR121-31   PIC 9(1).                                 ∆≠≥ÿÆ
002720         03  JOLSR121-32   PIC 9(1).                                 º≠Ø∂ª
002730         03  JOLSR121-33   PIC S9(3).                                œ≤Ω≥
002740         03  JOLSR121-33A  PIC 9(1).                              àÍî ã≥àÁ
002750         03  FILLER        PIC X(2).
002760         03  JOLSR121-34   PIC 9(6).                                 µ∏ÿºﬁ
002770*
002780     02  JOLSR122-B        REDEFINES  JOLSR121-B.                 çsÅÅÇV
002790         03  JOLSR122-21   PIC 9(6).                                 √ﬁ›Àﬂ
002800         03  JOLSR122-22   PIC 9(1).                                 ∑ﬁÆ≥
002810         03  JOLSR122-22A  PIC N(9).                                  ≤¿¬
002820         03  JOLSR122-23   PIC N(23).                                √∑÷≥
002830         03  FILLER        PIC X(41).
002840         03  JOLSR122-24   PIC 9(1).                                 ≤›ºﬁª
002850         03  JOLSR122-25   PIC 9(1).                                 ∆Æ≥ÿÆ
002860         03  JOLSR122-26   PIC 9(1).                                 º≠Ø∂ª
002870         03  JOLSR122-27   PIC S9(3).                                œ≤Ω≥
002880         03  JOLSR122-27A  PIC 9(1).                              àÍî ã≥àÁ
002890         03  FILLER        PIC X(2).
002900         03  JOLSR122-28   PIC 9(6).                                 µ∏ÿºﬁ
002910     02  F                 PIC  X(083).                           I.030409
002920     02  JOLSR12-NO        PIC  9(02).                            I.030409
002930*****02  F                 PIC X(54).
002940*
002950*----ëóÇËèÛÉtÉ@ÉCÉã        ÅiãÊï™ÅÅÇPÇRÅj
002960 01  JOLSR13-REC.
002970     02  JOLSR13-01        PIC 9(02).                             ÇqÇbãÊï™
002980     02  JOLSR13-TBL       OCCURS  4.
002990         03  JOLSR13-02    PIC 9(06).                                ëóÇË 
003000         03  JOLSR13-03    PIC 9(01).                                â^ëó 
003010         03  JOLSR13-04    PIC 9(06).                                îNåé 
003020         03  JOLSR13-05    PIC 9(01).                                ëqå… 
003030         03  JOLSR13-06    PIC 9(07).                                íºëó 
003040         03  JOLSR13-07    PIC N(09).                                îzíB 
003050         03  JOLSR13-08    PIC 9(03).                                å¬êî
003060         03  JOLSR13-09    PIC 9(01).                                àÛéö
003070         03  JOLSR13-10    PIC 9(01).                                ãÊï™
003080         03  JOLSR13-11    PIC 9(01).                                çXêV
003090         03  F             PIC X(18).                             I.040628
003100     02  F                 PIC X(02).                             I.040628
003110*****    03  F             PIC X(06).                             D.040628
003120*****02  F                 PIC X(50).                             D.040628
003130     02  F                 PIC  X(083).                           I.030409
003140     02  JOLSR13-NO        PIC  9(02).                            I.030409
003150*----ÉèÅ[ÉNÉ}Éìì`ï[Çe      ÅiãÊï™ÅÅÇPÇSÅj
003160 01  JOLSR14-REC.                                                 I.050330
003170     02  JOLSR14-01            PIC 9(02).                         I.050330
003180*
003190     02  JOLSR141-A.                                              I.050330
003200         03  JOLSR141-KEY.                                        I.050330
003210           04  JOLSR141-STC.                                      I.050330
003220             05  F             PIC  9(002).                       I.050330
003230             05  JOLSR141-SCD  PIC  9(002).                       I.050330
003240             05  F             PIC  9(001).                       I.100922
003250             05  JOLSR141-TCD  PIC  9(004).                       I.100922
003260*****        05  F             PIC  9(002).                       D.100922
003270*****        05  JOLSR141-TCD  PIC  9(003).                       D.100922
003280           04  JOLSR141-DNO.                                      I.050330
003290             05  F             PIC  9(002).                       I.050330
003300             05  JOLSR141-DNOD PIC  9(007).                       I.050330
003310           04  JOLSR141-DGN    PIC  9(002).                       I.050330
003320         03  JOLSR141-BC.                                         I.050330
003330           04  JOLSR141-BCD    PIC  9(002).                       I.050330
003340           04  F               PIC  9(001).                       I.050330
003350         03  JOLSR141-SHC      PIC  9(001).                       I.050330
003360         03  JOLSR141-DPC      PIC  X(002).                       I.050330
003370         03  JOLSR141-HNGP     PIC  9(006).                       I.050330
003380         03  JOLSR141-NNGP     PIC  9(006).                       I.050330
003390         03  JOLSR141-THC      PIC  9(006).                       I.050330
003400         03  JOLSR141-MHC      PIC  X(001).                       I.050330
003410         03  F                 PIC  X(001).                       I.050330
003420         03  JOLSR141-SNA      PIC  X(020).                       I.050330
003430         03  JOLSR141-TNA      PIC  X(020).                       I.050330
003440         03  JOLSR141-HCC      PIC  9(001).                       I.050330
003450         03  JOLSR141-HSP      PIC  X(001).                       I.050330
003460         03  JOLSR141-DHC      PIC  X(001).                       I.050330
003470         03  JOLSR141-KHC      PIC  X(001).                       I.050330
003480         03  JOLSR141-KCC      PIC  X(001).                       I.050330
003490         03  JOLSR141-UBC      PIC  X(001).                       I.050330
003500         03  JOLSR141-NCC      PIC  9(001).                       I.050330
003510         03  JOLSR141-EDI      PIC  9(001).                       I.050330
003520         03  JOLSR141-NKC      PIC  9(001).                       I.050330
003530         03  JOLSR141-ZAC      PIC  9(001).                       I.050330
003540         03  F                 PIC  X(157).                       I.050330
003550         03  JOLSR141-PC       PIC  9(001).                       I.050330
003560*
003570     02  JOLSR142-A        REDEFINES  JOLSR141-A.                 I.050330
003580         03  JOLSR142-KEY.                                        I.050330
003590           04  JOLSR142-STC.                                      I.050330
003600             05  F             PIC  9(002).                       I.050330
003610             05  JOLSR142-SCD  PIC  9(002).                       I.050330
003620             05  F             PIC  9(001).                       I.100922
003630             05  JOLSR142-TCD  PIC  9(004).                       I.100922
003640*****        05  F             PIC  9(002).                       D.100922
003650*****        05  JOLSR142-TCD  PIC  9(003).                       D.100922
003660           04  JOLSR142-DNO.                                      I.050330
003670             05  F             PIC  9(002).                       I.050330
003680             05  JOLSR142-DNOD PIC  9(007).                       I.050330
003690           04  JOLSR142-DGN    PIC  9(002).                       I.050330
003700         03  JOLSR142-HCD      PIC  X(013).                       I.050330
003710         03  JOLSR142-ISU      PIC  9(003)V9(01).                 I.050330
003720         03  JOLSR142-KSU      PIC  9(004).                       I.050330
003730         03  JOLSR142-HTC      PIC  X(002).                       I.050330
003740         03  JOLSR142-SU       PIC  9(005)V9(01).                 I.050330
003750         03  JOLSR142-GTN      PIC  9(007)V9(02).                 I.050330
003760         03  JOLSR142-UTN      PIC  9(007).                       I.050330
003770         03  JOLSR142-GKIN     PIC  9(010).                       I.050330
003780         03  JOLSR142-UKIN     PIC  9(010).                       I.050330
003790         03  JOLSR142-GCN      PIC  9(006).                       I.050330
003800         03  JOLSR142-CCD      PIC  X(003).                       I.050330
003810         03  JOLSR142-SHN      PIC  X(025).                       I.050330
003820         03  JOLSR142-JAN      PIC  X(013).                       I.050330
003830         03  F                 PIC  X(004).                       I.050330
003840         03  JOLSR142-TSH      PIC  9(005).                       I.050330
003850         03  JOLSR142-TKC      PIC  X(001).                       I.050330
003860         03  F                 PIC  X(001).                       I.050330
003870         03  F                 PIC  X(110).                       I.050330
003880         03  JOLSR142-PC       PIC  9(001).                       I.050330
003890     02  F                 PIC  X(083).                           I.050330
003900     02  JOLSR14-NO        PIC  9(02).                            I.050330
003910*----ÉiÉtÉRì`ï[Çe Å@Å@     ÅiãÊï™ÅÅÇPÇTÅj
003920 01  JOLSR15-REC.                                                 I.050330
003930     02  JOLSR15-01            PIC 9(02).                         I.050330
003940*
003950     02  JOLSR151-A.                                              I.050330
003960         03  JOLSR151-KEY.                                        I.050330
003970           04  JOLSR151-STC.                                      I.050330
003980             05  JOLSR151-SCD  PIC  9(002).                       I.050330
003990             05  JOLSR151-TCD  PIC  9(003).                       I.050330
004000             05  F             PIC  X(004).                       I.050330
004010           04  JOLSR151-DNO.                                      I.050330
004020             05  F             PIC  X(002).                       I.050330
004030             05  JOLSR151-DNOD PIC  9(007).                       I.050330
004040           04  JOLSR151-DGN    PIC  9(002).                       I.050330
004050         03  F                 PIC  X(002).                       I.050330
004060         03  JOLSR151-BCD      PIC  9(002).                       I.050330
004070         03  JOLSR151-DPC      PIC  9(002).                       I.050330
004080         03  JOLSR151-HNGP     PIC  9(006).                       I.050330
004090         03  JOLSR151-HNGPD REDEFINES JOLSR151-HNGP.              I.050330
004100           04  JOLSR151-HNEN   PIC  9(002).                       I.050330
004110           04  JOLSR151-HGET   PIC  9(002).                       I.050330
004120           04  JOLSR151-HPEY   PIC  9(002).                       I.050330
004130         03  JOLSR151-NNGP     PIC  9(006).                       I.050330
004140         03  JOLSR151-NNGPD REDEFINES JOLSR151-NNGP.              I.050330
004150           04  JOLSR151-NNEN   PIC  9(002).                       I.050330
004160           04  JOLSR151-NGET   PIC  9(002).                       I.050330
004170           04  JOLSR151-NPEY   PIC  9(002).                       I.050330
004180         03  JOLSR151-THC      PIC  9(006).                       I.050330
004190         03  JOLSR151-STA      PIC  X(002).                       I.050330
004200         03  JOLSR151-SNA      PIC  X(015).                       I.050330
004210         03  JOLSR151-TNA      PIC  X(015).                       I.050330
004220         03  JOLSR151-TSN      PIC  X(015).                       I.050330
004230         03  JOLSR151-TST      PIC  X(012).                       I.050330
004240         03  JOLSR151-HCC      PIC  9(001).                       I.050330
004250         03  F                 PIC  X(024).                       I.050330
004260         03  JOLSR151-AR       PIC  X(007).                       I.050330
004270         03  JOLSR151-DUR      PIC  X(026).                       I.050330
004280         03  JOLSR151-DSHR     PIC  X(014).                       I.050330
004290         03  JOLSR151-DSMR     PIC  X(007).                       I.050330
004300         03  JOLSR151-ER       PIC  X(005).                       I.050330
004310         03  JOLSR151-FSR      PIC  X(015).                       I.050330
004320         03  JOLSR151-FUR      PIC  X(007).                       I.050330
004330         03  JOLSR151-LCR      PIC  X(016).                       I.050330
004340         03  JOLSR151-LUR      PIC  X(020).                       I.050330
004350         03  JOLSR151-LSR      PIC  X(007).                       I.050330
004360         03  F                 PIC  X(001).                       I.050330
004370         03  JOLSR151-PC       PIC  9(001).                       I.050330
004380*
004390     02  JOLSR152-A        REDEFINES  JOLSR151-A.                 I.050330
004400         03  JOLSR152-KEY.                                        I.050330
004410           04  JOLSR152-STC.                                      I.050330
004420             05  JOLSR152-SCD  PIC  9(002).                       I.050330
004430             05  JOLSR152-TCD  PIC  9(003).                       I.050330
004440             05  F             PIC  X(004).                       I.050330
004450           04  JOLSR152-DNO.                                      I.050330
004460             05  F             PIC  X(002).                       I.050330
004470             05  JOLSR152-DNOD PIC  9(007).                       I.050330
004480           04  JOLSR152-DGN    PIC  9(002).                       I.050330
004490         03  JOLSR152-JAN      PIC  X(013).                       I.050330
004500         03  JOLSR152-GAR      PIC  X(006).                       I.050330
004510         03  F                 PIC  X(001).                       I.050330
004520         03  JOLSR152-TNI      PIC  X(003).                       I.050330
004530         03  JOLSR152-SU       PIC  9(005).                       I.050330
004540         03  F                 PIC  X(001).                       I.050330
004550         03  JOLSR152-GTN      PIC  9(007).                       I.050330
004560         03  F                 PIC  X(002).                       I.050330
004570         03  JOLSR152-UTN      PIC  9(007).                       I.050330
004580         03  JOLSR152-GKIN     PIC  9(010).                       I.050330
004590         03  JOLSR152-UKIN     PIC  9(010).                       I.050330
004600         03  F                 PIC  X(009).                       I.050330
004610         03  JOLSR152-SHN      PIC  X(025).                       I.050330
004620         03  JOLSR152-HSC      PIC  X(008).                       I.050330
004630         03  JOLSR152-COR      PIC  X(006).                       I.050330
004640         03  JOLSR152-SIZ      PIC  X(005).                       I.050330
004650         03  F                 PIC  X(004).                       I.050330
004660         03  JOLSR152-KKK      PIC  X(025).                       I.050330
004670         03  JOLSR152-PCH      PIC  X(001).                       I.050330
004680         03  JOLSR152-PSI      PIC  X(001).                       I.050330
004690         03  JOLSR152-PBM      PIC  9(002).                       I.050330
004700         03  JOLSR152-PJAN     PIC  X(013).                       I.050330
004710         03  JOLSR152-PSHN     PIC  X(020).                       I.050330
004720         03  JOLSR152-PKKK     PIC  X(020).                       I.050330
004730         03  JOLSR152-PUTN     PIC  9(007).                       I.050330
004740         03  JOLSR152-PMS      PIC  9(005).                       I.050330
004750         03  F                 PIC  X(017).                       I.050330
004760         03  JOLSR152-PC       PIC  9(001).                       I.050330
004770     02  F                 PIC  X(083).                           I.050330
004780     02  JOLSR15-NO        PIC  9(02).                            I.050330
004790*----ÉgÉâÉXÉRëºìùàÍì`ï[    ÅiãÊï™ÅÅÇPÇUÅj
004800 01  JOLSR16-REC.                                                 I.080331
004810     02  JOLSR16-01            PIC 9(02).                         I.080331
004820     02  JOLSR16-A.                                               I.080331
004830         03  JOLSR16-KEY.                                         I.080331
004840             04  JOLSR16-DNO   PIC  9(006).                       I.080331
004850             04  JOLSR16-GNO   PIC  9(001).                       I.080331
004860         03  JOLSR16-DATE      PIC  9(006).                       I.080331
004870         03  JOLSR16-TCD       PIC  9(004).                       I.080331
004880         03  JOLSR16-CCD       PIC  9(003).                       I.080331
004890         03  JOLSR16-TPC       PIC  9(004).                       I.100922
004900*****    03  JOLSR16-TPC       PIC  9(003).                       D.100922
004910         03  JOLSR16-HCD       PIC  9(006).                       I.080331
004920         03  JOLSR16-SIZ       PIC  X(003).                       I.080331
004930         03  JOLSR16-SKB       PIC  9(001).                       I.080331
004940         03  JOLSR16-SNO       PIC  9(002).                       I.080331
004950         03  JOLSR16-SU        PIC S9(005).                       I.080331
004960         03  JOLSR16-GT        PIC  9(007).                       I.080331
004970         03  JOLSR16-UT        PIC  9(007).                       I.080331
004980         03  JOLSR16-GKIN      PIC S9(008).                       I.080331
004990         03  JOLSR16-UKIN      PIC S9(008).                       I.080331
005000         03  JOLSR16-JNOD.                                        I.080331
005010             04  JOLSR16-JNO   PIC  9(006).                       I.080331
005020             04  JOLSR16-JGN   PIC  9(001).                       I.080331
005030         03  JOLSR16-SOK       PIC  9(001).                       I.080331
005040         03  JOLSR16-UNS       PIC  9(001).                       I.080331
005050         03  JOLSR16-ISU       PIC  9(003).                       I.080331
005060         03  JOLSR16-HNO       PIC  X(010).                       I.080331
005070         03  JOLSR16-TEKI      PIC  N(028).                       I.080331
005080         03  JOLSR16-TED   REDEFINES JOLSR16-TEKI.                I.080331
005090             04  JOLSR16-THT   PIC  N(009).                       I.080331
005100             04  JOLSR16-TTE   PIC  N(019).                       I.080331
005110         03  JOLSR16-TRN       PIC  X(020).                       I.080331
005120         03  JOLSR16-JAN       PIC  X(013).                       I.100922
005130         03  F                 PIC  X(070).                       I.100922
005140         03  JOLSR16-PRC       PIC  9(001).                       I.080331
005150         03  JOLSR16-UPC       PIC  9(001).                       I.080331
005160     02  F                 PIC  X(083).                           I.100922
005170     02  JOLSR16-NO        PIC  9(02).                            I.100922
005180*****02  F                     PIC  X(084).                       D.100922
005190*----ê‘ÇøÇ·ÇÒñ{ï‹ìùàÍì`ï[    ÅiãÊï™ÅÅÇPÇVÅj
005200 01  JOLSR17-REC.                                                 I.091222
005210     02  JOLSR17-01            PIC 9(02).                         I.091222
005220     02  JOLSR17-KEY.                                             I.091222
005230         03  JOLSR17-STC       PIC  9(007).                       I.091222
005240*****    03  JOLSR17-DNO       PIC  9(006).                       D.100922
005250         03  JOLSR17-DNO       PIC  9(007).                       I.100922
005260         03  JOLSR17-DGN       PIC  9(002).                       I.091222
005270     02  JOLSR17-JAN           PIC  X(013).                       I.091222
005280     02  JOLSR17-SU            PIC  9(006).                       I.091222
005290     02  JOLSR17-GTN           PIC  9(007).                       I.091222
005300     02  JOLSR17-UTN           PIC  9(007).                       I.091222
005310     02  JOLSR17-GKIN          PIC  9(010).                       I.091222
005320     02  JOLSR17-UKIN          PIC  9(010).                       I.091222
005330     02  JOLSR17-DPM           PIC  X(002).                       I.091222
005340     02  JOLSR17-CLS           PIC  X(003).                       I.091222
005350     02  JOLSR17-SHM           PIC  X(013).                       I.091222
005360     02  JOLSR17-MKH           PIC  X(010).                       I.091222
005370     02  JOLSR17-MSB           PIC  X(010).                       I.091222
005380     02  JOLSR17-TY            PIC  X(002).                       I.091222
005390     02  JOLSR17-HCD           PIC  9(006).                       I.091222
005400     02  JOLSR17-COR           PIC  N(004).                       I.091222
005410     02  JOLSR17-SIZ           PIC  X(004).                       I.091222
005420     02  JOLSR17-NSU           PIC  9(006).                       I.091222
005430     02  JOLSR17-TSC           PIC  9(001).                       I.091222
005440*****02  F                     PIC  X(009).                       D.100922
005450     02  F                     PIC  X(008).                       I.100922
005460     02  JOLSR17-CCD           PIC  9(003).                       I.091222
005470     02  JOLSR17-TNA           PIC  N(014).                       I.091222
005480     02  JOLSR17-HNO           PIC  9(009).                       I.091222
005490     02  JOLSR17-HNGP          PIC  9(006).                       I.091222
005500     02  JOLSR17-NNGP          PIC  9(006).                       I.091222
005510     02  JOLSR17-THC           PIC  9(006).                       I.091222
005520     02  JOLSR17-BI            PIC  X(010).                       I.091222
005530     02  JOLSR17-SNGP          PIC  9(008).                       I.091222
005540     02  JOLSR17-HNA           PIC  X(006).                       I.091222
005550     02  JOLSR17-ZON           PIC  X(004).                       I.091222
005560     02  JOLSR17-DC            PIC  9(002).                       I.091222
005570     02  F                     PIC  X(005).                       I.091222
005580     02  JOLSR17-DNGP          PIC  9(008).                       I.091222
005590     02  JOLSR17-NRC           PIC  9(001).                       I.091222
005600     02  F                     PIC  X(008).                       I.091222
005610     02  JOLSR17-PC            PIC  9(001).                       I.091222
005620     02  JOLSR17-RC            PIC  9(001).                       I.091222
005630     02  F                 PIC  X(083).                           I.100922
005640     02  JOLSR17-NO        PIC  9(02).                            I.100922
