000010***********************************************
000020*****                                     *****
000030**      出荷実績 ファイル　　　　　　　　　　**
000040*****         ( JSJD    )  256/1          *****
000050***********************************************
000060 FD  JSJD
000070     BLOCK 1 RECORDS
000080     LABEL RECORD IS STANDARD
000090     VALUE    OF  IDENTIFICATION  "JSJD1"
000100     ALTERNATE    IDENTIFICATION  "JSJD2".
000110*
000120*
000130 01  JSJD-REC.
000140     02  JSJD-KEY.
000150         03  JSJD-01        PIC 9(01).                            倉ｺｰﾄﾞ
000160         03  JSJD-02.                                             直送先
000170             04  JSJD-021   PIC 9(04).                            得意先CD
000180             04  JSJD-022   PIC 9(03).                            直送先CD
000190         03  JSJD-KEY2.
000200             04  JSJD-03    PIC 9(06).                            指図№
000210             04  JSJD-04    PIC 9(01).                            行№
000220     02  JSJD-05            PIC 9(01).                            伝区
000230     02  JSJD-06.                                                 指図日
000240*****    03  JSJD-061       PIC 9(02).                            D.980515
000250         03  JSJD-061       PIC 9(04).                            I.980515
000260         03  JSJD-061L  REDEFINES  JSJD-061.                      I.980519
000270             04  JSJD-061   PIC 9(02).                            I.980519
000280             04  JSJD-062   PIC 9(02).                            I.980519
000290         03  JSJD-062       PIC 9(02).                            　　月
000300         03  JSJD-063       PIC 9(02).                            　　日
000310     02  JSJD-06L   REDEFINES  JSJD-06.                           I.980519
000320         03  F              PIC 9(02).                            I.980519
000330         03  JSJD-06S       PIC 9(06).                            I.980519
000340     02  JSJD-07.                                                 出荷日
000350*****    03  JSJD-071       PIC 9(02).                            D.980515
000360         03  JSJD-071       PIC 9(04).                            I.980515
000370         03  JSJD-071L  REDEFINES  JSJD-071.                      I.980519
000380             04  JSJD-0711  PIC 9(02).                            I.980519
000390             04  JSJD-0712  PIC 9(02).                            I.980519
000400         03  JSJD-072       PIC 9(02).                            　　月
000410         03  JSJD-073       PIC 9(02).                            　　日
000420     02  JSJD-07L   REDEFINES  JSJD-07.                           I.980519
000430         03  F              PIC 9(02).                            I.980519
000440         03  JSJD-07S       PIC 9(06).                            I.980519
000450     02  JSJD-08.                                                 受注
000460         03  JSJD-081       PIC 9(06).                            受注№
000470         03  JSJD-082       PIC 9(01).                            行№
000480     02  JSJD-09            PIC 9(06).                            品名ｺｰﾄﾞ
000490     02  JSJD-10            PIC 9(01).                            ｻｲｽﾞ区分
000500     02  JSJD-11.                                                 出荷指図
000510         03  JSJD-111   OCCURS  10.                               ｻｲｽﾞ別数
000520             04  JSJD-1111      PIC S9(04).                       出荷数
000530         03  JSJD-112       PIC S9(05).                           I.981006
000540*****    03  JSJD-112       PIC S9(06).                           D.981006
000550     02  JSJD-12.                                                 出荷実績
000560         03  JSJD-121   OCCURS  10.                               ｻｲｽﾞ別数
000570             04  JSJD-1211      PIC S9(04).                       実績数
000580         03  JSJD-122       PIC S9(05).                           I.981006
000590*****    03  JSJD-122       PIC S9(06).                           D.981006
000600     02  JSJD-13            PIC 9(01).                            預り区分
000610     02  JSJD-14            PIC 9(01).                            運送ｺｰﾄﾞ
000620     02  JSJD-14A           PIC 9(03).                            セット数
000630     02  JSJD-14B           PIC 9(06).                            送り状№
000640     02  JSJD-14C           PIC 9(02).                            枝番
000650*****02  FILLER             PIC X(03).                            D.981006
000660*****02  FILLER             PIC X(02).                            D.980930
000670*****02  JSJD-99            PIC 9(01).                            D.980930
000680     02  JSJD-14D           PIC N(09).                            配達
000690     02  JSJD-15            PIC N(23).                            摘要
000700     02  JSJD-20            PIC X(10).                            I.981006
000710     02  JSJD-15A           PIC S9(03).                           個数
000720*****02  JSJD-18.                                                 D.980930
000730*****    03  JSJD-181       PIC 9(06).                            D.980930
000740*****    03  JSJD-182       PIC 9(01).                            D.980930
000750*****02  FILLER             PIC X(28).                            D.980515
000760*****02  FILLER             PIC X(24).                            D.980930
000770*****02  FILLER             PIC X(31).                            D.981006
000780     02  FILLER             PIC X(26).                            I.981006
000790     02  JSJD-19            PIC X(01).                            処理部署
000800     02  JSJD-158           PIC 9(01).                            印字ｻｲﾝ
000810     02  JSJD-16            PIC 9(01).                            一／般区
000820     02  JSJD-17            PIC 9(01).                            更新ｻｲﾝ
