000010 FD  JSTR                                                         º≠Ø∂ªºΩﬁ
000020     BLOCK    1     RECORDS                                       ƒ◊›
000030     LABEL    RECORD   STANDARD
000040     VALUE    OF  IDENTIFICATION  "JSTR".
000050*
000060 01  JSTR-R.
000070     02   JSTR-KEY.                                               KEY
000080          03   JSTR-01          PIC 9(6).                         º≠Ø∂ºΩﬁ
000090          03   JSTR-02          PIC 9(1).                         ∑ﬁÆ≥
000100     02   JSTR-03               PIC 9(1).                         √ﬁ›∏
000110     02   JSTR-04.                                                º≠Ø∂Àﬁ ª
000120*****     03  JSTR-041          PIC 9(2).                         D.980515
000130          03  JSTR-041          PIC 9(4).                         I.980515
000140          03  JSTR-041L  REDEFINES  JSTR-041.                     I.980515
000150              04  JSTR-0411     PIC 9(2).                         I.980515
000160              04  JSTR-0412     PIC 9(2).                         I.980515
000170          03  JSTR-042          PIC 9(2).                         ¬∑
000180          03  JSTR-043          PIC 9(2).                         À
000190     02   JSTR-04L   REDEFINES  JSTR-04.                          I.980519
000200          03  F                 PIC 9(2).                         I.980519
000210          03  JSTR-04S          PIC 9(6).                         I.980519
000220     02   JSTR-05.                                                º≠Ø∂Àﬁºﬁ
000230*****     03  JSTR-051          PIC 9(2).                         D.980515
000240          03  JSTR-051          PIC 9(4).                         I.980515
000250          03  JSTR-051L  REDEFINES  JSTR-051.                     I.980515
000260              04  JSTR-0511     PIC 9(2).                         I.980515
000270              04  JSTR-0512     PIC 9(2).                         I.980515
000280          03  JSTR-052          PIC 9(2).                         ¬∑
000290          03  JSTR-053          PIC 9(2).                         À
000300     02   JSTR-05L   REDEFINES  JSTR-05.                          I.980519
000310          03  F                 PIC 9(2).                         I.980519
000320          03  JSTR-05S          PIC 9(6).                         I.980519
000330     02   JSTR-06.                                                ¡Æ∏ø≥ CD
000340          03  JSTR-061          PIC 9(4).                         ƒ∏≤∫∞ƒﬁ
000350          03  JSTR-062          PIC 9(3).                         ¡Æ∏ NO
000360     02   JSTR-07               PIC 9(1).                         ∏◊ ∫∞ƒﬁ
000370     02   JSTR-08.                                                ºﬁ≠¡≠≥
000380          03  JSTR-081          PIC 9(6).                         ºﬁ≠¡≠≥NO
000390          03  JSTR-082          PIC 9(1).                         ∑ﬁÆ≥
000400     02   JSTR-09               PIC 9(6).                         À›∫∞ƒﬁ
000410     02   JSTR-10               PIC 9(1).                         ª≤Ωﬁ∏Ãﬁ›
000420     02   JSTR-11.                                                º≠Ø∂ªºΩﬁ
000430          03  JSTR-111    OCCURS  10.                             ª≤ΩﬁÕﬁ¬
000440              04  JSTR-1111     PIC S9(4).
000450          03  JSTR-112          PIC S9(5).                        I.981006
000460*****     03  JSTR-112          PIC S9(6).                        D.981006
000470     02   JSTR-12.                                                º≠Ø∂ºﬁ¬
000480          03  JSTR-121    OCCURS  10.                             ª≤ΩﬁÕﬁ¬
000490              04  JSTR-1211     PIC S9(4).
000500          03  JSTR-122          PIC S9(5).                        I.981006
000510*****     03  JSTR-122          PIC S9(6).                        D.981006
000520     02  JSTR-13                PIC 9(1).                         ±Ωﬁ∂ÿ KB
000530     02  JSTR-14                PIC 9(1).                         â^ëóÇbÇc
000540     02  JSTR-14A               PIC 9(3).                         ÉZÉbÉgêî
000550     02  JSTR-14B               PIC 9(6).                         ëóÇËèÛáÇ
000560     02  JSTR-14C               PIC 9(2).                         é}î‘
000570*****02  FILLER                 PIC X(3).                         D.981006
000580*****02  FILLER                 PIC X(2).                         D.980930
000590*****02  JSTR-99                PIC 9(01).                        D.980930
000600     02  JSTR-14D               PIC N(9).                         îzíB
000610     02  JSTR-15                PIC N(23).                        ìEóv
000620     02  JSTR-20                PIC X(10).                        ìEóv
000630     02  JSTR-15A               PIC S9(03).                       å¬êî
000640     02  JSTR-30                PIC 9(01).                        I.070917
000650*****02  F                      PIC X(01).                        D.070917
000660*****02  JSTR-30                PIC 9(01).                        D.040323
000670*****02  JSTR-18.                                                 D.980930
000680*****    03  JSTR-181           PIC 9(6).                         D.980930
000690*****    03  JSTR-182           PIC 9(1).                         D.980930
000700*****02  FILLER                 PIC X(28).                        D.971002
000710*****02  FILLER                 PIC X(07).                        D.981006
000720*****02  JSTR-30.                                                 D.981016
000730*****    03  JSTR-301           PIC 9(04).                        D.981016
000740*****    03  JSTR-302           PIC 9(01).                        D.981016
000750     02  JSTR-40.                                                 I.980622
000760         03  JSTR-401.                                            I.980622
000770             04  JSTR-4011      PIC X(03).                        I.980622
000780             04  JSTR-4012      PIC 9(01).                        I.980622
000790         03  JSTR-402.                                            I.980622
000800             04  JSTR-4021      PIC X(03).                        I.980622
000810             04  JSTR-4022      PIC 9(01).                        I.980622
000820             04  JSTR-4023      PIC 9(01).                        I.980622
000830*****02  FILLER                 PIC X(23).                        D.980515
000840*****02  FILLER                 PIC X(19).                        D.980622
000850*****02  FILLER                 PIC X(10).                        D.981006
000860*****02  FILLER                 PIC X(12).                        D.981016
000870     02  FILLER                 PIC X(16).                        I.981016
000880     02  JSTR-19                PIC X(01).                        A-890811
000890     02  JSTR-158               PIC 9(01).                        A-890811
000900     02  JSTR-16                PIC 9(01).                        àÍî ã≥àÁ
000910     02  JSTR-17                PIC 9(01).                        çXêVª≤›
