000010***********************************************
000020**             Ｏ／Ｌ送信ファイル（実績）　　**
000030*****         ( KOLJF   )  256/1          *****
000040***********************************************
000050 FD  KOLJF
000060     BLOCK 1 RECORDS
000070     LABEL RECORD IS STANDARD
000080     VALUE OF IDENTIFICATION "KOLJF".
000090*
000100*
000110*----出荷指示トラン        （区分＝１１）
000120 01  KOLJF11-REC.
000130     02  KOLJF11-01        PIC 9(02).                             ＲＣ区分
000140     02  KOLJF11-KEYW.                                            KEY
000150       03  KOLJF11-02      PIC 9(06).                             出荷指図
000160       03  KOLJF11-03      PIC 9(01).                             行№
000170     02  KOLJF11-04        PIC 9(01).                             伝区
000180     02  KOLJF11-05.                                              指図日
000190*****    03  KOLJF11-051   PIC 9(02).                             D.980515
000200         03  KOLJF11-051   PIC 9(04).                             I.980515
000210         03  KOLJF11-052   PIC 9(02).                             　　　月
000220         03  KOLJF11-053   PIC 9(02).                             　　　日
000230     02  KOLJF11-06.                                              出荷日
000240*****    03  KOLJF11-061   PIC 9(02).                             D.980515
000250         03  KOLJF11-061   PIC 9(04).                             I.980515
000260         03  KOLJF11-062   PIC 9(02).                             　　　月
000270         03  KOLJF11-063   PIC 9(02).                             　　　日
000280     02  KOLJF11-07.                                              直送先CD
000290         03  KOLJF11-071   PIC 9(04).                             　得ｺｰﾄﾞ
000300         03  KOLJF11-072   PIC 9(03).                             　直ｺｰﾄﾞ
000310     02  KOLJF11-08        PIC 9(01).                             倉ｺｰﾄﾞ
000320     02  KOLJF11-09.                                              受注
000330         03  KOLJF11-091   PIC 9(06).                             　受注№
000340         03  KOLJF11-092   PIC 9(01).                             　行№
000350     02  KOLJF11-10        PIC 9(06).                             品名ｺｰﾄﾞ
000360     02  KOLJF11-11        PIC 9(01).                             サイズ区
000370     02  KOLJF11-12.                                              出荷指図
000380         03  KOLJF11-121   OCCURS  10.                            ｻｲｽﾞ別出
000390             04  KOLJF11-1211      PIC S9(04).                    　出荷数
000400         03  KOLJF11-122   PIC S9(05).                            I.981006
000410*****    03  KOLJF11-122   PIC S9(06).                            D.981006
000420     02  KOLJF11-13.                                              出荷実績
000430         03  KOLJF11-131   OCCURS  10.                            ｻｲｽﾞ別実
000440             04  KOLJF11-1311      PIC S9(04).                    　実績数
000450         03  KOLJF11-132   PIC S9(05).                            I.981006
000460*****    03  KOLJF11-132   PIC S9(06).                            D.981006
000470     02  KOLJF11-14        PIC 9(01).                             預り区分
000480     02  KOLJF11-15        PIC 9(01).                             運送ｺｰﾄﾞ
000490     02  KOLJF11-15A       PIC 9(03).                             セット数
000500     02  KOLJF11-15B       PIC 9(06).                             送り状№
000510     02  KOLJF11-15C       PIC 9(02).                             行№
000520*****02  FILLER            PIC X(3).                              D.981006
000530*****02  FILLER            PIC X(2).                              D.980930
000540*****02  KOLJF11-99        PIC 9(01).                             D.980930
000550     02  KOLJF11-15D       PIC N(09).                             配達
000560     02  KOLJF11-16        PIC N(23).                             摘要
000570     02  KOLJF11-20        PIC X(10).                             I.981006
000580     02  KOLJF11-16A       PIC S9(03).                            個数
000590*****02  KOLJF11-18A.                                             D.980930
000600*****    03  KOLJF11-181   PIC 9(06).                             D.980930
000610*****    03  KOLJF11-182   PIC 9(01).                             D.980930
000620*****02  FILLER            PIC X(26).                             D.980515
000630*****02  FILLER            PIC X(22).                             D.980930
000640*****02  FILLER            PIC X(29).                             D.981006
000650     02  FILLER            PIC X(24).                             I.981006
000660     02  KOLJF11-19        PIC X(01).                             処理部署
000670     02  KOLJF11-168       PIC 9(01).                             印字ｻｲﾝ
000680     02  KOLJF11-17        PIC 9(01).                             一／教区
000690     02  KOLJF11-18        PIC 9(01).                             更新ｻｲﾝ
