000010***********************************************
000020*****　　生協出荷指図トラン               *****
000030*****         (  SSTR  )   256/1          *****
000040***********************************************
000050 FD  SSTR
000060     BLOCK    1     RECORDS
000070     LABEL    RECORD   STANDARD
000080     VALUE    OF  IDENTIFICATION  "SSTR-DB".
000090*
000100 01  SSTR-R.
000110     02   SSTR-KEY.
000120          03   SSTR-01          PIC  9(06).
000130          03   SSTR-02          PIC  9(01).
000140     02   SSTR-03               PIC  9(01).
000150     02   SSTR-04.
000160          03  SSTR-041          PIC  9(04).
000170          03  SSTR-041L  REDEFINES  SSTR-041.                     I.061107
000180              04  SSTR-0411     PIC  9(02).                       I.061107
000190              04  SSTR-0412     PIC  9(02).                       I.061107
000200          03  SSTR-042          PIC  9(02).
000210          03  SSTR-043          PIC  9(02).
000220     02   SSTR-04D  REDEFINES SSTR-04   PIC  9(08).               I.040906
000230     02   SSTR-05.
000240          03  SSTR-051          PIC  9(04).
000250          03  SSTR-052          PIC  9(02).
000260          03  SSTR-053          PIC  9(02).
000270     02   SSTR-06.
000280          03  SSTR-061          PIC  9(04).
000290          03  SSTR-062          PIC  9(03).
000300     02   SSTR-07               PIC  9(01).
000310     02   SSTR-08.
000320          03  SSTR-081          PIC  9(06).
000330          03  SSTR-082          PIC  9(01).
000340     02   SSTR-09               PIC  9(06).
000350     02   SSTR-10               PIC  9(01).
000360     02   SSTR-11.
000370       03  SSTR-111    OCCURS  10.
000380         04  SSTR-1111          PIC S9(04).
000390       03  SSTR-112             PIC S9(05).
000400     02   SSTR-12.
000410       03  SSTR-121    OCCURS  10.
000420         04  SSTR-1211          PIC S9(04).
000430       03  SSTR-122             PIC S9(05).
000440     02  SSTR-13                PIC  9(01).
000450     02  SSTR-14                PIC  9(01).
000460     02  SSTR-14A               PIC  9(03).
000470     02  SSTR-14B               PIC  9(06).
000480     02  SSTR-14C               PIC  9(02).
000490     02  SSTR-14D               PIC  N(09).
000500     02  SSTR-15                PIC  N(23).
000510     02  SSTR-20                PIC  X(10).
000520     02  SSTR-15A               PIC S9(03).
000530     02  SSTR-30                PIC  9(01).
000540     02  SSTR-40.
000550       03  SSTR-401.
000560         04  SSTR-4011          PIC  X(03).
000570         04  SSTR-4012          PIC  9(01).
000580       03  SSTR-402.
000590         04  SSTR-4021          PIC  X(03).
000600         04  SSTR-4022          PIC  9(01).
000610         04  SSTR-4023          PIC  9(01).
000620     02  SSTR-18.
000630       03  SSTR-181             PIC  9(02).
000640       03  SSTR-182             PIC  9(02).
000650       03  SSTR-183             PIC  9(03).
000660     02  F                      PIC  X(01).
000670     02  SSTR-90                PIC  9(08).
000680*****02  SSTR-19                PIC  9(01).                       D.04331
000690     02  SSTR-19                PIC  X(01).                       I.04331
000700     02  SSTR-158               PIC  9(01).
000710     02  SSTR-16                PIC  9(01).
000720     02  SSTR-17                PIC  9(01).
