000010*******************************************************
000020*****　　生　協　発　注　累　積　デ　ー　タ       *****
000030*****         (SK-HAT-R)   256/1                  *****
000040*******************************************************
000050 FD  SK-HAT-R
000060     BLOCK  1 RECORDS
000070     LABEL RECORD IS STANDARD
000080     VALUE OF IDENTIFICATION "SK-HAT-R-RDB".                      I.040407
000090*****VALUE OF IDENTIFICATION "SK-HAT-R".                          D.040407
000100 01  HATR-R.
000110     02  HATR-01        PIC  9(06).
000120     02  HATR-02        PIC  9(01).
000130     02  HATR-03.
000140       03  HATR-031     PIC  9(04).
000150       03  HATR-032     PIC  9(02).
000160       03  HATR-033     PIC  9(02).
000170     02  HATR-04.
000180       03  HATR-041     PIC  9(04).
000190       03  HATR-042     PIC  9(03).
000200     02  HATR-05        PIC  9(01).
000210     02  HATR-06        PIC  9(09).
000220     02  HATR-07        PIC  9(06).
000230     02  HATR-08        PIC  9(03).
000240     02  HATR-09.
000250       03  HATR-091     PIC  N(14).
000260       03  HATR-092     PIC  N(10).
000270     02  HATR-10.
000280       03  HATR-101     PIC  9(04).
000290       03  HATR-102     PIC  9(02).
000300       03  HATR-103     PIC  9(02).
000310     02  HATR-11        PIC S9(04).
000320     02  HATR-13        PIC  9(05).
000330     02  HATR-14        PIC  9(05).
000340     02  HATR-15        PIC  X(13).
000350     02  HATR-16        PIC  9(01).
000360     02  HATR-17        PIC  N(09).
000370     02  HATR-18.
000380       03  HATR-181     PIC  9(02).
000390       03  HATR-182     PIC  9(02).
000400       03  HATR-183     PIC  9(03).
000410     02  HATR-19        PIC  N(23).
000420     02  HATR-23        PIC  9(10).
000430     02  HATR-25.                                                 I.040407
000440       03  HATR-251     PIC  9(04).                               I.040407
000450       03  HATR-252     PIC  9(02).                               I.040407
000460       03  HATR-253     PIC  9(02).                               I.040407
000470     02  HATR-25D   REDEFINES HATR-25  PIC  9(08).                I.040906
000480     02  HATR-26        PIC  X(09).                               I.040408
000490     02  F              PIC  X(19).                               I.040408
000500*****02  F              PIC  X(28).                               D.040408
000510*****02  F              PIC  X(36).                               D.040407
000520     02  HATR-24        PIC  9(01).
000530     02  HATR-20        PIC  9(01).
000540     02  HATR-21.
000550       03  HATR-211     PIC  9(04).
000560       03  HATR-212     PIC  9(02).
000570       03  HATR-213     PIC  9(02).
000580     02  HATR-22        PIC  9(01).
000590     02  HATR-97        PIC  9(01).
000600     02  HATR-98        PIC  9(01).
000610     02  HATR-99        PIC  9(01).
