000010     OPEN INPUT  M-DATE.
000020     MOVE  "01" TO DATE-KEY.
000030 AAAAA.
000040     READ  M-DATE   WITH UNLOCK  INVALID
000050           DISPLAY ERR-DATE
000060                   ERR-BUZ
000070                   GO TO  AAAAA.
000080     CLOSE  M-DATE.
