000010***************************************************
000020*****     óöï®Å@ÇhÇmÇcÇdÇwÇdÇcÅ@É}ÉXÉ^Å[Å@    *****
000030*****     (  HIMD  256/1)                     *****
000040*****     (  HIM1  7-6  )                     *****
000050*****     (  HIM2  1-12 )                     *****
000060***************************************************
000070 FD  HI-M
000080     BLOCK  1 RECORDS
000090     LABEL RECORD IS STANDARD
000100     VALUE OF IDENTIFICATION "HIM1"                               I.010726
000110     ALTERNATE IDENTIFICATION "HIM2".                             I.010726
000120*****VALUE OF IDENTIFICATION "HIM".                               D.010726
000130 01  HI-R.
000140*    * * *   å≈íËçÄñ⁄   * * *
000150*****02  HI-KEY.                                                  D.010726
000160****** 03  HI-KEY1      PIC  9(004).                              D.010726
000170*****  03  HI-KEY2      PIC  9(002).                              D.010726
000180*****02  HI-HCD   REDEFINES HI-KEY  PIC  9(006).                  D.010726
000190     02  HI-KEY2.                                                 I.010726
000200       03  HI-MHCD      PIC  9(006).                              I.010726
000210       03  HI-MHCDD REDEFINES HI-MHCD.                            I.010801
000220         04  HI-MHCD1   PIC  9(004).                              I.010801
000230         04  HI-MHCD2   PIC  9(002).                              I.010801
000240       03  HI-HCD       PIC  9(006).                              I.010726
000250       03  HI-KEY   REDEFINES HI-HCD.                             I.010726
000260         04  HI-HCD1    PIC  9(004).                              I.010726
000270         04  HI-HCD2    PIC  9(002).                              I.010726
000280     02  HI-NAME        PIC  N(024).                              ïiñº
000290     02  HI-BC.                                                   I.950410
000300       03  HI-BCD12.                                              I.030514
000310         04  HI-BCD1    PIC  9(003).                              I.030514
000320         04  HI-BCW1 REDEFINES HI-BCD1.                           I.030514
000330           05  HI-BC1   PIC  9(002).                              I.030514
000340           05  HI-BC21  PIC  9(001).                              I.030514
000350*****  03  HI-BC1       PIC  9(002).                              D.030514
000360*****02  HI-BC1         PIC  9(002).                              D.950410
000370*****02  HI-BCR   REDEFINES HI-BC1.                               D.940622
000380*****  03  HI-CC        PIC  9(001).                              D.940622
000390*****  03  HI-NC        PIC  9(001).                              D.940622
000400*****02  HI-BCD2.                                                 D.950410
000410*****  03  HI-BC21      PIC  9(001).                              D.950410
000420*****  03  HI-BC22      PIC  9(001).                              D.950410
000430*****02  HI-BC2   REDEFINES HI-BCD2  PIC  9(002).                 D.950410
000440*****02  HI-BC3         PIC  9(002).                              D.950410
000450*****  03  HI-BCD2.                                               D.030514
000460*****    04  HI-BC21    PIC  9(001).                              D.030514
000470         04  HI-BC22    PIC  9(001).                              I.950410
000480       03  HI-BCW12 REDEFINES HI-BCD12.                           I.030514
000490         04  F          PIC  9(002).                              I.030514
000500         04  HI-BC2     PIC  9(002).                              I.030514
000510*****  03  HI-BC2   REDEFINES HI-BCD2  PIC  9(002).               D.030514
000520       03  HI-BC3       PIC  9(002).                              I.950410
000530*****02  F              PIC  X(001).                              D.010726
000540*****02  HI-SOC         PIC  9(001).                              D.990122
000550*    [   ª≤ΩﬁãÊï™ ì‡ñÛ   ]
000560*****02  HI-SCUD.                                                 D.010726
000570*****  03  HI-SC    OCCURS   4.                                   D.010726
000580*****    04  HI-UT.                                               D.010726
000590*****      05  HI-TS    PIC  9(004).                              D.941201
000600*****      05  HI-TA    PIC  9(004).                              D.941201
000610*****      05  HI-TB    PIC  9(004).                              D.941201
000620*****      05  HI-TC    PIC  9(004).                              D.941201
000630*****      05  HI-TD    PIC  9(004).                              D.941201
000640*****      05  HI-TS    PIC  9(005).                              D.010726
000650*****      05  HI-TA    PIC  9(005).                              D.010726
000660*****      05  HI-TB    PIC  9(005).                              D.010726
000670*****      05  HI-TC    PIC  9(005).                              D.010726
000680*****      05  HI-TD    PIC  9(005).                              D.010726
000690*****    04  HI-SS      PIC  9(010).                              D.010726
000700*****02  HI-SCU   REDEFINES HI-SCUD.                              D.010726
000710*****  03  HI-SC1.                                                D.010726
000720*****    04  HI-UTD1.                                             D.010726
000730*****      05  HI-U1    OCCURS   5  PIC  9(004).                  D.941201
000740*****      05  HI-U1    OCCURS   5  PIC  9(005).                  D.010726
000750*****    04  HI-UT1   REDEFINES  HI-UTD1.                         D.010726
000760*****      05  HI-TS1   PIC  9(004).                              D.941201
000770*****      05  HI-TA1   PIC  9(004).                              D.941201
000780*****      05  HI-TB1   PIC  9(004).                              D.941201
000790*****      05  HI-TC1   PIC  9(004).                              D.941201
000800*****      05  HI-TD1   PIC  9(004).                              D.941201
000810*****      05  HI-TS1   PIC  9(005).                              D.010726
000820*****      05  HI-TA1   PIC  9(005).                              D.010726
000830*****      05  HI-TB1   PIC  9(005).                              D.010726
000840*****      05  HI-TC1   PIC  9(005).                              D.010726
000850*****      05  HI-TD1   PIC  9(005).                              D.010726
000860     02  HI-ASSD.                                                 I.010726
000870       03  HI-SSD   OCCURS  4.                                    I.010726
000880         04  HI-SS      PIC  9(010).                              I.010726
000890     02  HI-ASKD  REDEFINES HI-ASSD.                              I.010726
000900       03  HI-SKD   OCCURS  4.                                    I.010726
000910         04  HI-SK    OCCURS 10.                                  I.010726
000920           05  HI-S     PIC  9(001).                              I.010726
000930     02  HI-AHSD  REDEFINES HI-ASSD.                              I.010726
000940       03  HI-HSD.                                                I.010726
000950         04  HI-SS1     PIC  9(010).                              ª≤Ωﬁ1
000960         04  HI-SD1   REDEFINES HI-SS1.
000970           05  HI-S1    OCCURS  10  PIC  9(001).
000980*****  03  HI-SC2.                                                D.010726
000990*****    04  HI-UTD2.                                             D.010726
001000*****      05  HI-U2    OCCURS   5  PIC  9(004).                  D.941201
001010*****      05  HI-U2    OCCURS   5  PIC  9(005).                  D.010726
001020*****    04  HI-UT2    REDEFINES HI-UTD2.                         D.010726
001030*****      05  HI-TS2   PIC  9(004).                              D.941201
001040*****      05  HI-TA2   PIC  9(004).                              D.941201
001050*****      05  HI-TB2   PIC  9(004).                              D.941201
001060*****      05  HI-TC2   PIC  9(004).                              D.941201
001070*****      05  HI-TD2   PIC  9(004).                              D.941201
001080*****      05  HI-TS2   PIC  9(005).                              D.010726
001090*****      05  HI-TA2   PIC  9(005).                              D.010726
001100*****      05  HI-TB2   PIC  9(005).                              D.010726
001110*****      05  HI-TC2   PIC  9(005).                              D.010726
001120*****      05  HI-TD2   PIC  9(005).                              D.010726
001130         04  HI-SS2     PIC  9(010).                              ª≤Ωﬁ2
001140         04  HI-SD2    REDEFINES HI-SS2.
001150           05  HI-S2    OCCURS  10  PIC  9(001).
001160*****  03  HI-SC3.                                                D.010726
001170*****    04  HI-UTD3.                                             D.010726
001180*****      05  HI-U3    OCCURS   5  PIC  9(004).                  D.941201
001190*****      05  HI-U3    OCCURS   5  PIC  9(005).                  D.010726
001200*****    04  HI-UT3    REDEFINES HI-UTD3.                         D.010726
001210*****      05  HI-TS3   PIC  9(004).                              D.941201
001220*****      05  HI-TA3   PIC  9(004).                              D.941201
001230*****      05  HI-TB3   PIC  9(004).                              D.941201
001240*****      05  HI-TC3   PIC  9(004).                              D.941201
001250*****      05  HI-TD3   PIC  9(004).                              D.941201
001260*****      05  HI-TS3   PIC  9(005).                              D.010726
001270*****      05  HI-TA3   PIC  9(005).                              D.010726
001280*****      05  HI-TB3   PIC  9(005).                              D.010726
001290*****      05  HI-TC3   PIC  9(005).                              D.010726
001300*****      05  HI-TD3   PIC  9(005).                              D.010726
001310         04  HI-SS3     PIC  9(010).                              ª≤Ωﬁ3
001320         04  HI-SD3    REDEFINES HI-SS3.
001330           05  HI-S3    OCCURS  10  PIC  9(001).
001340*****  03  HI-SC4.                                                D.010726
001350*****    04  HI-UTD4.                                             D.010726
001360*****      05  HI-U4    OCCURS   5  PIC  9(004).                  D.941201
001370*****      05  HI-U4    OCCURS   5  PIC  9(005).                  D.010726
001380*****    04  HI-UT4    REDEFINES HI-UTD4.                         D.010726
001390*****      05  HI-TS4   PIC  9(004).                              D.941201
001400*****      05  HI-TA4   PIC  9(004).                              D.941201
001410*****      05  HI-TB4   PIC  9(004).                              D.941201
001420*****      05  HI-TC4   PIC  9(004).                              D.941201
001430*****      05  HI-TD4   PIC  9(004).                              D.941201
001440*****      05  HI-TS4   PIC  9(005).                              D.010726
001450*****      05  HI-TA4   PIC  9(005).                              D.010726
001460*****      05  HI-TB4   PIC  9(005).                              D.010726
001470*****      05  HI-TC4   PIC  9(005).                              D.010726
001480*****      05  HI-TD4   PIC  9(005).                              D.010726
001490         04  HI-SS4     PIC  9(010).                              ª≤Ωﬁ4
001500         04  HI-SD4    REDEFINES HI-SS4.
001510           05  HI-S4    OCCURS  10  PIC  9(001).
001520*****02  HI-FT          PIC  9(004).                              D.941201
001530     02  HI-SB          PIC  9(005).                              I.010726
001540     02  HI-FT          PIC  9(005).                              I.941201
001550*    [   êªë¢å¥âø   ]
001560*****02  HI-ZRG         PIC  9(004).                              D.941201
001570*****02  HI-SKG         PIC  9(004).                              D.941201
001580*****02  HI-GKG         PIC  9(004).                              D.941201
001590*****02  HI-ZRG         PIC  9(005).                              D.090121
001600*****02  HI-SKG         PIC  9(005).                              D.090121
001610*****02  HI-GKG         PIC  9(005).                              D.090121
001620*****02  HI-KNC         PIC  9(001).                              D.010726
001630*****02  HI-KNG         PIC  9(004).                              D.090121
001640     02  F              PIC  X(019).                              I.090121
001650     02  HI-KT          PIC  9(005).                              I.990121
001660*
001670     02  HI-TCD         PIC  9(004).                              I.000622
001680     02  HI-ISU         PIC  9(003).                              I.010726
001690     02  HI-KRC         PIC  9(001).                              I.011030
001700     02  HI-SCC         PIC  9(001).                              I.011030
001710     02  HI-BMC         PIC  9(002).                              I.020314
001720     02  HI-BMNO        PIC  9(001).                              I.020425
001730     02  HI-YG          PIC  9(005).                              I.030805
001740*****02  FILLER         PIC  X(051).                              D.940627
001750*****02  FILLER         PIC  X(050).                              D.941201
001760*****02  FILLER         PIC  X(026).                              D.990121
001770*****02  FILLER         PIC  X(021).                              D.000211
001780*****02  FILLER         PIC  X(015).                              D.000523
001790*****02  FILLER         PIC  X(011).                              D.000622
001800*****02  F              PIC  X(069).                              D.011030
001810*****02  F              PIC  X(007).                              D.010726
001820*****02  F              PIC  X(068).                              D.011120
001830*****02  F              PIC  X(067).                              D.020314
001840*****02  F              PIC  X(065).                              D.020425
001850*****02  F              PIC  X(064).                              D.020729
001860*****02  F              PIC  X(063).                              D.030805
001870*****02  F              PIC  X(058).                              D.040311
001880     02  HI-HKB         PIC  9(001).                              I.040311
001890     02  HI-HPV         PIC  9(001).                              I.050416
001900     02  HI-BC4         PIC  9(001).                              I.090121
001910     02  HI-SSC         PIC  9(001).                              I.100601
001920     02  F              PIC  X(010).                              I.100601
001930*****02  F              PIC  X(011).                              D.100601
001940*****02  F              PIC  X(044).                              D.090121
001950*****02  F              PIC  X(045).                              D.050416
001960*****02  F              PIC  X(057).                              D.040331
001970*
001980     02  HI-SMS         PIC  N(016).                              I.090121
001990     02  HI-UNG         PIC  9(006).                              I.040331
002000     02  HI-NNG         PIC  9(006).                              I.040331
002010     02  HI-OL          PIC  X(001).                              I.020729
002020     02  HI-CS          PIC  N(010).                              I.000211
002030*****02  F              PIC  X(006).                              D.060524
002040     02  HI-RNG.                                                  I.060524
002050       03  F            PIC  X(005).                              I.060524
002060       03  HI-DELC      PIC  9(001).                              I.060524
002070     02  HI-DNG         PIC  9(006).                              I.000211
002080     02  HI-SNG         PIC  9(004).                              ìoò^ì˙ït
002090     02  HI-SNGD    REDEFINES HI-SNG.
002100       03  HI-SNEN      PIC  9(002).
002110       03  HI-SGET      PIC  9(002).
002120     02  HI-ENG         PIC  9(004).                              îpé~ì˙ït
002130     02  HI-ENGD    REDEFINES HI-ENG.
002140       03  HI-ENEN      PIC  9(002).
002150       03  HI-EGET      PIC  9(002).
