000010***********************************************
000020*****                                     *****
000030*****      履物 得意先 統計 マスター      *****
000040*****         (  H T M  )  170/2          *****
000050***********************************************
000060 FD  HT-M
000070     BLOCK  3 RECORDS
000080     LABEL RECORD IS STANDARD
000090     VALUE OF IDENTIFICATION "HTM".
000100 01  HT-R.
000110     02  HT-KEY.                                                  ｺｰﾄﾞ
000120       03  HT-TCD       PIC  9(004).                              得意先CD
000130*    * * *   統　計　項　目　 * * *
000140     02  HT-TD.
000150       03  HT-TZZ       PIC S9(009).                              前月残高
000160       03  HT-TZZZ      PIC S9(007).                              　消費税
000170       03  HT-TUZ       PIC S9(009).                              売掛残高
000180       03  HT-TUZZ      PIC S9(007).                              　消費税
000190       03  HT-TUA       PIC S9(009).                              売上金額
000200       03  HT-TUAZ      PIC S9(007).                              　消費税
000210       03  HT-TNB       PIC S9(008).                              値引金額
000220       03  HT-TNBZ      PIC S9(006).                              　消費税
000230       03  HT-TNK       PIC S9(009).                              入金金額
000240       03  HT-TNKZ      PIC S9(007).                              　消費税
000250       03  HT-TUG       PIC S9(009).                              売上原価
000260*    * * *   請　求　項　目　 * * *
000270     02  HT-SD.
000280       03  HT-SZZ       PIC S9(009).                              前回請求
000290       03  HT-SZZZ      PIC S9(007).                              　消費税
000300       03  HT-SUA       PIC S9(009).                              売上金額
000310       03  HT-SUAZ      PIC S9(007).                              　消費税
000320       03  HT-STS       PIC S9(007).                              調整金額
000330       03  HT-STSZ      PIC S9(005).                              　消費税
000340       03  HT-SNK       PIC S9(009).                              入金金額
000350       03  HT-SNKZ      PIC S9(007).                              　消費税
000360*    * * *   区分　コード　 * * *
000370     02  HT-TKC         PIC  9(002).                              地区
000380     02  HT-TNC         PIC  9(002).                              担当者
000390     02  HT-FKC         PIC  9(002).                              都道府県
000400     02  HT-BC          PIC  9(001).                              部門ｺｰﾄﾞ
000410     02  HT-SNG         PIC  9(004).                              請求年月
000420*****02  HT-DNO         PIC  9(003).                              D.950302
000430     02  F              PIC  X(003).                              I.950302
000440*****02  F              PIC  X(005).                              D.950224
000450*****02  F              PIC  X(008).                              D.940824
000460*****02  F              PIC X(12).                                D.930526
000470     02  HT-SP          PIC  9(002).                              I.950224
000480     02  HT-SK          PIC  9(001).                              I.950224
000490     02  F              PIC  X(002).                              I.950224
