000010*********************************************
000020*****     履物品名在庫マスター　　      *****
000030*****      ( H Z M )   128/2            *****
000040*********************************************
000050 FD  HZ-M
000060     BLOCK  2 RECORDS
000070     LABEL RECORD IS STANDARD
000080     VALUE OF IDENTIFICATION "HZM".
000090 01  HZ-R.
000100*    ----- ＫＥＹ --------------------------------------------------------
000110     02  HZ-KEYD        PIC  9(010).
000120     02  HZ-KEY   REDEFINES HZ-KEYD.
000130       03  HZ-HCD       PIC  9(006).                              品名ｺｰﾄﾞ
000140       03  HZ-HCDD  REDEFINES HZ-HCD.
000150         04  HZ-HCD1    PIC  9(004).
000160         04  HZ-HCD2    PIC  9(002).
000170       03  HZ-CS.
000180         04  HZ-SC      PIC  9(001).                              ｻｲｽﾞ区分
000190         04  HZ-SIZ     PIC  9(003).                              サイズ
000200*    ----- 分　類 --------------------------------------------------------
000210     02  HZ-BC1         PIC  9(002).                              分類CD1
000220*****02  HZ-BCD1  REDEFINES HZ-BC1.                               D.940622
000230*****  03  HZ-CC        PIC  9(001).                              D.940622
000240*****  03  HZ-NC        PIC  9(001).                              D.940622
000250     02  HZ-BC2         PIC  9(002).                              分類CD2
000260     02  HZ-BCD2  REDEFINES HZ-BC2.
000270       03  HZ-BC21      PIC  9(001).
000280       03  HZ-BC22      PIC  9(001).
000290     02  HZ-BC3         PIC  9(002).                              分類CD3
000300     02  HZ-BCD3  REDEFINES HZ-BC3.
000310       03  HZ-BC31      PIC  9(001).
000320       03  HZ-BC32      PIC  9(001).
000330*
000340     02  HZ-SOC         PIC  9(001).                              倉庫区分
000350*
000360*****02  HZ-FT          PIC  9(004).                              D.941201
000370     02  HZ-FT          PIC  9(005).                              I.941201
000380*    ----- 統計項目 ------------------------------------------------------
000390     02  HZ-TKD.
000400       03  HZ-GSU       PIC S9(006).                              在庫数
000410       03  HZ-NSU       PIC S9(006).                              入庫数
000420       03  HZ-USU       PIC S9(006).                              出荷数
000430       03  HZ-ZSU       PIC S9(006).                              前繰越数
000440*
000450*****02  F              PIC  X(013).                              D.941201
000460     02  F              PIC  X(012).                              I.941201
000470*    ----- 棚卸項目 ------------------------------------------------------
000480     02  HZ-TOD.
000490       03  HZ-TZS.                                                棚卸在庫
000500         04  HZ-TCS     PIC S9(006).                              帳簿棚
000510         04  HZ-TTS     PIC S9(006).                              実棚
000520       03  HZ-ATSB.
000530         04  HZ-TSB   OCCURS   8  PIC S9(006).
000540       03  HZ-TSS   REDEFINES HZ-ATSB.                            倉庫棚卸
000550         04  HZ-TSS1    PIC S9(006).                              本社
000560         04  HZ-TSS2    PIC S9(006).                              新岡
000570         04  HZ-TSS3    PIC S9(006).                              築港
000580         04  HZ-TSS4    PIC S9(006).                              島田
000590         04  HZ-TSS5    PIC S9(006).
000600         04  HZ-TSS6    PIC S9(006).                              藤崎
000610         04  HZ-TSS7    PIC S9(006).                              日進化成
000620         04  HZ-TSS8    PIC S9(006).                              預け
000630*
000640     02  F              PIC  X(010).
