000010***********************************************
000020*****      工品他 得意先 統計 マスター    *****
000030*****         (  K T M  )  170/2          *****
000040***********************************************
000050 FD  KT-M
000060     BLOCK  3 RECORDS
000070     LABEL RECORD IS STANDARD
000080     VALUE OF IDENTIFICATION "KTM".
000090 01  KT-R.
000100     02  KT-KEY.                                                  ｺｰﾄﾞ
000110       03  KT-TCD       PIC  9(004).                              得意先CD
000120*    * * *   統　計　項　目　 * * *
000130     02  KT-TD.
000140       03  KT-TZZ       PIC S9(009).                              前月残高
000150       03  KT-TZZZ      PIC S9(007).                              　消費税
000160       03  KT-TUZ       PIC S9(009).                              売掛残高
000170       03  KT-TUZZ      PIC S9(007).                              　消費税
000180       03  KT-TUA       PIC S9(009).                              売上金額
000190       03  KT-TUAZ      PIC S9(007).                              　消費税
000200       03  KT-TNB       PIC S9(008).                              値引金額
000210       03  KT-TNBZ      PIC S9(006).                              　消費税
000220       03  KT-TNK       PIC S9(009).                              入金金額
000230       03  KT-TNKZ      PIC S9(007).                              　消費税
000240       03  KT-TUG       PIC S9(009).                              売上原価
000250*    * * *   請　求　項　目　 * * *
000260     02  KT-SD.
000270       03  KT-SZZ       PIC S9(009).                              前回請求
000280       03  KT-SZZZ      PIC S9(007).                              　消費税
000290       03  KT-SUA       PIC S9(009).                              売上金額
000300       03  KT-SUAZ      PIC S9(007).                              　消費税
000310       03  KT-STS       PIC S9(007).                              調整金額
000320       03  KT-STSZ      PIC S9(005).                              　消費税
000330       03  KT-SNK       PIC S9(009).                              入金金額
000340       03  KT-SNKZ      PIC S9(007).                              　消費税
000350*    * * *   区分　コード　 * * *
000360     02  KT-TKC         PIC  9(002).                              地区
000370     02  KT-TNC         PIC  9(002).                              担当者
000380     02  KT-FKC         PIC  9(002).                              都道府県
000390     02  KT-BC          PIC  9(001).                              部門ｺｰﾄﾞ
000400     02  KT-SNG         PIC  9(004).                              請求年月
000410*****02  KT-DNO         PIC  9(003).                              D.950302
000420     02  F              PIC  X(003).                              I.950302
000430*****02  F              PIC  X(005).                              D.950224
000440*****02  F              PIC  X(008).                              D.940824
000450*****02  F            PIC X(12).                                  D.930526
000460     02  KT-SP          PIC  9(002).                              I.950224
000470     02  KT-SK          PIC  9(001).                              I.950224
000480     02  F              PIC  X(002).                              I.950224
