000010********************************************
000020*****    仕　入　先　マ　ス　タ　ー    *****
000030*****         (  S M  )  256/1         *****
000040********************************************
000050 FD  S-M
000060     BLOCK  1 RECORDS
000070     LABEL RECORD IS STANDARD
000080     VALUE OF IDENTIFICATION "SM".
000090 01  S-R.
000100     02  S-KEY.                                                   ＫＥＹ
000110       03  S-TCD        PIC  9(004).                              仕入先CD
000120       03  S-TCDD  REDEFINES S-TCD.
000130         04  S-TCD1     PIC  9(001).
000140         04  S-TCD2     PIC  9(003).
000150     02  S-NAME         PIC  N(024).                              仕入先名
000160     02  S-JSU          PIC  N(024).                              住所(上)
000170     02  S-JSS          PIC  N(012).                              住所(下)
000180*****02  S-UNO          PIC  X(006).                              D.960517
000190*****02  F              PIC  X(006).                              D.970127
000200*****02  S-TEL          PIC  X(012).                              D.970127
000210*****02  S-FAX          PIC  X(012).                              D.970127
000220     02  S-UNO          PIC  X(008).                              I.970127
000230     02  S-TEL          PIC  X(014).                              I.970127
000240     02  S-FAX          PIC  X(014).                              I.970127
000250     02  S-FKC          PIC  9(002).                              府県ｺｰﾄﾞ
000260     02  S-SZC          PIC  9(001).                              消費税C
000270     02  S-TTS          PIC  9(002).                              支手ｻｲﾄ
000280     02  S-THN          PIC  9(002).                              支手 日
000290     02  S-TMC          PIC  9(001).                              支手複数
000300     02  S-SKR          PIC  9(001).                              送金料C
000310*****02  F              PIC  X(102).                              D.950524
000320*****02  F              PIC  X(090).                              D.960517
000330*****02  S-UNO          PIC  X(008).                              D.970127
000340*****02  F              PIC  X(082).                              D.970127
000350     02  F              PIC  X(084).                              I.970127
000360     02  S-KKC          PIC  9(001).                              買掛区分
000370     02  S-SFC          PIC  9(001).                              振込区分
000380     02  S-TGC          PIC  9(001).                              手形区分
