000010***********************************************
000020*****     得　意　先   マ　ス　タ　ー     *****
000030*****     ( TM1 , TM2 , TMD )  512/1      *****
000040***********************************************
000050 FD  T-M
000060     BLOCK  1 RECORDS
000070     LABEL RECORD IS STANDARD
000080     VALUE OF IDENTIFICATION "TM1"                                I.000217
000090     ALTERNATE IDENTIFICATION "TM2".                              I.000217
000100*****VALUE OF IDENTIFICATION "TM".                                D.000217
000110 01  T-R.
000120     02  T-KEY2.                                                  I.000217
000130       03  T-NTCD       PIC  9(004).                              I.000217
000140       03  T-KEY.                                                 I.000217
000150         04  T-TCD      PIC  9(004).                              I.000217
000160     02  T-NAME         PIC  N(026).                              I.020308
000170     02  T-JSU          PIC  N(020).                              I.020308
000180     02  T-JSS          PIC  N(020).                              I.020308
000190*****02  T-KEY.                                                   D.000217
000200*****  03  T-TCD        PIC  9(004).                              D.000217
000210*****02  T-NAME         PIC  N(024).                              D.020308
000220*****02  T-JSU          PIC  N(024).                              D.020308
000230*****02  T-JSS          PIC  N(012).                              D.020308
000240*****02  T-UNO          PIC  X(006).                              D.970122
000250*****02  T-TEL          PIC  X(012).                              D.970122
000260*****02  T-FAX          PIC  X(012).                              D.970122
000270     02  T-UNO          PIC  X(008).                              I.970122
000280     02  T-TEL          PIC  X(014).                              I.970122
000290     02  T-FAX          PIC  X(014).                              I.970122
000300     02  T-FKC          PIC  9(002).                              都道府県
000310     02  T-BC           PIC  9(001).                              部門ｺｰﾄﾞ
000320     02  F              PIC  9(002).                              I.050303
000330*****02  T-TKC          PIC  9(002).                              D.050303
000340     02  T-TNC          PIC  9(002).                              担当者
000350     02  T-TNCD  REDEFINES T-TNC.                                 I.010219
000360       03  T-TNC1       PIC  9(001).                              I.010219
000370       03  T-TNC2       PIC  9(001).                              I.010219
000380*****02  T-KL           PIC  9(001).                              D.020308
000390     02  T-SS           PIC  9(002).                              請求締日
000400*****02  T-PC           PIC  9(002).                              D.020308
000410*****02  T-HIK          PIC  9(001).                              発送№PR
000420*****02  F              PIC  X(001).                              D.970122
000430     02  T-NKY          PIC  9(003).                              入金ｻｲﾄ
000440     02  T-DCC          PIC  9(001).                              I.010219
000450*****02  F              PIC  X(002).                              D.020308
000460*****02  T-DNO          PIC  9(003).                              D.010219
000470     02  T-TGC          PIC  9(001).                              手形区分
000480     02  T-YG           PIC  9(006).                              与信限度
000490     02  T-BIK          PIC  9(001).                              I.981007
000500     02  T-ZEI          PIC  9(001).                              I.040308
000510     02  F              PIC  X(009).                              I.040308
000520*****02  F              PIC  X(010).                              D.040308
000530*****02  T-WNK          PIC  9(001).                              D.000217
000540*****02  F              PIC  X(008).                              D.000217
000550*****02  F              PIC  X(009).                              D.991129
000560*****02  F              PIC  X(010).                              D.981007
000570     02  T-TNA          PIC  N(016).                              得意先名
000580     02  T-SNA          PIC  N(026).                              I.020308
000590     02  T-SJSU         PIC  N(020).                              I.020308
000600     02  T-SJSS         PIC  N(020).                              I.020308
000610*****02  T-SNA          PIC  N(024).                              D.020308
000620*****02  T-SJSU         PIC  N(024).                              D.020308
000630*****02  T-SJSS         PIC  N(012).                              D.020308
000640*****02  T-SUNO         PIC  X(006).                              D.970122
000650*****02  T-STEL         PIC  X(012).                              D.970122
000660*****02  T-SFAX         PIC  X(012).                              D.970122
000670*****02  F              PIC  X(132).                              D.970122
000680     02  T-SUNO         PIC  X(008).                              I.970122
000690     02  T-STEL         PIC  X(014).                              I.970122
000700     02  T-SFAX         PIC  X(014).                              I.970122
000710*    取引条件
000720     02  T-SHD          PIC  9(002).                              I.990915
000730     02  T-SSI          PIC  9(003).                              I.990915
000740     02  T-SHC1         PIC  9(001).                              I.990915
000750     02  T-SHC2         PIC  9(001).                              I.990915
000760     02  T-SGT          PIC  9(001).                              I.990915
000770     02  T-SGR          PIC  9(001)V9(01).                        I.990915
000780     02  T-STT          PIC  9(001).                              I.990915
000790     02  T-STR          PIC  9(001)V9(01).                        I.990915
000800     02  T-SKR          PIC  9(004).                              I.990915
000810     02  T-SKC          PIC  9(001).                              I.100421
000820*****02  F              PIC  9(001).                              D.100421
000830*****02  T-IHC          PIC  9(001).                              D.040323
000840     02  T-KSC          PIC  9(001).                              I.020914
000850     02  T-SSC          PIC  9(001).                              I.030618
000850     02  T-UTC1         PIC  9(001).                              I.100427
000850     02  T-UTK1         PIC  9(004).                              I.100427
000850     02  T-UTC2         PIC  9(001).                              I.100427
000850     02  T-UTK2         PIC  9(004).                              I.100427
000860*
000870*****02  F              PIC  X(121).                              D.980217
000880*****02  F              PIC  X(117).                              D.990915
000890*****02  F              PIC  X(100).                              D.000211
000900*****02  T-ONG          PIC  9(004).                              D.000211
000910*****02  F              PIC  X(098).                              D.000217
000920*****02  F              PIC  X(057).                              D.020308
000930*****02  F              PIC  X(038).                              D.020626
000940*****02  F              PIC  X(037).                              D.020914
000950*****02  F              PIC  X(036).                              D.030613
000960*****02  F              PIC  X(035).                              D.100427
000960     02  F              PIC  X(025).                              D.100427
000970     02  T-KANA         PIC  X(036).                              I.000217
000980     02  T-DNG          PIC  9(006).                              I.000211
000990     02  T-SNG          PIC  9(004).                              開始年月
001000     02  T-ENG          PIC  9(004).                              停止年月
