000010****************************************************
000020*         îrëºêßå‰ÉtÉ@ÉCÉãÅ@Å@IS   16/16           *
000030****************************************************
000040 FD  JDCON
000050     BLOCK    16    RECORDS
000060     LABEL    RECORD   STANDARD
000070     VALUE    OF  IDENTIFICATION  "JDCON".
000080*
000090 01  JDCON-R.
000100     02   JDCON-KEY.
000110          03   JDCON-01            PIC 9(1).                      ID
000120          03   JDCON-02            PIC 9(06).                     ì`ï[áÇ
000130     02   FILLER                   PIC X(09).
