000010*
000020***  éÛíçÉ}ÉXÉ^  ÅiÇjÇdÇxÇRÅj
000030*
000040 FD  JMST3                                                        º≠¡≠≥
000050     BLOCK    3     RECORDS                                       œΩ¿∞
000060     LABEL    RECORD   STANDARD
000070     VALUE    OF  IDENTIFICATION  "JMST3".
000080*
000090 01  JMST3-R.
000100     02   JMST3-01                  PIC 9(1).                     ±Ωﬁ∂ÿ
000110     02   JMST3-02.                                               ºﬁ≠¡≠≥Àﬁ
000120*****     03   JMST3-021            PIC 9(2).                     D.980515
000130          03   JMST3-021            PIC 9(4).                     I.980515
000140          03   JMST3-021L   REDEFINES  JMST3-021.                 I.980515
000150               04   JMST3-0211      PIC 9(2).                     I.980515
000160               04   JMST3-0212      PIC 9(2).                     I.980515
000170          03   JMST3-022            PIC 9(2).                     ¬∑
000180          03   JMST3-023            PIC 9(2).                     À
000190     02   JMST3-02L    REDEFINES  JMST3-02.                       I.980515
000200          03   F                    PIC 9(2).                     I.980515
000210          03   JMST3-02S            PIC 9(6).                     I.980515
000220     02   JMST3-KEY.
000230          03   JMST3-03             PIC 9(6).                     À›∫∞ƒﬁ
000240          03   JMST3-04             PIC 9(4).                     ƒ∏≤∫∞ƒﬁ
000250          03   JMST3-05             PIC 9(6).                     À›∫∞ƒﬁ
000260          03   JMST3-06.                                          …≥∑
000270*****          04   JMST3-061       PIC 9(2).                     D.980515
000280               04   JMST3-061       PIC 9(4).                     I.980515
000290               04   JMST3-062       PIC 9(2).                     ¬∑
000300               04   JMST3-063       PIC 9(2).                     À
000310          03   JMST3-06L    REDEFINES  JMST3-06.                  I.980515
000320               04   F               PIC 9(2).                     I.980515
000330               04   JMST3-06S       PIC 9(6).                     I.980515
000340          03   JMST3-07             PIC 9(6).                     ºﬁ≠¡≠≥NO
000350          03   JMST3-08             PIC 9(1).                     ∑ﬁÆ≥ NO
000360     02   JMST3-09                  PIC 9(1).                     ª≤Ωﬁ∏Ãﬁ›
000370     02   JMST3-10                  PIC 9(3).                     ¡Æ∏ø≥ NO
000380     02   JMST3-11.                                               ºﬁ≠¡≠≥Ω≥
000390          03  JMST3-111            OCCURS  10.                    ª≤ΩﬁÕﬁ¬
000400              04  JMST3-1111       PIC S9(6)   COMP-3.
000410     02   JMST3-12.                                               º≠Ø∫Ω≥
000420          03  JMST3-121            OCCURS  10.                    ª≤ΩﬁÕﬁ¬
000430              04  JMST3-1211       PIC S9(6)   COMP-3.
000440     02   JMST3-14.                                               æﬁ›πﬁ¬œ¬
000450          03  JMST3-141  OCCURS 10 PIC S9(06)  COMP-3.            ª≤ΩﬁÕﬁ¬
000460     02   JMST3-15.                                               º≠Ø∂ªºΩﬁ
000470          03  JMST3-151  OCCURS 10 PIC S9(06)  COMP-3.            ª≤ΩﬁÕﬁ¬
000480     02   JMST3-16                 PIC S9(03).                    æØƒΩ≥
000490     02   JMST3-23                 PIC 9(04).                     I.100921
000500     02   F                        PIC X(08).                     I.100921
000510*****02   JMST3-23                 PIC 9(03).                     D.100921
000520*****02   F                        PIC X(09).                     D.100921
000530*****02   F                        PIC X(12).                     D.080602
000540*****02   JMST3-17                 PIC 9(04).                     D.941223
000550*****02   F                        PIC X(04).                     D.981027
000560*****02   JMST3-18                 PIC 9(01).                     D.981027
000570*****02   F                        PIC X(07).                     D.981027
000580*****02   JMST3-19.                                               D.980930
000590*****    03   JMST3-191            PIC 9(06).                     D.980930
000600*****    03   JMST3-192            PIC 9(01).                     D.980930
000610     02   JMST3-20                 PIC 9(03).                     Õ›∫≥NO.
000620     02   JMST3-13                 PIC N(32).                     √∑÷≥
000630     02   JMST3-21                 PIC 9(01).                     äÆóπãÊï™
000640     02   JMST3-17                 PIC 9(05).                     I.941223
000650     02   JMST3-22                 PIC X(10).                     I.980604
000660     02   JMST3-51                 PIC 9(03).                     I.040601
000670*****02   FILLER                   PIC X(58).                     D.941005
000680*****02   FILLER                   PIC X(55).                     D.941223
000690*****02   FILLER                   PIC X(50).                     D.980515
000700*****02   FILLER                   PIC X(46).                     D.980604
000710*****02   FILLER                   PIC X(36).                     D.981125
000720*****02   FILLER                   PIC X(27).                     D.040601
000730     02   FILLER                   PIC X(24).                     I.040601
000740     02   JMST3-89.                                               I.981125
000750          03  JMST3-891            PIC 9(08).                     I.981125
000760          03  JMST3-892            PIC 9(01).                     I.981125
000770     02   JMST3-90                 PIC 9(01).                     ã≥àÁàÍî 
000780     02   JMST3-91                 PIC 9(02).                     íSìñãÊï™
