000010*
000020***  éÛíçÉ}ÉXÉ^  ÅiÇjÇdÇxÇPÅj
000030*
000040 FD  JMST1                                                        º≠¡≠≥
000050     BLOCK    3     RECORDS                                       œΩ¿∞
000060     LABEL    RECORD   STANDARD
000070     VALUE    OF  IDENTIFICATION  "JMST1".
000080*
000090 01  JMST1-R.
000100     02   JMST1-01                  PIC 9(1).                     ±Ωﬁ∂ÿ
000110     02   JMST1-02.                                               ºﬁ≠¡≠≥Àﬁ
000120*****     03   JMST1-021            PIC 9(2).                     D.980515
000130          03   JMST1-021            PIC 9(4).                     I.980515
000140          03   JMST1-021L   REDEFINES  JMST1-021.                 I.980526
000150               04  JMST1-0211       PIC 9(2).                     I.980526
000160               04  JMST1-0212       PIC 9(2).                     I.980526
000170          03   JMST1-022            PIC 9(2).                     ¬∑
000180          03   JMST1-023            PIC 9(2).                     À
000190     02   JMST1-02L   REDEFINES  JMST1-02.                        I.980526
000200          03   F                    PIC 9(2).                     I.980526
000210          03   JMST1-02S            PIC 9(6).                     I.980526
000220     02   JMST1-03                  PIC 9(6).                     À›∫∞ƒﬁ
000230     02   JMST1-04                  PIC 9(4).                     ƒ∏≤∫∞ƒﬁ
000240     02   JMST1-05                  PIC 9(6).                     À›∫∞ƒﬁ
000250     02   JMST1-06.                                               …≥∑
000260*****     03   JMST1-061            PIC 9(2).                     D.980515
000270          03   JMST1-061            PIC 9(4).                     I.980515
000280          03   JMST1-062            PIC 9(2).                     ¬∑
000290          03   JMST1-063            PIC 9(2).                     À
000300     02   JMST1-06L   REDEFINES  JMST1-06.                        I.980526
000310          03   F                    PIC 9(2).                     I.980526
000320          03   JMST1-06S            PIC 9(6).                     I.980526
000330     02   JMST1-KEY1.
000340          03   JMST1-07             PIC 9(6).                     ºﬁ≠¡≠≥NO
000350          03   JMST1-08             PIC 9(1).                     ∑ﬁÆ≥ NO
000360     02   JMST1-09                  PIC 9(1).                     ª≤Ωﬁ∏Ãﬁ›
000370     02   JMST1-10                  PIC 9(3).                     ¡Æ∏ø≥ NO
000380     02   JMST1-11.                                               ºﬁ≠¡≠≥Ω≥
000390          03  JMST1-111            OCCURS  10.                    ª≤ΩﬁÕﬁ¬
000400              04  JMST1-1111       PIC S9(6)   COMP-3.
000410     02   JMST1-12.                                               º≠Ø∫Ω≥
000420          03  JMST1-121            OCCURS  10.                    ª≤ΩﬁÕﬁ¬
000430              04  JMST1-1211       PIC S9(6)   COMP-3.
000440     02   JMST1-14.                                               æﬁ›πﬁ¬œ¬
000450          03  JMST1-141  OCCURS 10 PIC S9(06)  COMP-3.            ª≤ΩﬁÕﬁ¬
000460     02   JMST1-15.                                               º≠Ø∂ªºΩﬁ
000470          03  JMST1-151  OCCURS 10 PIC S9(06)  COMP-3.            ª≤ΩﬁÕﬁ¬
000480     02   JMST1-16                 PIC S9(03).                    æØƒΩ≥
000490     02   JMST1-23                 PIC 9(04).                     I.100921
000500     02   F                        PIC X(08).                     I.100921
000510*****02   JMST1-23                 PIC 9(03).                     D.100921
000520*****02   F                        PIC X(09).                     D.100921
000530*****02   F                        PIC X(12).                     D.080602
000540*****02   JMST1-17                 PIC 9(04).                     D.941223
000550*****02   F                        PIC X(04).                     D.981027
000560*****02   JMST1-18                 PIC 9(01).                     D.981027
000570*****02   F                        PIC X(07).                     D.981027
000580*****02   JMST1-19.                                               D.980930
000590*****    03   JMST1-191            PIC 9(06).                     D.980930
000600*****    03   JMST1-192            PIC 9(01).                     D.980930
000610     02   JMST1-20                 PIC 9(03).                     Õ›∫≥NO.
000620     02   JMST1-13                 PIC N(32).                     √∑÷≥
000630     02   JMST1-21                 PIC 9(01).                     äÆóπãÊï™
000640     02   JMST1-17                 PIC 9(05).                     I.941223
000650     02   JMST1-22                 PIC X(10).                     I.980604
000660     02   JMST1-51                 PIC 9(03).                     I.040601
000670*****02   FILLER                   PIC X(58).                     D.941005
000680*****02   FILLER                   PIC X(55).                     D.941223
000690*****02   FILLER                   PIC X(50).                     D.980515
000700*****02   FILLER                   PIC X(46).                     D.980604
000710*****02   FILLER                   PIC X(36).                     D.981127
000720*****02   FILLER                   PIC X(27).                     D.040601
000730     02   FILLER                   PIC X(24).                     I.040601
000740     02   JMST1-89.                                               I.981127
000750          03  JMST1-891            PIC 9(08).                     I.981127
000760          03  JMST1-892            PIC 9(01).                     I.981127
000770     02   JMST1-90                 PIC 9(01).                     ã≥àÁàÍî 
000780     02   JMST1-91                 PIC 9(02).                     íSìñãÊï™
