000010********************************
000020*****  入庫予定残ファイル  *****
000030*****       85/3  IS       *****
000040********************************
000050 FD  JNYZ
000060     BLOCK    3     RECORDS
000070     LABEL    RECORD   STANDARD
000080     VALUE    OF  IDENTIFICATION  "JNYZ".
000090*
000100 01  JNYZ-R.
000110     02   JNYZ-KEY.                                               KEY
000120          03    JNYZ-01     PIC 9(6).                             ﾋﾝｺｰﾄﾞ
000130          03    JNYZ-02     PIC 9(1).                             ｻｲｽﾞｸﾌﾞﾝ
000140     02   JNYZ-03.                                                ｲﾘﾖﾃｲｻﾞﾝ
000150          03  JNYZ-031      OCCURS  10.                           ｻｲｽﾞﾍﾞﾂ
000160              04  JNYZ-0311    PIC S9(6).
000170     02   F                 PIC X(16).
000180     02   JNYZ-99           PIC 9(2).                             ﾂｷ
