000010***********************************************
000020*****                                     *****
000030**             Ｏ／Ｌ受信ファイル　　　　　　**
000040*****         ( JOLJF   )  256/1          *****
000050***********************************************
000060 FD  JOLJF
000070     BLOCK 1 RECORDS
000080     LABEL RECORD IS STANDARD
000090     VALUE OF IDENTIFICATION "JOLJF".
000100*
000110*
000120*----出荷指示トラン        （区分＝１１）
000130 01  JOLJF11-REC.
000140     02  JOLJF11-01        PIC 9(02).                             ＲＣ区分
000150     02  JOLJF11-KEYW.
000160       03  JOLJF11-02      PIC 9(06).                                ｼｭｯｶｼ
000170       03  JOLJF11-03      PIC 9(01).                                ｷﾞｮｳ
000180     02  JOLJF11-04        PIC 9(01).                                ﾃﾞﾝｸ
000190     02  JOLJF11-05.                                                 ｼｭｯｶﾋ
000200*****    03  JOLJF11-051   PIC 9(02).                             D.980515
000210         03  JOLJF11-051   PIC 9(04).                             I.980515
000220         03  JOLJF11-052   PIC 9(02).                                ﾂｷ
000230         03  JOLJF11-053   PIC 9(02).                                ﾋ
000240     02  JOLJF11-06.                                                 ｼｭｯｶﾋ
000250*****    03  JOLJF11-061   PIC 9(02).                             D.980515
000260         03  JOLJF11-061   PIC 9(04).                             I.980515
000270         03  JOLJF11-062   PIC 9(02).                                ﾂｷ
000280         03  JOLJF11-063   PIC 9(02).                                ﾋ
000290     02  JOLJF11-07.                                                 ﾁｮｸｿｳ
000300         03  JOLJF11-071   PIC 9(04).                                ﾄｸｲｺｰ
000310         03  JOLJF11-072   PIC 9(03).                                ﾁｮｸ N
000320     02  JOLJF11-08        PIC 9(01).                                ｸﾗ ｺｰ
000330     02  JOLJF11-09.                                                 ｼﾞｭﾁｭ
000340         03  JOLJF11-091   PIC 9(06).                                ｼﾞｭﾁｭ
000350         03  JOLJF11-092   PIC 9(01).                                ｷﾞｮｳ
000360     02  JOLJF11-10        PIC 9(06).                                ﾋﾝｺｰﾄ
000370     02  JOLJF11-11        PIC 9(01).                                ｻｲｽﾞｸ
000380     02  JOLJF11-12.                                                 ｼｭｯｶｻ
000390         03  JOLJF11-121   OCCURS  10.                               ｻｲｽﾞﾍ
000400             04  JOLJF11-1211      PIC S9(04).
000410         03  JOLJF11-122   PIC S9(05).                            I.981006
000420*****    03  JOLJF11-122   PIC S9(06).                            D.981006
000430     02  JOLJF11-13.                                                 ｼｭｯｶｼ
000440         03  JOLJF11-131   OCCURS  10.                               ｻｲｽﾞﾍ
000450             04  JOLJF11-1311      PIC S9(04).
000460         03  JOLJF11-132   PIC S9(05).                            I.981006
000470*****    03  JOLJF11-132   PIC S9(06).                            D.981006
000480     02  JOLJF11-14        PIC 9(01).                                ｱｽﾞｶﾘ
000490     02  JOLJF11-15        PIC 9(01).                                運送 
000500     02  JOLJF11-15A       PIC 9(03).                                セッ 
000510     02  JOLJF11-15B       PIC 9(06).                                送り 
000520     02  JOLJF11-15C       PIC 9(02).                                枝番
000530*****02  FILLER            PIC X(3).                              D.981006
000540*****02  FILLER            PIC X(2).                              D.980930
000550*****02  JOLJF11-99        PIC 9(01).                             D.980930
000560     02  JOLJF11-15D       PIC N(09).                                配達
000570     02  JOLJF11-16        PIC N(23).                             摘要
000580     02  JOLJF11-20        PIC X(10).                             I.981006
000590     02  JOLJF11-16A       PIC S9(03).                            個数
000600*****02  JOLJF11-18A.                                             D.980930
000610*****    03  JOLJF11-181   PIC 9(06).                             D.980930
000620*****    03  JOLJF11-182   PIC 9(01).                             D.980930
000630*****02  FILLER            PIC X(26).                             D.980515
000640*****02  FILLER            PIC X(22).                             D.980930
000650*****02  FILLER            PIC X(29).                             D.981006
000660     02  FILLER            PIC X(24).                             I.981006
000670     02  JOLJF11-19        PIC X(01).                             処理部署
000680     02  JOLJF11-168       PIC 9(01).                                A-890
000690     02  JOLJF11-17        PIC 9(01).                             一般 
000700     02  JOLJF11-18        PIC 9(01).                             更新ｻ
