000010***********************************************
000020*****                                     *****
000030**             ÇnÅ^ÇkéÛêMÉgÉâÉì              **
000040*****         ( JOLJT   )  256/1          *****
000050***********************************************
000060 FD  JOLJT
000070     BLOCK 1 RECORDS
000080     LABEL RECORD IS STANDARD
000090     VALUE OF IDENTIFICATION "JOLJT".
000100*
000110*
000120*----èoâ◊éwé¶ÉgÉâÉì        ÅiãÊï™ÅÅÇPÇPÅj
000130 01  JOLJT11-REC.
000140     02  JOLJT11-01        PIC 9(02).                             ÇqÇbãÊï™
000150     02  JOLJT11-KEYW.
000160       03  JOLJT11-02      PIC 9(06).                                º≠Ø∂º
000170       03  JOLJT11-03      PIC 9(01).                                ∑ﬁÆ≥
000180     02  JOLJT11-04        PIC 9(01).                                √ﬁ›∏
000190     02  JOLJT11-05.                                                 º≠Ø∂À
000200*****    03  JOLJT11-051   PIC 9(02).                             D.980515
000210         03  JOLJT11-051   PIC 9(04).                             I.980515
000220         03  JOLJT11-052   PIC 9(02).                                ¬∑
000230         03  JOLJT11-053   PIC 9(02).                                À
000240     02  JOLJT11-06.                                                 º≠Ø∂À
000250*****    03  JOLJT11-061   PIC 9(02).                             D.980515
000260         03  JOLJT11-061   PIC 9(04).                             I.980515
000270         03  JOLJT11-062   PIC 9(02).                                ¬∑
000280         03  JOLJT11-063   PIC 9(02).                                À
000290     02  JOLJT11-07.                                                 ¡Æ∏ø≥
000300         03  JOLJT11-071   PIC 9(04).                                ƒ∏≤∫∞
000310         03  JOLJT11-072   PIC 9(03).                                ¡Æ∏ N
000320     02  JOLJT11-08        PIC 9(01).                                ∏◊ ∫∞
000330     02  JOLJT11-09.                                                 ºﬁ≠¡≠
000340         03  JOLJT11-091   PIC 9(06).                                ºﬁ≠¡≠
000350         03  JOLJT11-092   PIC 9(01).                                ∑ﬁÆ≥
000360     02  JOLJT11-10        PIC 9(06).                                À›∫∞ƒ
000370     02  JOLJT11-11        PIC 9(01).                                ª≤Ωﬁ∏
000380     02  JOLJT11-12.                                                 º≠Ø∂ª
000390         03  JOLJT11-121   OCCURS  10.                               ª≤ΩﬁÕ
000400             04  JOLJT11-1211      PIC  9(04).
000410             04  JOLJT11-1211S     PIC  9(01).                    0:+,1:-
000420         03  JOLJT11-122   PIC  9(05).                            I.981006
000430         03  JOLJT11-122S  PIC  9(01).                            0:+,1:-
000440*****    03  JOLJT11-122   PIC S9(06).                            D.981006
000450     02  JOLJT11-13.                                                 º≠Ø∂º
000460         03  JOLJT11-131   OCCURS  10.                               ª≤ΩﬁÕ
000470             04  JOLJT11-1311      PIC  9(04).
000480             04  JOLJT11-1311S     PIC  9(01).                    0:+,1:-
000490         03  JOLJT11-132   PIC  9(05).                            I.981006
000500         03  JOLJT11-132S  PIC  9(01).                            0:+,1:-
000510*****    03  JOLJT11-132   PIC S9(06).                            D.981006
000520     02  JOLJT11-14        PIC 9(01).                                ±Ωﬁ∂ÿ
000530     02  JOLJT11-15        PIC 9(01).                                â^ëó 
000540     02  JOLJT11-15A       PIC 9(03).                                ÉZÉb 
000550     02  JOLJT11-15B       PIC 9(06).                                ëóÇË 
000560     02  JOLJT11-15C       PIC 9(02).                                é}î‘
000570*****02  FILLER            PIC X(3).                              D.981006
000580*****02  FILLER            PIC X(2).                              D.980930
000590*****02  JOLJT11-99        PIC 9(01).                             D.980930
000600     02  JOLJT11-15D       PIC N(09).                                îzíB
000610     02  JOLJT11-16        PIC N(23).                             ìEóv
000620     02  JOLJT11-20        PIC X(10).                             I.981006
000630     02  JOLJT11-16A       PIC  9(03).                            å¬êî
000640     02  JOLJT11-16AS      PIC  9(01).                            0:+,1:-
000650*****02  JOLJT11-18A.                                             D.980930
000660*****    03  JOLJT11-181   PIC 9(06).                             D.980930
000670*****    03  JOLJT11-182   PIC 9(01).                             D.980930
000680*****02  FILLER            PIC X(26).                             D.980515
000690*****02  FILLER            PIC X(22).                             D.980930
000700*****02  FILLER            PIC X(29).                             D.981006
000710     02  FILLER            PIC X(01).                             I.981006
000720     02  JOLJT11-19        PIC X(01).                             èàóùïîèê
000730     02  JOLJT11-168       PIC 9(01).                                A-890
000740     02  JOLJT11-17        PIC 9(01).                             àÍî  
000750     02  JOLJT11-18        PIC 9(01).                             çXêVª
