000010 FD  JSTRRF                                                       º≠Ø∂ªºΩﬁ
000020     BLOCK    1     RECORDS                                       ƒ◊›
000030     LABEL    RECORD   STANDARD
000040     VALUE    OF  IDENTIFICATION  "JSTRRF".
000050*
000060 01  JSTRR-R.
000070     02   JSTRR-KEY.                                              KEY
000080          03   JSTRR-01         PIC 9(6).                         º≠Ø∂ºΩﬁ
000090          03   JSTRR-02         PIC 9(1).                         ∑ﬁÆ≥
000100     02   JSTRR-03              PIC 9(1).                         √ﬁ›∏
000110     02   JSTRR-04.                                               º≠Ø∂Àﬁ ª
000120*****     03  JSTRR-041         PIC 9(2).                         D.980521
000130          03  JSTRR-041         PIC 9(4).                         I.980521
000140          03  JSTRR-042         PIC 9(2).                         ¬∑
000150          03  JSTRR-043         PIC 9(2).                         À
000160     02   JSTRR-05.                                               º≠Ø∂Àﬁºﬁ
000170*****     03  JSTRR-051         PIC 9(2).                         D.980521
000180          03  JSTRR-051         PIC 9(4).                         I.980521
000190          03  JSTRR-052         PIC 9(2).                         ¬∑
000200          03  JSTRR-053         PIC 9(2).                         À
000210     02   JSTRR-05L   REDEFINES  JSTRR-05.                        I.980528
000220          03  F                 PIC 9(2).                         I.980528
000230          03  JSTRR-05S         PIC 9(6).                         I.980528
000240     02   JSTRR-06.                                               ¡Æ∏ø≥ CD
000250          03  JSTRR-061         PIC 9(4).                         ƒ∏≤∫∞ƒﬁ
000260          03  JSTRR-062         PIC 9(3).                         ¡Æ∏ NO
000270     02   JSTRR-07              PIC 9(1).                         ∏◊ ∫∞ƒﬁ
000280     02   JSTRR-08.                                               ºﬁ≠¡≠≥
000290          03  JSTRR-081         PIC 9(6).                         ºﬁ≠¡≠≥NO
000300          03  JSTRR-082         PIC 9(1).                         ∑ﬁÆ≥
000310     02   JSTRR-09              PIC 9(6).                         À›∫∞ƒﬁ
000320     02   JSTRR-10              PIC 9(1).                         ª≤Ωﬁ∏Ãﬁ›
000330     02   JSTRR-11.                                               º≠Ø∂ªºΩﬁ
000340          03  JSTRR-111    OCCURS  10.                            ª≤ΩﬁÕﬁ¬
000350              04  JSTRR-1111    PIC S9(4).
000360          03  JSTRR-112         PIC S9(5).                        I.981007
000370*****     03  JSTRR-112         PIC S9(6).                        D.981007
000380     02   JSTRR-12.                                               º≠Ø∂ºﬁ¬
000390          03  JSTRR-121    OCCURS  10.                            ª≤ΩﬁÕﬁ¬
000400              04  JSTRR-1211    PIC S9(4).
000410          03  JSTRR-122         PIC S9(5).                        I.981007
000420*****     03  JSTRR-122         PIC S9(6).                        D.981007
000430     02  JSTRR-13               PIC 9(1).                         ±Ωﬁ∂ÿ KB
000440     02  JSTRR-14               PIC 9(1).                         â^ëóÇbÇc
000450     02  JSTRR-14A              PIC 9(3).                         ÉZÉbÉgêî
000460     02  JSTRR-14B              PIC 9(6).                         ëóÇËèÛáÇ
000470     02  JSTRR-14C              PIC 9(2).                         é}î‘
000480*****02  FILLER                 PIC X(3).                         D.981007
000490*****02  FILLER                 PIC X(2).                         D.980930
000500*****02  JSTRR-99               PIC 9(01).                        D.980930
000510     02  JSTRR-14D              PIC N(9).                         îzíB
000520     02  JSTRR-15               PIC N(23).                        ìEóv
000530     02  JSTRR-20               PIC X(10).                        I.981007
000540     02  JSTRR-15A              PIC S9(03).                       å¬êî
000550     02  JSTRR-30               PIC 9(1).                         I.981020
000560     02  JSTRR-40               PIC X(9).                         I.981020
000570*****02  FILLER                 PIC X(7).                         D.981007
000580*****02  JSTRR-18.                                                D.980930
000590*****    03  JSTRR-181          PIC 9(6).                         D.980930
000600*****    03  JSTRR-182          PIC 9(1).                         D.980930
000610*****02  JSTRR-30.                                                D.981020
000620*****    03  JSTRR-301          PIC 9(4).                         D.981020
000630*****    03  JSTRR-302          PIC 9(1).                         D.981020
000640*****02  FILLER                 PIC X(13).                        D.981020
000650*****02  FILLER                 PIC X(11).                        D.981007
000660*****02  FILLER                 PIC X(15).                        D.980521
000670*****02  FILLER                 PIC X(20).                        D.971203
000680     02  FILLER                 PIC X(08).                        I.981020
000690     02  JSTRR-90               PIC 9(08).
000700     02  JSTRR-19               PIC X(01).
000710     02  JSTRR-158              PIC 9(01).
000720     02  JSTRR-16               PIC 9(01).                        àÍî ã≥àÁ
000730     02  JSTRR-17               PIC 9(01).                        çXêVª≤›
