000010************************************
000020*****     入出庫累積ワーク     *****
000030************************************
000040 FD  JT-W170
000050     BLOCK    3     RECORDS
000060     LABEL    RECORD   STANDARD
000070     VALUE     OF  IDENTIFICATION  JT-W170K1ID
000080     ALTERNATE     IDENTIFICATION  JT-W170K3ID.
000090 01  JTW-R.
000100     02  JTW-KEY1.                                                KEY1
000110       03  JTW-01               PIC  9(06)  COMP-3.               品名ｺｰﾄﾞ
000120       03  JTW-02               PIC  9(08)  COMP-3.               I.980526
000130*****  03  JTW-02               PIC  9(06)  COMP-3.               D.980526
000140       03  JTW-03               PIC  9(02).                       入出力区
000150       03  JTW-04               PIC  9(06)  COMP-3.               伝票№
000160       03  JTW-05               PIC  9(01).                       行
000170     02  JTW-06                 PIC  9(01).                       倉ｺｰﾄﾞ
000180     02  JTW-07                 PIC  9(01).                       サイズ
000190     02  JTW-08.                                                  入出庫数
000200       03  JTW-081              PIC S9(04)  COMP-3    OCCURS  10.
000210     02  JTW-09                 PIC  9(01).                       生産区分
000220     02  JTW-10                 PIC  9(01).                       出荷伝区
000230     02  JTW-11.
000240       03  JTW-111              PIC  9(04).                       得意先C
000250       03  JTW-112              PIC  9(03).                       直送NO
000260     02  JTW-12                 PIC  9(06)  COMP-3.               送り状№
000270     02  JTW-13                 PIC  9(01).                       預り区分
000280     02  JTW-14                 PIC  9(01).                       運送C
000290     02  JTW-KEY2.
000300       03  JTW-15.                                                受注
000310         04  JTW-151            PIC  9(06)  COMP-3.               　受注№
000320         04  JTW-152            PIC  9(01).                       　行№
000330       03  JTW-16               PIC  9(08)  COMP-3.               I.980526
000340*****  03  JTW-16               PIC  9(06)  COMP-3.               D.980526
000350       03  JTW-17               PIC  9(01).                       ﾚｺｰﾄﾞKBN
000360       03  JTW-18.                                                伝票
000370         04  JTW-181            PIC  9(06)  COMP-3.               　伝票№
000380         04  JTW-182            PIC  9(01).                       　行№
000390     02  JTW-KEY3.
000400       03  JTW-19               PIC  9(04).                       得意先C
000410       03  JTW-20               PIC  9(08)  COMP-3.               I.980526
000420*****  03  JTW-20               PIC  9(06)  COMP-3.               D.980526
000430       03  JTW-21               PIC  9(01).                       レコー区
000440       03  JTW-22.                                                伝票№
000450         04  JTW-221            PIC  9(06)  COMP-3.               出荷指№
000460         04  JTW-222            PIC  9(01).                       　行№
000470     02  JTW-23                 PIC  N(09).                       配達
000480     02  JTW-24                 PIC  N(23).                       摘要
000490*****02  FILLER                 PIC  X(11).                       D.980526
000500     02  FILLER                 PIC  X(08).                       I.980526
000510     02  JTW-90                 PIC  9(01).                       入力部署
000520     02  JTW-91                 PIC  9(01).                       繰越区分
000530     02  JTW-92                 PIC  9(02).                       処理月
