000010 01  WN-AREA.
000020     02  WN-DCHK        PIC  9(001).
000030     02  WN-CNT1        PIC  9(002).
000040     02  WN-CNT2        PIC  9(002).
000050     02  WN-CNT3        PIC  9(002).
000060     02  WN-CNT4        PIC  9(002).
000070     02  WN-NAME        PIC  N(026).
000080     02  WN-ANA   REDEFINES WN-NAME.
000090       03  WN-NAD   OCCURS  26.
000100         04  WN-NA      PIC  N(001).
000110     02  WN-WNAME       PIC  N(026).
000120     02  WN-WANA   REDEFINES WN-WNAME.
000130       03  WN-WNAD   OCCURS  26.
000140         04  WN-WNA     PIC  N(001).
000150     02  WN-ONAME       PIC  N(016).
000160     02  WN-AONA  REDEFINES WN-ONAME.
000170       03  WN-ONAD  OCCURS  16.
000180         04  WN-ONA     PIC  N(001).
000190     02  WN-UNAME       PIC  N(016).
000200     02  WN-AUNA  REDEFINES WN-UNAME.
000210       03  WN-UNAD  OCCURS  16.
000220         04  WN-UNA     PIC  N(001).
000230     02  WN-KUM         PIC  N(004).
000240     02  WN-AKUM  REDEFINES WN-KUM.
000250       03  WN-KUMD  OCCURS   4.
000260         04  WN-KU      PIC  N(001).
