000010 NAM-RTN.
000020     MOVE 0 TO WN-DCHK.
000030 NAM-010.
000040     MOVE SPACE TO WN-ONAME WN-UNAME.
000050     MOVE 27 TO WN-CNT1.
000060 NAM-020.
000070     SUBTRACT 1 FROM WN-CNT1.
000080     IF WN-CNT1 = 16
000090         MOVE SPACE TO WN-ONAME
000100         MOVE WN-NAME TO WN-UNAME
000110         GO TO NAM-EX.
000120     IF WN-NA(WN-CNT1) = SPACE
000130         GO TO NAM-020.
000140     IF WN-DCHK = 1
000150         GO TO NAM-310.
000160     IF WN-DCHK = 2
000170         GO TO NAM-410.
000180 NAM-100.
000190     MOVE 17 TO WN-CNT2.
000200 NAM-110.
000210*****IF WN-CNT1 < 10                                              D.020709
000220*****    GO TO NAM-210.                                           D.020709
000230     IF WN-NA(WN-CNT1) = SPACE
000240         GO TO NAM-120.
000250     SUBTRACT 1 FROM WN-CNT2.
000260     IF WN-CNT2 NOT = ZERO
000270         MOVE WN-NA(WN-CNT1) TO WN-UNA(WN-CNT2)
000280         SUBTRACT 1 FROM WN-CNT1
000290         GO TO NAM-110.
000300     GO TO NAM-210.
000310 NAM-120.
000320     IF WN-CNT1 > 17
000330         SUBTRACT 1 FROM WN-CNT1
000340         GO TO NAM-110.
000350*
000360     MOVE ZERO TO WN-CNT3.
000370 NAM-130.
000380     ADD 1 TO WN-CNT3.
000390     IF WN-CNT1 = WN-CNT3
000400         GO TO NAM-EX.
000410     IF WN-CNT3 < 17
000420         MOVE WN-NA(WN-CNT3) TO WN-ONA(WN-CNT3)
000430         GO TO NAM-130.
000440 NAM-210.
000450     MOVE WN-NAME TO WN-WNAME.
000460     MOVE SPACE TO WN-NAME.
000470     MOVE ZERO TO WN-CNT1 WN-CNT2.
000480 NAM-220.
000490     ADD 1 TO WN-CNT1.
000500     IF WN-CNT1 > 26
000510         MOVE 1 TO WN-DCHK
000520         GO TO NAM-010.
000530     IF WN-WNA(WN-CNT1) NOT = SPACE
000540         ADD 1 TO WN-CNT2
000550         MOVE WN-WNA(WN-CNT1) TO WN-NA(WN-CNT2).
000560     GO TO NAM-220.
000570 NAM-310.
000580     MOVE WN-NAME TO WN-WNAME.
000590     MOVE SPACE TO WN-NAME.
000600     MOVE ZERO TO WN-CNT1.
000610 NAM-320.
000620     ADD 1 TO WN-CNT1.
000630     IF WN-CNT1 > 23
000640         MOVE SPACE TO WN-NAME
000650         MOVE WN-WNAME TO WN-NAME
000660         GO TO NAM-410.
000670     MOVE WN-WNA(WN-CNT1) TO WN-NA(WN-CNT1).
000680     MOVE SPACE TO WN-KUM.
000690     MOVE WN-CNT1 TO WN-CNT2.
000700     MOVE ZERO TO WN-CNT3.
000710 NAM-330.
000720     ADD 1 TO WN-CNT3.
000730     IF WN-CNT3 NOT = 5
000740         MOVE WN-WNA(WN-CNT2) TO WN-KU(WN-CNT3)
000750         ADD 1 TO WN-CNT2
000760         GO TO NAM-330.
000770     IF WN-KUM NOT = NC"Š”Ž®‰ïŽÐ" AND NC"—LŒÀ‰ïŽÐ"
000780         GO TO NAM-320.
000790*
000800     IF WN-KUM = NC"Š”Ž®‰ïŽÐ"
000810         MOVE NC"‡Š" TO WN-NA(WN-CNT1).
000820     IF WN-KUM = NC"—LŒÀ‰ïŽÐ"
000830         MOVE NC"‡‹" TO WN-NA(WN-CNT1).
000840     MOVE WN-CNT1 TO WN-CNT2.
000850*****ADD 4 TO WN-CNT2.                                            D.020620
000860     ADD 3 TO WN-CNT2.                                            I.020620
000870 NAM-340.
000880     ADD 1 TO WN-CNT1 WN-CNT2.
000890     IF WN-CNT2 < 27
000900         MOVE WN-WNA(WN-CNT2) TO WN-NA(WN-CNT1)
000910         GO TO NAM-340.
000920     MOVE 2 TO WN-DCHK.
000930     GO TO NAM-010.
000940 NAM-410.
000950     MOVE SPACE TO WN-ONAME WN-UNAME.
000960     MOVE ZERO TO WN-CNT1.
000970 NAM-420.
000980     ADD 1 TO WN-CNT1.
000990     IF WN-CNT1 > 26
001000         GO TO NAM-EX.
001010     IF WN-CNT1 < 17
001020         MOVE WN-NA(WN-CNT1) TO WN-ONA(WN-CNT1)
001030         GO TO NAM-420.
001040     IF WN-CNT1 = 17
001050         MOVE 6 TO WN-CNT2.
001060     ADD 1 TO WN-CNT2.
001070     MOVE WN-NA(WN-CNT1) TO WN-UNA(WN-CNT2)
001080     GO TO NAM-420.
001090 NAM-EX.
