000010*********************************************
000020*****                                   *****
000030*****       îıçlÇsÇqÇ`ÇmÉtÉ@ÉCÉã        *****
000040*****                      128/02       *****
000050*********************************************
000060 FD  HN-BTRN
000070     BLOCK    2     RECORDS
000080     LABEL    RECORD   STANDARD
000090     VALUE    OF  IDENTIFICATION  "BTRAN".
000100*
000110 01  BTRN-R.
000120     02  BTRN-01            PIC N(24).                            îıçl
000130     02  BTRN-02            PIC 9(03).                            º∞π›ΩNO
000140     02  BTRN-03            PIC 9(01).                            çsáÇ
000150     02  BTRN-04            PIC S9(07).                           è¡îÔê≈éc
000160     02  BTRN-05            PIC S9(09).                           îÑä|écçÇ
000170     02  BTRN-06            PIC 9(06).                            ì`ï[áÇ
000180     02  BTRN-07.                                                 î≠ëóñæç◊
000190       03  BTRN-071  OCCURS 6   PIC 9(06).                            áÇ
000200     02  BTRN-08            PIC S9(07).                           è¡îÔê≈
000210     02  FILLER             PIC X(11).
000220**
