000010***********************************
000020******    荷札ワーク　　　　　　　*
000030******                SEQ         *
000040******                128/2       *
000050***********************************
000060 FD  NF-WK
000070     BLOCK    2     RECORDS
000080     LABEL    RECORD   STANDARD
000090     VALUE    OF  IDENTIFICATION   NF-WK-ID.
000100*
000110 01  NF-R1.
000120     02   NF1-01                 PIC 9(06).                       送状№
000130     02   NF1-02.                                                 枝番
000140          03   NF1-021           PIC 9(02).                       　入力
000150          03   NF1-022           PIC 9(03).                       　連番
000160     02   NF1-03                 PIC 9(01).                       行
000170     02   NF1-04.                                                 発送日
000180          03  NF1-041            PIC 9(02).                       　年
000190          03  NF1-042            PIC 9(02).                       　月
000200          03  NF1-043            PIC 9(02).                       　月
000210     02   NF1-05                 PIC 9(06).                       品ｺｰﾄﾞ
000220     02   NF1-06.
000230          03  NF1-061            PIC 9(04).                       得意先CD
000240          03  NF1-062            PIC 9(03).                       直送先CD
000250     02   NF1-07                 PIC 9(01).                       運送業者
000260     02   NF1-08                 PIC 9(01).                       倉 ｺｰﾄﾞ
000270     02   NF1-09                 PIC S9(03).                      個数
000280     02   NF1-10.                                                 出荷数
000290          03 NF1-101             PIC S9(03)   OCCURS  27.         サイズ別
000300     02   NF1-11                 PIC S9(03).                      枚数
000310     02   NF1-12                 PIC 9(01).                       一般教育
000320     02   NF1-13.                                                 直送先CD
000330          03  NF1-131            PIC 9(04).                       得意先CD
000340          03  NF1-132            PIC 9(03).                       直送先CD
000350*****02   FILLER                 PIC X(03).                       D.900412
000360 01  NF-R2.
000370     02   NF2-01                 PIC 9(06).                       送状№
000380     02   NF2-02.                                                 枝番
000390          03   NF2-021           PIC 9(02).                       　入力
000400          03   NF2-022           PIC 9(03).                       　連番
000410     02   NF2-03                 PIC 9(01).                       行
000420     02   NF2-04                 PIC N(09).                       配達
000430     02   NF2-05                 PIC N(23).                       摘要
000440     02   F                      PIC X(44).
000450     02   NF2-12                 PIC 9(01).                       一般教育
000460     02   NF2-99.                                                 直送先CD
000470          03  NF2-991            PIC 9(04).                       得意先CD
000480          03  NF2-992            PIC 9(03).                       直送先CD
