000010***********************************
000020******    荷札ワーク２　　　　　　*
000030******                ISAM        *
000040******                 42/6       *
000050***********************************
000060 FD  NF-WK2
000070     BLOCK    6     RECORDS
000080     LABEL    RECORD   STANDARD
000090     VALUE    OF  IDENTIFICATION   NF-WK2-ID.
000100*
000110 01  WK2-R.
000120     02   WK2-KEY.                                                KEY
000130          03   WK2-01            PIC 9(06).                       送状№
000140          03   WK2-02.                                            枝番
000150               04   WK2-021      PIC 9(02).                       　入力
000160               04   WK2-022      PIC 9(03).                       　連番
000170          03   WK2-03            PIC 9(01).                       一足箱KB
000180          03   WK2-04            PIC 9(06).                       品名ｺｰﾄﾞ
000190          03   WK2-05            PIC 9(03).                       ｻｲｽﾞｺｰﾄﾞ
000200     02   WK2-06                 PIC 9(03).                       セット数
000210     02   WK2-07                 PIC 9(06).                       指図伝NO
000220     02   WK2-08                 PIC 9(03).                       ｶｰﾄﾝ入数
000230     02   WK2-09                 PIC S9(04).                      残数
000240     02   F                      PIC X(04).                       I.100407
000250     02   WK2-70                 PIC 9(01).                       I.100407
000260*****02   F                      PIC X(05).                       D.100407
