000010***********************************
000020******    荷札ワーク１　　　　　　*
000030******                ISAM        *
000040******                 51/5       *
000050***********************************
000060 FD  NF-WK1
000070     BLOCK    5     RECORDS
000080     LABEL    RECORD   STANDARD
000090     VALUE    OF  IDENTIFICATION   NF-WK1-ID.
000100*
000110 01  WK1-R.
000120     02   WK1-KEY.                                                KEY
000130          03   WK1-01            PIC 9(06).                       送状№
000140          03   WK1-02.                                            枝番
000150               04   WK1-021      PIC 9(02).                       　入力
000160               04   WK1-022      PIC 9(03).                       　連番
000170          03   WK1-03            PIC 9(01).                       一足箱KB
000180          03   WK1-04            PIC 9(06).                       品名ｺｰﾄﾞ
000190          03   WK1-05            PIC 9(03).                       ｻｲｽﾞｺｰﾄﾞ
000200     02   WK1-06                 PIC 9(03).                       セット数
000210     02   WK1-07                 PIC S9(04).                      指図足数
000220     02   WK1-08                 PIC 9(06).                       指図伝NO
000230     02   WK1-09                 PIC 9(03).                       ｶｰﾄﾝ入数
000240     02   WK1-10                 PIC S9(04).                      足数入数
000250     02   WK1-11                 PIC S9(04).                      残数
000260     02   F                      PIC X(06).
