000010***********************************
000020******    荷札ワーク３            *
000030******                ISAM        *
000040******                 32/8       *
000050***********************************
000060 FD  NF-WK3
000070     BLOCK    8     RECORDS
000080     LABEL    RECORD   STANDARD
000090     VALUE    OF  IDENTIFICATION   NF-WK3-ID.
000100*
000110 01  WK3-R.
000120     02   WK3-KEY.                                                KEY
000130          03   WK3-01            PIC 9(06).                       送状№
000140          03   WK3-02            PIC 9(02).                       枝番(入)
000150          03   WK3-03            PIC 9(01).                       一足箱KB
000160     02   WK3-04                 PIC 9(05).                       合計足数
000170     02   WK3-05                 PIC 9(03).                       ｶｰﾄﾝ入数
000180     02   WK3-06                 PIC S9(04).                      足数入数
000190     02   WK3-07                 PIC S9(04).                      端数
000200     02   WK3-08                 PIC S9(04).                      ｻｲｽﾞ別個
000210     02   F                      PIC X(03).
