000010*********************************************
000020*****                                   *****
000030*****  売上可能ＫＥＹファイル 　　　    *****
000040*****                       21/12       *****
000050*********************************************
000060 FD  HN-UKEY
000070     BLOCK    12    RECORDS
000080     LABEL    RECORD   STANDARD
000090     VALUE    OF  IDENTIFICATION  "HN-UKEY".
000100*
000110 01  UKEY-R.
000120     02  UKEY-KEY.
000130       03  UKEY-01           PIC 9(06).                           日付
000140       03  UKEY-01R REDEFINES   UKEY-01.
000150         04  UKEY-011        PIC 9(02).
000160         04  UKEY-012        PIC 9(02).
000170         04  UKEY-013        PIC 9(02).
000180       03  UKEY-02           PIC 9(02).                           担当
000190       03  UKEY-03           PIC 9(04).                           得意先
000200       03  UKEY-04           PIC 9(06).                           売上№
000210     02  FILLER              PIC X(03).
