000010*********************************************
000020*****                                   *****
000030*****       仕上・受入ＴＲＡＮ　　　    *****
000040*****                       256/1       *****
000050*********************************************
000060 FD  HN-UTRN
000070     BLOCK 4 RECORDS
000080     LABEL RECORD IS STANDARD
000090     VALUE OF IDENTIFICATION "HN-UTRN".
000100 01  UTRN-R.
000110     02  UTRN-01        PIC 9(06).                                受入№
000120     02  UTRN-02        PIC 9.                                    行№
000130     02  UTRN-03        PIC 9(06).                                日付
000140     02  UTRN-03R  REDEFINES  UTRN-03.
000150       03  UTRN-031     PIC 9(02).                                　年
000160       03  UTRN-032     PIC 9(02).                                　月　
000170       03  UTRN-033     PIC 9(02).                                　日　
000180     02  UTRN-04        PIC 9(06).                                品名ＣＤ
000190     02  UTRN-05        PIC 9(01).                                サイズ区
000200     02  UTRN-06.                                                 数量
000210       03  UTRN-061     PIC S9(04)   COMP-3    OCCURS  10.
000220     02  UTRN-07        PIC 9(01).                                生産区分
000230     02  UTRN-08        PIC 9(01).                                倉庫ｺｰﾄﾞ
000240     02  UTRN-09        PIC 9(01).                                入力区分
000250     02  UTRN-10        PIC 9(06).                                前品名CD
000260*****        0 = 営業在庫ＯＦＦ  ,  1 = 営業在庫ＯＮ
000270     02  UTRN-11        PIC 9(01).                                I.950614
000280*****02  F              PIC X(05).                                D.950614
000290     02  F              PIC X(04).                                I.950614
