000010*********************************************
000020*****                                   *****
000030*****       ワークファイル（０１）      *****
000040*****                       256/1       *****
000050*********************************************
000060 FD  HN-WK01
000070     BLOCK 1 RECORDS
000080     LABEL RECORD IS STANDARD
000090     VALUE OF IDENTIFICATION JT-OWS256ID.
000100 01  WK01-R.
000110     02  WK01-KEY.
000120       03  WK01-01.                                               指図
000130         04  WK01-011   PIC 9(06).                                　指図№
000140         04  WK01-012   PIC 9(01).                                　行№
000150     02  WK01-02        PIC 9(06).                                指図日
000160     02  WK01-02R  REDEFINES  WK01-02.
000170       03  WK01-021     PIC 9(02).                                　年
000180       03  WK01-022     PIC 9(02).                                　月　
000190       03  WK01-023     PIC 9(02).                                　日　
000200     02  WK01-03        PIC 9(06).                                入荷予日
000210     02  WK01-03R  REDEFINES  WK01-03.
000220       03  WK01-031     PIC 9(02).                                　年
000230       03  WK01-032     PIC 9(02).                                　月　
000240       03  WK01-033     PIC 9(02).                                　日　
000250     02  WK01-04        PIC 9(06).                                品名ＣＤ
000260     02  WK01-05        PIC 9(01).                                ｻｲｽﾞ区分
000270     02  WK01-06.
000280       03  WK01-061     PIC S9(06)     OCCURS 10.                 指図数
000290     02  WK01-07.
000300       03  WK01-071     PIC S9(06)     OCCURS 10.                 入荷累計
000310     02  WK01-08        PIC N(32).                                摘要　　
000320     02  WK01-09        PIC 9(01).                                教／一区
000330     02  F              PIC X(44).
000340     02  WK01-99Z       PIC 9.                                    処理　　
