000010***********************************************
000020*****                                     *****
000030**   　　送　り　状　フ　ァ　イ　ル　　　　　**
000040*****         ( O K J F  )  64/4          *****
000050***********************************************
000060 FD  OKJF
000070*****BLOCK 5 RECORDS                                              D.040624
000080     BLOCK 4 RECORDS                                              I.040624
000090     LABEL RECORD IS STANDARD
000100     VALUE OF IDENTIFICATION "OKJF".
000110 01  OKJF-R.
000120     02  OKJF-KEY.                                                KEY
000130         03  OKJF-01  PIC 9(06).                                  送り状NO
000140     02  OKJF-02      PIC 9(01).                                  運送業CD
000150     02  OKJF-03      PIC 9(06).                                  年月日
000160     02  OKJF-04      PIC 9(01).                                  倉庫　CD
000170     02  OKJF-05      PIC 9(07).                                  直送先CD
000180     02  OKJF-06      PIC N(09).                                  配達日
000190     02  OKJF-07      PIC 9(03).                                  個数
000200     02  OKJF-08      PIC 9(01).                                  印字 ｻｲﾝ
000210     02  OKJF-09      PIC 9(01).                                  区分
000220     02  OKJF-10      PIC 9(01).                                  更新 ｻｲﾝ
000230     02  OKJF-11      PIC 9(05).                                  I.960821
000240     02  OKJF-12      PIC 9(06).                                  I.040624
000250     02  OKJF-13      PIC 9(01).                                  I.041215
000260     02  F            PIC X(07).                                  I.041215
000270*****02  F            PIC X(08).                                  D.041215
000280*****02  F            PIC X(01).                                  D.040624
000290*****02  F            PIC X(06).                                  D.960821
000300*    *******************************
000310*    *      印字サイン　 [OKJF-08] *
000320*    *    0;  送り状未発行         *
000330*    *    1;  送り状発行済　　　   *
000340*    *******************************
000350*    *    一般／教育区分 [OKJF-09] *
000360*    *    0;   一般　　　　　      *
000370*    *    1;   教育　　　 　　　   *
000380*    *******************************
000390*    *    更新済サイン　 [OKJF-10] *
000400*    *    0;  未更新　　　　       *
000410*    *    1;  更新済　　　　　　   *
000420*    *******************************
