000010*****************************
000020*    ´×° DISPLAY (Ò²Ý)      * (µÝ×²Ý—p)
000030*****************************
000040 ERR-RTN.
000050     MOVE    ERR-STAT  TO  ERR-FLG.
000060     IF  ERR-LIN  =  ZERO      MOVE  24    TO  ERR-LIN.
000070*****PERFORM END-RTN THRU END-EX.
000080     DISPLAY  DISP-MSG-SPACE.
000090 ERR-010.
000100     DISPLAY ERR-DIS.
000110     DISPLAY DISP-BUZ-B.
000120     DISPLAY DISP-MSG-SPACE.
000130*****GO TO ERR-010.
000140 ERR-EX.
000150     EXIT.
000160*
000170*
