000010**************************************************
000020*****    ＪＣＡ手順ファイル（ワークマン）    *****
000030*****           ( JCAWF )  256/1             *****
000040**************************************************
000050 FD  JCAWF
000060     BLOCK  1 RECORDS
000070     LABEL RECORD IS STANDARD
000080     VALUE OF IDENTIFICATION "JCAWF".
000090 01  JCAW-R.
000100     02  JCAW-R1         PIC  X(128).
000110     02  JCAW-R2         PIC  X(128).
