000010**************************************************
000020*****    ＪＣＡ手順ファイル（赤ちゃん本舗）  *****
000030*****           ( JCAAF )  256/1             *****
000040**************************************************
000050 FD  JCAAF
000060     BLOCK  1 RECORDS
000070     LABEL RECORD IS STANDARD
000080     VALUE OF IDENTIFICATION "JCAAF".
000090 01  JCAA-R.
000100     02  JCAA-R1         PIC  X(128).
000110     02  JCAA-R2         PIC  X(128).
