000010***********************************************
000020*****　　生　協　発　注　デ　ー　タ       *****
000030*****         ( SK-HAT )   256/1          *****
000040***********************************************
000050 FD  SK-HAT
000060     BLOCK  1 RECORDS
000070     LABEL RECORD IS STANDARD
000080     VALUE OF IDENTIFICATION "HAT-DB".
000090 01  HAT-R.
000100     02  HAT-KEY.
000110       03  HAT-01       PIC  9(06).
000120       03  HAT-02       PIC  9(01).
000130     02  HAT-03.
000140       03  HAT-031      PIC  9(04).
000150       03  HAT-032      PIC  9(02).
000160       03  HAT-033      PIC  9(02).
000170     02  HAT-04.
000180       03  HAT-041      PIC  9(04).
000190       03  HAT-042      PIC  9(03).
000200     02  HAT-05         PIC  9(01).
000210     02  HAT-06         PIC  9(09).
000220     02  HAT-07         PIC  9(06).
000230     02  HAT-08         PIC  9(03).
000240     02  HAT-09.
000250       03  HAT-091      PIC  N(14).
000260       03  HAT-092      PIC  N(10).
000270     02  HAT-10.
000280       03  HAT-101      PIC  9(04).
000290       03  HAT-102      PIC  9(02).
000300       03  HAT-103      PIC  9(02).
000310     02  HAT-11         PIC S9(04).
000320     02  HAT-13         PIC  9(05).
000330     02  HAT-14         PIC  9(05).
000340     02  HAT-15         PIC  X(13).
000350     02  HAT-16         PIC  9(01).
000360     02  HAT-17         PIC  N(09).
000370     02  HAT-18.
000380       03  HAT-181      PIC  9(02).
000390       03  HAT-182      PIC  9(02).
000400       03  HAT-183      PIC  9(03).
000410     02  HAT-19         PIC  N(23).
000420     02  HAT-23         PIC  9(10).
000430     02  HAT-25.
000440       03  HAT-251      PIC  9(04).
000450       03  HAT-252      PIC  9(02).
000460       03  HAT-253      PIC  9(02).
000470     02  HAT-26         PIC  X(09).                               I.040408
000480     02  F              PIC  X(18).                               I.060830
000490*****02  F              PIC  X(19).                               D.060830
000500*****02  F              PIC  X(28).                               D.040408
000510*****02  F              PIC  X(36).                               D.040406
000520     02  HAT-27         PIC  9(01).                               I.060830
000530     02  HAT-24         PIC  9(01).
000540     02  HAT-20         PIC  9(01).
000550     02  HAT-21.
000560       03  HAT-211      PIC  9(04).
000570       03  HAT-212      PIC  9(02).
000580       03  HAT-213      PIC  9(02).
000590     02  HAT-22         PIC  9(01).
000600     02  HAT-97         PIC  9(01).
000610     02  HAT-98         PIC  9(01).
000620     02  HAT-99         PIC  9(01).
