000010***********************************************
000020*****　　生協荷札ワーク２                 *****
000030*****         ( SNFW2 )   128/8           *****
000040***********************************************
000050 FD  SNFW2
000060     BLOCK    8     RECORDS
000070     LABEL    RECORD   STANDARD
000080     VALUE    OF  IDENTIFICATION  "SNFW2-DB".
000090*
000100 01  SNW2-R.
000110     02  SNW2-01.
000120       03  SNW2-011              PIC  9(04).
000130       03  SNW2-012              PIC  9(03).
000140     02  SNW2-02.
000150       03  SNW2-021              PIC  9(02).
000160       03  SNW2-022              PIC  9(02).
000170       03  SNW2-023              PIC  9(03).
000180     02  SNW2-03                 PIC  9(03).
000190     02  SNW2-12                 PIC  9(01).
000200     02  SNW2-04                 PIC  9(06).
000210     02  SNW2-05                 PIC  9(03).
000220     02  SNW2-06                 PIC  9(06).
000230     02  SNW2-07                 PIC  9(03).
000240     02  SNW2-08                 PIC S9(04).
000250     02  SNW2-09                 PIC S9(05).
000260     02  SNW2-10.
000270       03  SNW2-101              PIC  N(14).
000280       03  SNW2-102              PIC  N(10).
000290     02  F                       PIC  X(35).
