000010***********************************************
000020*****　　生協荷札ワーク                   *****
000030*****         ( SNFWK )   256/1           *****
000040***********************************************
000050 FD  SNFWK
000060     BLOCK    1     RECORDS
000070     LABEL    RECORD   STANDARD
000080     VALUE    OF  IDENTIFICATION  "SNFWK".
000090*
000100 01  SNFWK-R1.
000110     02  SNF1-01                 PIC  9(006).
000120     02  SNF1-02                 PIC  9(003).
000130     02  SNF1-03                 PIC  9(001).
000140     02  SNF1-04                 PIC  9(006).
000150     02  SNF1-05.
000160       03  SNF1-051              PIC  9(002).
000170       03  SNF1-052              PIC  9(002).
000180       03  SNF1-053              PIC  9(002).
000190     02  SNF1-06.
000200       03  SNF1-061              PIC  9(004).
000210       03  SNF1-062              PIC  9(003).
000220     02  SNF1-07                 PIC  9(001).
000230     02  SNF1-08                 PIC  9(001).
000240     02  SNF1-09                 PIC S9(003).
000250     02  SNF1-10    OCCURS  27.
000260       03  SNF1-101              PIC S9(003).
000270     02  SNF1-11.
000280       03  SNF1-111              PIC  N(014).
000290       03  SNF1-112              PIC  N(010).
000300     02  F                       PIC  X(037).
000310     02  SNF1-14.
000320       03  SNF1-141              PIC  9(004).
000330       03  SNF1-142              PIC  9(003).
000340     02  SNF1-15.
000350       03  SNF1-151              PIC  9(002).
000360       03  SNF1-152              PIC  9(002).
000370       03  SNF1-153              PIC  9(003).
000380     02  F                       PIC  X(042).
000390*
000400 01  SNFWK-R2.
000410     02  SNF2-01                 PIC  9(006).
000420     02  SNF2-02                 PIC  9(003).
000430     02  SNF2-03                 PIC  9(001).
000440     02  SNF2-04                 PIC  N(009).
000450     02  SNF2-05                 PIC  N(023).
000460     02  F                       PIC  X(126).
000470     02  SNF2-14.
000480       03  SNF2-141              PIC  9(004).
000490       03  SNF2-142              PIC  9(003).
000500     02  SNF2-15.
000510       03  SNF2-151              PIC  9(002).
000520       03  SNF2-152              PIC  9(002).
000530       03  SNF2-153              PIC  9(003).
000540     02  F                       PIC  X(042).
