000010***********************************************
000020*****Å@Å@ê∂ã¶â◊éDó›êœÇe                   *****
000030*****         ( SNFWR )   256/1           *****
000040***********************************************
000050 FD  SNFWR
000060     BLOCK    1     RECORDS
000070     LABEL    RECORD   STANDARD
000080     VALUE    OF  IDENTIFICATION  "SNFWR".
000090*
000100 01  SNFWR-R1.
000110     02  SNR1-KEY.                                                I.061108
000120         03  SNR1-01             PIC  9(006).                     I.061108
000130         03  SNR1-02             PIC  9(003).                     I.061108
000140         03  SNR1-03             PIC  9(001).                     I.061108
000150*****02  SNR1-01                 PIC  9(006).                     D.061108
000160*****02  SNR1-02                 PIC  9(003).                     D.061108
000170*****02  SNR1-03                 PIC  9(001).                     D.061108
000180     02  SNR1-04                 PIC  9(006).
000190     02  SNR1-05.
000200       03  SNR1-051              PIC  9(002).
000210       03  SNR1-052              PIC  9(002).
000220       03  SNR1-053              PIC  9(002).
000230     02  SNR1-06.
000240       03  SNR1-061              PIC  9(004).
000250       03  SNR1-062              PIC  9(003).
000260     02  SNR1-07                 PIC  9(001).
000270     02  SNR1-08                 PIC  9(001).
000280     02  SNR1-09                 PIC S9(003).
000290     02  SNR1-10    OCCURS  27.
000300       03  SNR1-101              PIC S9(003).
000310     02  SNR1-11.
000320       03  SNR1-111              PIC  N(014).
000330       03  SNR1-112              PIC  N(010).
000340     02  F                       PIC  X(037).
000350     02  SNR1-14.
000360       03  SNR1-141              PIC  9(004).
000370       03  SNR1-142              PIC  9(003).
000380     02  SNR1-15.
000390       03  SNR1-151              PIC  9(002).
000400       03  SNR1-152              PIC  9(002).
000410       03  SNR1-153              PIC  9(003).
000420*****02  F                       PIC  X(034).                     D.060911
000430     02  F                       PIC  X(033).                     I.060911
000440     02  SNR1-97                 PIC  9(001).                     I.060201
000450     02  SNR1-90                 PIC  9(008).                     I.050201
000460*****02  F                       PIC  X(042).                     D.050201
000470*
000480 01  SNFWR-R2.
000490     02  SNR2-KEY.                                                I.061108
000500         03  SNR2-01             PIC  9(006).                     I.061108
000510         03  SNR2-02             PIC  9(003).                     I.061108
000520         03  SNR2-03             PIC  9(001).                     I.061108
000530*****02  SNR2-01                 PIC  9(006).                     D.061108
000540*****02  SNR2-02                 PIC  9(003).                     D.061108
000550*****02  SNR2-03                 PIC  9(001).                     D.061108
000560     02  SNR2-04                 PIC  N(009).
000570     02  SNR2-05                 PIC  N(023).
000580     02  F                       PIC  X(126).
000590     02  SNR2-14.
000600       03  SNR2-141              PIC  9(004).
000610       03  SNR2-142              PIC  9(003).
000620     02  SNR2-15.
000630       03  SNR2-151              PIC  9(002).
000640       03  SNR2-152              PIC  9(002).
000650       03  SNR2-153              PIC  9(003).
000660*****02  F                       PIC  X(034).                     D.060911
000670     02  F                       PIC  X(033).                     I.060911
000680     02  SNR2-97                 PIC  9(001).                     I.060901
000690     02  SNR2-90                 PIC  9(008).                     I.050201
000700*****02  F                       PIC  X(042).                     D.050201
