000010***********************************************
000020*****Å@Å@ê∂ã¶â◊éDÉèÅ[ÉNÇP                 *****
000030*****         ( SNFW1 )   128/2           *****
000040***********************************************
000050 FD  SNFW1
000060     BLOCK    2     RECORDS
000070     LABEL    RECORD   STANDARD
000080     VALUE    OF  IDENTIFICATION  "SNFW1".
000090*
000100 01  SNW1-R.
000110     02  SNW1-KEY.
000120       03  SNW1-01.
000130         04  SNW1-011            PIC  9(04).
000140         04  SNW1-012            PIC  9(03).
000150       03  SNW1-02.
000160         04  SNW1-021            PIC  9(02).
000170         04  SNW1-022            PIC  9(02).
000180         04  SNW1-023            PIC  9(03).
000190       03  SNW1-03               PIC  9(03).
000200       03  SNW1-12               PIC  9(01).
000210       03  SNW1-04               PIC  9(06).
000220       03  SNW1-05               PIC  9(03).
000230     02  SNW1-06                 PIC S9(04).
000240     02  SNW1-08                 PIC S9(04).
000250     02  SNW1-09                 PIC S9(04).
000260     02  SNW1-10.
000270       03  SNW1-101              PIC  N(14).
000280       03  SNW1-102              PIC  N(10).
000290     02  SNW1-11                 PIC  9(06).
000300     02  SNW1-16                 PIC S9(04).                      I.041027
000310     02  F                       PIC  X(31).                      I.041027
000320*****02  F                       PIC  X(35).                      D.041027
