000010***********************************************
000020*****     ê∂ã¶Å@î[ïièëÉèÅ[ÉNÇPÅ`ÇR        *****
000030*****     ( SNOWK1, 2, 3 )     256/1      *****
000040***********************************************
000050 FD  SNOWK
000060     BLOCK  1 RECORDS
000070     LABEL RECORD IS STANDARD
000080     VALUE OF IDENTIFICATION SNOWK-ID.
000090 01  SNO-R.
000100     02  SNO-01.
000110       03  SNO-011      PIC  9(04).
000120       03  SNO-012      PIC  9(03).
000130     02  SNO-02.
000140       03  SNO-021      PIC  9(02).
000150       03  SNO-022      PIC  9(02).
000160       03  SNO-023      PIC  9(03).
000170     02  SNO-03         PIC  9(06).
000180     02  SNO-04         PIC  9(01).
000190     02  SNO-05.
000200       03  SNO-051      PIC  9(10).
000210       03  SNO-052      PIC  9(01).
000220     02  SNO-06.
000230       03  SNO-061      PIC  9(04).
000240       03  SNO-062      PIC  9(02).
000250       03  SNO-063      PIC  9(02).
000260     02  SNO-07.
000270       03  SNO-071      PIC  9(04).
000280       03  SNO-072      PIC  9(02).
000290       03  SNO-073      PIC  9(02).
000300     02  SNO-08.
000310       03  SNO-081      PIC  9(04).
000320       03  SNO-082      PIC  9(05).
000330     02  SNO-09.
000340       03  SNO-091      PIC  N(14).
000350       03  SNO-092      PIC  N(10).
000360     02  SNO-10         PIC  N(04).
000370     02  SNO-11         PIC  X(13).
000380     02  SNO-12         PIC S9(04).
000390     02  SNO-13         PIC  9(05).
000400     02  SNO-14         PIC S9(09).
000410     02  SNO-15         PIC  9(05).
000420     02  SNO-16         PIC S9(09).
000430     02  SNO-17         PIC  N(23).
000440     02  SNO-18         PIC  9(01).
000450     02  SNO-19         PIC  X(09).                               I.040408
000460     02  F              PIC  X(42).                               I.040408
000470*****02  F              PIC  X(51).                               D.040408
