000010***********************************************
000020*****　　生協送り状ワーク                 *****
000030*****         ( SOKJW )   128/2           *****
000040***********************************************
000050 FD  SOKJW
000060     BLOCK    2     RECORDS
000070     LABEL    RECORD   STANDARD
000080     VALUE    OF  IDENTIFICATION  "SOKJW".
000090*
000100 01  SOW-R.
000110     02  SOW-KEY.
000120       03  SOW-01.
000130         04  SOW-011             PIC  9(04).
000140         04  SOW-012             PIC  9(03).
000150       03  SOW-02.
000160         04  SOW-021             PIC  9(02).
000170         04  SOW-022             PIC  9(02).
000180         04  SOW-023             PIC  9(03).
000190     02  SOW-03                  PIC  9(01).
000200     02  SOW-04                  PIC  9(01).
000210     02  SOW-05                  PIC  9(06).
000220     02  SOW-06                  PIC  N(09).
000230     02  SOW-07                  PIC  N(23).
000240     02  SOW-08                  PIC S9(03).
000250     02  SOW-09                  PIC  9(06).
000260     02  F                       PIC  X(33).
