000010****************************************
000020*****     ÇdÇmÇcÅ@ÇrÇsÇ`ÇsÇtÇr     *****
000030****************************************
000040 01  W-STAT.
000050     02  NOC            PIC  X(002) VALUE "00".
000060     02  HTB            PIC  X(002) VALUE "01".                   ÿ¿∞›
000070     02  C1             PIC  X(002) VALUE "02".                   áT
000080     02  C2             PIC  X(002) VALUE "03".                   áU
000090     02  ADV            PIC  X(002) VALUE "04".                   ADVANCE
000100     02  FUK            PIC  X(002) VALUE "05".                   SHIFT+ÿ
000110     02  SKP            PIC  X(002) VALUE "06".                   SKIP
000120     02  BTB            PIC  X(002) VALUE "09".                   B SKIP
000130     02  PF1            PIC  X(002) VALUE "P1".                   PF1
000140     02  PF2            PIC  X(002) VALUE "P2".                   PF2
000150     02  PF3            PIC  X(002) VALUE "P3".                   PF3
000160     02  PF4            PIC  X(002) VALUE "P4".                   PF4
000170     02  PF5            PIC  X(002) VALUE "P5".                   PF5
000180     02  PF6            PIC  X(002) VALUE "P6".                   PF6
000190     02  PF7            PIC  X(002) VALUE "P7".                   PF7
000200     02  PF8            PIC  X(002) VALUE "P8".                   PF8
000210     02  PF9            PIC  X(002) VALUE "P9".                   PF9
000220     02  PF10           PIC  X(002) VALUE "PA".                   PF10
000230     02  PF17           PIC  X(002) VALUE "FW".                   PF17
000240     02  PF18           PIC  X(002) VALUE "BW".                   PF18
000250     02  PF21           PIC  X(002) VALUE "UP".                   PF21
000260     02  PF22           PIC  X(002) VALUE "DW".                   PF22
000270     02  DW             PIC  X(002) VALUE "DW".                   PF22
