000010***********************************************
000020*****     社　店　マ　ス　タ              *****
000030*****     ( STENM-D,K1,K2 )    170/3      *****
000040***********************************************
000050 FD  STENM
000060     BLOCK  3 RECORDS
000070     LABEL RECORD IS STANDARD
000080     VALUE OF IDENTIFICATION "STENM-DB".
000090 01  STE-R.
000100     02  STE-KEY2.
000110       03  STE-011      PIC  9(004).
000120       03  STE-012      PIC  9(003).
000130       03  STE-KEY1.
000140         04  STE-02     PIC  9(009).
000150     02  STE-03         PIC  N(015).
000160     02  STE-04         PIC  N(015).
000170     02  STE-05         PIC  9(006).
000180     02  STE-06         PIC  X(004).
000190     02  STE-07         PIC  9(002).
000200     02  STE-08.
000210       03  STE-081      PIC  9(010).
000220       03  STE-082      PIC  9(010).
000230       03  STE-083      PIC  9(010).
000240     02  STE-09         PIC  9(001).
000250     02  STE-10         PIC  9(001).
000260     02  STE-11         PIC  9(001).
000270     02  STE-12         PIC  9(001).                              I.040511
000280     02  F              PIC  X(048).                              I.040511
000290*****02  F              PIC  X(049).                              D.040511
