000010**************************************************
000020*****    ワークマン受信ファイル（ＥＤＩ）    *****
000030*****           ( WMJCF ) 1301/1             *****
000040**************************************************
000050 FD  WMJCF
000060     BLOCK  1 RECORDS
000070     LABEL RECORD IS STANDARD
000080     VALUE OF IDENTIFICATION "WMJCF".
000090 01  WMJC-R.
000100     02  WMJC-001        PIC  X(003).
000110     02  WMJC-002        PIC  X(013).
000120     02  WMJC-003        PIC  X(004).
000130     02  WMJC-004        PIC  X(013).
000140     02  WMJC-005        PIC  X(004).
000150     02  WMJC-006        PIC  X(012).
000160     02  WMJC-007        PIC  X(004).
000170     02  WMJC-008        PIC  X(080).
000180     02  WMJC-009        PIC  X(255).
000190     02  WMJC-010        PIC  X(005).
000200     02  WMJC-011        PIC  X(014).
000210     02  WMJC-012        PIC  X(013).
000220     02  WMJC-013        PIC  X(004).
000230     02  WMJC-014        PIC  X(001).
000240     02  WMJC-015        PIC  X(013).
000250     02  WMJC-016        PIC  X(013).
000260     02  WMJC-017        PIC  X(013).
000270     02  WMJC-018        PIC  X(080).
000280     02  WMJC-019        PIC  X(008).
000290     02  WMJC-020        PIC  X(008).
000300     02  WMJC-021        PIC  X(008).
000310     02  WMJC-022        PIC  X(001).
000320     02  WMJC-023        PIC  X(001).
000330     02  WMJC-024        PIC  X(001).
000340     02  WMJC-025        PIC  X(003).
000350     02  WMJC-026        PIC  X(003).
000360     02  WMJC-027        PIC  X(001).
000370     02  WMJC-028        PIC  X(001).
000380     02  WMJC-029        PIC  9(004).
000390     02  WMJC-030        PIC  X(001).
000400     02  WMJC-031        PIC  X(001).
000410     02  WMJC-032        PIC  X(001).
000420     02  WMJC-033        PIC  9(004).
000430     02  WMJC-034        PIC  X(001).
000440     02  WMJC-035        PIC  N(020).
000450     02  WMJC-036        PIC  X(020).
000460     02  WMJC-037        PIC  9(009).
000470     02  WMJC-038        PIC  9(001).
000480     02  WMJC-039        PIC  9(005).
000490     02  WMJC-040        PIC  X(001).
000500     02  WMJC-041        PIC  N(020).
000510     02  WMJC-042        PIC  X(020).
000520     02  WMJC-043        PIC  9(005).
000530     02  WMJC-044        PIC  X(001).
000540     02  WMJC-045        PIC  N(020).
000550     02  WMJC-046        PIC  X(020).
000560     02  WMJC-047        PIC  9(005).
000570     02  WMJC-048        PIC  X(001).
000580     02  WMJC-049        PIC  X(001).
000590     02  WMJC-050        PIC  X(001).
000600     02  WMJC-051        PIC  X(001).
000610     02  WMJC-052        PIC  X(001).
000620     02  WMJC-053        PIC  X(001).
000630     02  WMJC-054        PIC  9(006).
000640     02  WMJC-055        PIC  X(001).
000650     02  WMJC-056        PIC  N(020).
000660     02  WMJC-057        PIC  X(020).
000670     02  WMJC-058        PIC  9(006).
000680     02  WMJC-059        PIC  X(001).
000690     02  WMJC-060        PIC  N(020).
000700     02  WMJC-061        PIC  X(020).
000710     02  WMJC-062        PIC  X(001).
000720     02  WMJC-063        PIC  X(001).
000730     02  WMJC-064        PIC  X(001).
000740     02  WMJC-065        PIC  9(002).
000750     02  WMJC-066        PIC  9(002).
000760     02  WMJC-067        PIC  X(001).
000770     02  WMJC-068        PIC  9(002).
000780     02  WMJC-069        PIC  X(001).
000790     02  WMJC-070        PIC  X(001).
000800     02  WMJC-071        PIC  X(001).
000810     02  WMJC-072        PIC  X(001).
000820     02  WMJC-073        PIC  X(001).
000830     02  WMJC-074        PIC  X(001).
000840     02  WMJC-075        PIC  X(001).
000850     02  WMJC-076        PIC  X(001).
000860     02  WMJC-077        PIC  X(003).
000870     02  WMJC-078        PIC  X(001).
000880     02  WMJC-079        PIC  X(010).
000890     02  WMJC-080        PIC  X(010).
000900     02  WMJC-081        PIC  X(010).
000910     02  WMJC-082        PIC  X(001).
000920     02  WMJC-083        PIC  X(001).
000930     02  WMJC-084        PIC  X(001).
000940     02  WMJC-085        PIC  X(001).
000950     02  WMJC-086        PIC  9(002).
000960     02  WMJC-087        PIC  9(002).
000970     02  WMJC-088        PIC  9(002).
000980     02  WMJC-089        PIC  X(001).
000990     02  WMJC-090        PIC  X(001).
001000     02  WMJC-091        PIC  X(001).
001010     02  WMJC-092        PIC  9(002).
001020     02  WMJC-093        PIC  9(002).
001030     02  WMJC-094        PIC  X(001).
001040     02  WMJC-095        PIC  X(001).
001050     02  WMJC-096        PIC  X(001).
001060     02  WMJC-097        PIC  9(002).
001070     02  WMJC-098        PIC  X(001).
001080     02  WMJC-099        PIC  X(001).
001090     02  WMJC-100        PIC  X(001).
001100     02  WMJC-101        PIC  X(001).
001110     02  WMJC-102        PIC  X(001).
001120     02  WMJC-103        PIC  X(001).
001130     02  WMJC-104        PIC  X(001).
001140     02  WMJC-105        PIC  X(001).
001150     02  WMJC-106        PIC  X(001).
001160     02  WMJC-107        PIC  9(002).
001170     02  WMJC-108        PIC  9(001).
001180     02  WMJC-109        PIC  X(001).
001190     02  WMJC-110        PIC  X(001).
001200     02  WMJC-111        PIC  X(003).
001210     02  WMJC-112        PIC  X(006).
001220     02  WMJC-113        PIC  X(001).
001230     02  WMJC-114        PIC  X(001).
001240     02  WMJC-115        PIC  X(001).
001250     02  WMJC-116        PIC  X(001).
001260     02  WMJC-117        PIC  X(014).
001270     02  WMJC-118        PIC  X(014).
001280     02  WMJC-119        PIC  X(003).
001290     02  WMJC-120        PIC  X(005).
001300     02  WMJC-121        PIC  N(025).
001310     02  WMJC-122        PIC  X(025).
001320     02  WMJC-123        PIC  X(016).
001330     02  WMJC-124        PIC  X(001).
001340     02  WMJC-125        PIC  X(004).
001350     02  WMJC-126        PIC  N(008).
001360     02  WMJC-127        PIC  X(008).
001370     02  WMJC-128        PIC  X(004).
001380     02  WMJC-129        PIC  N(008).
001390     02  WMJC-130        PIC  X(008).
001400     02  WMJC-131        PIC  X(001).
001410     02  WMJC-132        PIC  X(001).
001420     02  WMJC-133        PIC  X(001).
001430     02  WMJC-134        PIC  X(001).
001440     02  WMJC-135        PIC  X(001).
001450     02  WMJC-136        PIC  X(001).
001460     02  WMJC-137        PIC  X(001).
001470     02  WMJC-138        PIC  X(001).
001480     02  WMJC-139        PIC  X(001).
001490     02  WMJC-140        PIC  X(001).
001500     02  WMJC-141        PIC  X(001).
001510     02  WMJC-142        PIC  X(001).
001520     02  WMJC-143        PIC  X(001).
001530     02  WMJC-144        PIC  X(001).
001540     02  WMJC-145        PIC  X(001).
001550     02  WMJC-146        PIC  X(001).
001560     02  WMJC-147        PIC  X(001).
001570     02  WMJC-148        PIC  X(001).
001580     02  WMJC-149        PIC  X(001).
001590     02  WMJC-150        PIC  9(010).
001600     02  WMJC-151        PIC  9(007)V99.
001610     02  WMJC-152        PIC  9(010).
001620     02  WMJC-153        PIC  9(007).
001630     02  WMJC-154        PIC  9(001).
001640     02  WMJC-155        PIC  9(004).
001650     02  WMJC-156        PIC  X(002).
001660     02  WMJC-157        PIC  9(002).
001670     02  WMJC-158        PIC  9(005)V9.
001680     02  WMJC-159        PIC  9(004).
001690     02  WMJC-160        PIC  X(001).
001700     02  WMJC-161        PIC  X(001).
001710     02  WMJC-162        PIC  X(001).
001720     02  WMJC-163        PIC  X(001).
