000010*********************************************
000020*****                                   *****
000030*****       伝票№検索ファイル　　　    *****
000040*****                       16/16       *****
000050*********************************************
000060 FD  JT-DNKN
000070     BLOCK 16 RECORDS
000080     LABEL RECORD IS STANDARD
000090     VALUE OF IDENTIFICATION "JT-DNKN".
000100 01  DNKN-R.
000110     02  DNKN-KEY.
000120       03  DNKN-01          PIC 9(01).                            倉庫ＣＤ
000130       03  DNKN-02          PIC 9(06).                            品名ＣＤ
000140       03  DNKN-03          PIC X(01).                            ﾚｺｰﾄﾞ区
000150       03  DNKN-04.
000160           04  DNKN-041     PIC 9(06).                            伝票№　
000170           04  DNKN-042     PIC 9(01).                            行№　　
000180     02  F              PIC X(01).
