000010***********************************
000020****** （個別）売上計上ワーク     *
000030******                ISAM        *
000040******                128/2       *
000050***********************************
000060 FD  JT-KUKW
000070     BLOCK    2     RECORDS
000080     LABEL    RECORD   STANDARD
000090     VALUE    OF  IDENTIFICATION   "JT-KUKW".
000100*
000110 01  KUKW-R.
000120     02   KUKW-KEY.                                               KEY
000130          03   KUKW-01           PIC 9(01).                       ﾚｺｰﾄﾞKBN
000140          03   KUKW-02           PIC 9(01).                       ﾃﾞｰﾀｸﾌﾞﾝ
000150          03   KUKW-03           PIC 9(06).                       日付
000160          03   KUKW-03R  REDEFINES   KUKW-03.                     日付
000170               04  KUKW-031          PIC 9(02).                   　年
000180               04  KUKW-032          PIC 9(02).                   　月
000190               04  KUKW-033          PIC 9(02).                   　日
000200          03   KUKW-04           PIC 9(06).                       送り状№
000210          03   KUKW-05.                                           出荷指図
000220               04  KUKW-051      PIC 9(06).                       №
000230               04  KUKW-052      PIC 9(01).                       行№
000240          03   KUKW-06           PIC 9(01).                       赤黒区分
000250     02   KUKW-07.                                                直送先CD
000260          03   KUKW-071          PIC 9(04).                       得意先CD
000270          03   KUKW-072          PIC 9(03).                       直送先CD
000280     02   KUKW-08                PIC 9(06).                       品名ｺｰﾄﾞ
000290     02   KUKW-09                PIC 9(01).                       ｻｲｽﾞ区分
000300     02   KUKW-10.                                                出荷数
000310          03   KUKW-101  OCCURS  10  PIC S9(04)   COMP-3.
000320     02   KUKW-11                PIC S9(06)       COMP-3.         合計数量
000330*****02   KUKW-12                PIC 9(04).                       D.941226
000340     02   F                      PIC X(04).                       I.941226
000350     02   KUKW-13                PIC 9(01).                       伝票区分
000360     02   KUKW-14                PIC 9(01).                       倉ｺｰﾄﾞ
000370     02   KUKW-15                PIC S9(03).                      個数
000380     02   KUKW-16.                                                受注
000390          03   KUKW-161          PIC 9(06).                       №
000400          03   KUKW-162          PIC 9(01).                       行№
000410     02   KUKW-17                PIC N(05).                       配達
000420     02   KUKW-18                PIC N(06).                       摘要
000430     02   KUKW-19                PIC X(01).                       品名更新
000440*****02   F                      PIC X(19).                       D.941226
000450     02   KUKW-12                PIC 9(05).                       I.941226
000460     02   F                      PIC X(14).                       I.941226
