000010 FD  JT-KW02
000020     BLOCK  32  RECORDS
000030     LABEL  RECORD  STANDARD
000040     VALUE  OF  IDENTIFICATION  "JT-KW02".
000050 01  KW02-R.
000060     03  KW02-01                PIC  9(01).                       óaÇËãÊï™
000070     03  KW02-KEY.
000080         05  KW02-02.
000090             07  KW02-021       PIC  9(06).                       óa/éÛ NO
000100             07  KW02-022       PIC  9(01).                       óa/éÛ çs
