000010*******************************************************************
000020*    　　　　　　　　　類似品マスタ                               *
000030*******************************************************************
000040 FD  JT-RUIJ
000050     BLOCK    16    RECORDS
000060     LABEL    RECORD   STANDARD
000070     VALUE    OF  IDENTIFICATION  "JT-RUIJ".                      16/16
000080*
000090 01  RUIJ-R.
000100     02   RUIJ-KEY.                                               KEY
000110          03   RUIJ-01           PIC 9(2).                        ｸﾌﾞﾝ　
000120          03   RUIJ-02           PIC 9(6).                        ﾋﾝｺｰﾄﾞ1
000130          03   RUIJ-03           PIC 9(6).                        ﾋﾝｺｰﾄﾞ2
000140     02   FILLER                 PIC X(2).
