000010*********************************************
000020*****                                   *****
000030*****       売上計上ファイル　　　　    *****
000040*****                      128/02       *****
000050*********************************************
000060 FD  JT-UKEF
000070     BLOCK 02 RECORDS
000080     LABEL RECORD IS STANDARD
000090     VALUE OF IDENTIFICATION "JT-UKEF".
000100 01  UKEF-R.
000110     02  UKEF-KEY.
000120       03  UKEF-01          PIC 9(06).                            売上伝№
000130       03  UKEF-02          PIC 9(01).                            行№
000140     02  UKEF-03            PIC 9(06).                            日付
000150     02  UKEF-03R  REDEFINES    UKEF-03.
000160       03  UKEF-031         PIC 9(02).                            年
000170       03  UKEF-032         PIC 9(02).                            月
000180       03  UKEF-033         PIC 9(02).                            日
000190     02  UKEF-04.                                                 直送先CD
000200       03  UKEF-041         PIC 9(04).                            得意先CD
000210       03  UKEF-042         PIC 9(03).                            直送先NO
000220     02  UKEF-05            PIC 9(06).                            品名CD
000230     02  UKEF-06            PIC 9(01).                            ｻｲｽﾞ区分
000240     02  UKEF-07.                                                 売上数
000250       03  UKEF-071  OCCURS 10  PIC S9(04)   COMP-3.
000260     02  UKEF-08            PIC S9(06)       COMP-3.              合計数量
000270*****02  UKEF-09            PIC  9(04).                           D.941226
000280     02  UKEF-09            PIC  9(05).                           I.941226
000290     02  UKEF-10            PIC S9(08)       COMP-3.              金額
000300     02  UKEF-11            PIC  9(01).                           調整区分
000310     02  UKEF-12            PIC  9(01).                           伝票区分
000320     02  UKEF-13            PIC  9(01).                           倉庫ｺｰﾄﾞ
000330     02  UKEF-14            PIC  9(01).                           消費税KB
000340     02  UKEF-15            PIC S9(03).                           個数
000350     02  UKEF-16.                                                 受注
000360       03  UKEF-161         PIC 9(06).                            №
000370       03  UKEF-162         PIC 9(01).                            行№
000380     02  UKEF-17.                                                 出荷指図
000390       03  UKEF-171         PIC 9(06).                            №
000400       03  UKEF-172         PIC 9(01).                            行№
000410     02  UKEF-18            PIC 9(06).                            送り状№
000420     02  UKEF-19            PIC N(05).                            配達
000430     02  UKEF-20            PIC N(06).                            摘要
000440     02  UKEF-21            PIC 9(01).                            更新区分
000450     02  UKEF-22            PIC X(01).                            A 911024
000460     02  UKEF-23            PIC 9(03).                            A 911106
000470*****02  FILLER             PIC X(04).                            D.941226
000480     02  FILLER             PIC X(03).                            I.941226
