000010 FD  JT-WK02                                                      ºﬁ≠¡≠≥
000020     BLOCK    1     RECORDS                                       ƒ◊›
000030     LABEL    RECORD   STANDARD
000040     VALUE    OF  IDENTIFICATION  WK0256ID.                       I.960206
000050*****VALUE    OF  IDENTIFICATION  JT-OWS256ID.                    D.960206
000060*
000070 01  W02-R.
000080     02   W02-01               PIC 9(06).                         éÛíçáÇ
000090     02   W02-02               PIC 9(01).                         çs
000100     02   W02-03               PIC 9(01).                         óaÇËãÊï™
000110     02   W02-04.                                                 îNåéì˙
000120*****     03  W02-041          PIC 9(02).                         D.980515
000130          03  W02-041          PIC 9(04).                         I.980515
000140          03  W02-041L  REDEFINES  W02-041.                       I.980529
000150              04  W02-0411     PIC 9(02).                         I.980529
000160              04  W02-0412     PIC 9(02).                         I.980529
000170          03  W02-042          PIC 9(02).                         åé
000180          03  W02-043          PIC 9(02).                         ì˙
000190     02   W02-05.
000200          03  W02-051          PIC 9(04).                         ìæà”êÊCD
000210          03  W02-052          PIC 9(03).                         íºëóêÊNO
000220     02   W02-06               PIC 9(06).                         ïiñº
000230     02   W02-06A              PIC 9(01).                         ª≤ΩﬁãÊï™
000240     02   W02-07.                                                 ª≤Ωﬁ
000250          03  W02-071.
000260              04  W02-0711     PIC S9(06)    OCCURS  10.          I.980604
000270*****         04  W02-0711 OCCURS 10  PIC S9(06) COMP-3.          D.980604
000280     02   W02-08.                                                 î[ä˙
000290*****     03  W02-081          PIC 9(02).                         D.980515
000300          03  W02-081          PIC 9(04).                         I.980515
000310          03  W02-082          PIC 9(02).                         åé
000320          03  W02-083          PIC 9(02).                         ì˙
000330     02   W02-08L   REDEFINES  W02-08.                            I.980604
000340          03  F                PIC 9(02).                         I.980604
000350          03  W02-08S          PIC 9(06).                         I.980604
000360*****02   W02-09               PIC 9(06) COMP-3.                  D.980604
000370*****02   W02-09               PIC 9(06).                         D.981126
000380     02   F                    PIC X(06).                         I.981126
000390     02   W02-10               PIC 9(01).                         ACTION
000400     02   W02-11               PIC N(32).                         ìEóv
000410     02   W02-12               PIC 9(03).                         SEQ-NO
000420*****02   W02-13               PIC X(01).                         D.981126
000430*****02   W02-14.                                                 D.980930
000440*****    03   W02-141          PIC 9(06).                         D.980930
000450*****    03   W02-142          PIC 9(01).                         D.980930
000460*****02   W02-15               PIC 9(04).                         D.941226
000470*****02   F                    PIC X(04).                         D.980515
000480*****02   FILLER               PIC X(07).                         D.981126
000490     02   FILLER               PIC X(08).                         I.981126
000500     02   W02-16               PIC S9(03).                        æØƒêî Å@
000510     02   W02-90               PIC 9(01).                         I.951206
000520*****02   FILLER               PIC X(73).                         D.941226
000530     02   W02-15               PIC 9(05).                         I.941226
000540     02   W02-17               PIC X(10).                         I.980604
000550     02   W02-23               PIC 9(04).                         I.100922
000550*****02   W02-23               PIC 9(03).                         D.100922
000560*****02   FILLER               PIC X(51).                         D.030715
000570*****02   FILLER               PIC X(50).                         D.080603
000580*****02   FILLER               PIC X(47).                         D.100922
000580     02   FILLER               PIC X(46).                         I.100922
000590     02   W02-JS               PIC 9(01).                         I.030715
000600     02   W02-891S.                                               I.981126
000610          03   W02-8911        PIC 9(02).                         I.981126
000620          03   W02-8912        PIC 9(02).                         I.981126
000630          03   W02-8913        PIC 9(02).                         I.981126
000640*****02   FILLER               PIC X(57).                         D.981126
000650*****02   FILLER               PIC X(89).                         D.980604
000660*****02   FILLER               PIC X(68).                         D.951206
000670*****02   FILLER               PIC X(67).                         D.980515
