000010 FD  JT-WK03                                                      º≠Ø∂ªºΩﬁ
000020     BLOCK    1     RECORDS                                       ƒ◊›
000030     LABEL    RECORD   STANDARD
000040     VALUE    OF  IDENTIFICATION  WK0256ID.                       I.960207
000050*****VALUE    OF  IDENTIFICATION  JT-OWS256ID.                    D.960207
000060*
000070 01  W03-R.
000080     02   W03-KEY.                                                KEY
000090          03   W03-01          PIC 9(6).                          º≠Ø∂ºΩﬁ
000100          03   W03-02          PIC 9(1).                          ∑ﬁÆ≥
000110     02   W03-03               PIC 9(1).                          √ﬁ›∏
000120     02   W03-04.                                                 º≠Ø∂Àﬁ ª
000130*****     03  W03-041          PIC 9(2).                          D.980515
000140          03  W03-041          PIC 9(4).                          I.980515
000150          03  W03-041L  REDEFINES  W03-041.                       I.980515
000160              04  W03-0411     PIC 9(2).                          I.980515
000170              04  W03-0412     PIC 9(2).                          I.980515
000180          03  W03-042          PIC 9(2).                          ¬∑
000190          03  W03-043          PIC 9(2).                          À
000200     02   W03-05.                                                 º≠Ø∂Àﬁºﬁ
000210*****     03  W03-051          PIC 9(2).                          D.980515
000220          03  W03-051          PIC 9(4).                          I.980515
000230          03  W03-051L  REDEFINES  W03-051.                       I.980515
000240              04  W03-0511     PIC 9(2).                          I.980515
000250              04  W03-0512     PIC 9(2).                          I.980515
000260          03  W03-052          PIC 9(2).                          ¬∑
000270          03  W03-053          PIC 9(2).                          À
000280     02   W03-06.                                                 ¡Æ∏ø≥ CD
000290          03  W03-061          PIC 9(4).                          ƒ∏≤∫∞ƒﬁ
000300          03  W03-062          PIC 9(3).                          ¡Æ∏ NO
000310     02   W03-07               PIC 9(1).                          ∏◊ ∫∞ƒﬁ
000320     02   W03-08.                                                 ºﬁ≠¡≠≥
000330          03  W03-081          PIC 9(6).                          ºﬁ≠¡≠≥NO
000340          03  W03-082          PIC 9(1).                          ∑ﬁÆ≥
000350     02   W03-09               PIC 9(6).                          À›∫∞ƒﬁ
000360     02   W03-10               PIC 9(1).                          ª≤Ωﬁ∏Ãﬁ›
000370     02   W03-11.                                                 º≠Ø∂ªºΩﬁ
000380          03  W03-111    OCCURS  10.                              ª≤ΩﬁÕﬁ¬
000390              04  W03-1111     PIC S9(4).
000400          03  W03-112          PIC S9(5).                         I.981006
000410*****     03  W03-112          PIC S9(6).                         D.981006
000420     02   W03-12.                                                 º≠Ø∂ºﬁ¬
000430          03  W03-121    OCCURS  10.                              ª≤ΩﬁÕﬁ¬
000440              04  W03-1211     PIC S9(4).
000450          03  W03-122          PIC S9(5).                         I.981006
000460*****     03  W03-122          PIC S9(6).                         D.981006
000470     02  W03-13                PIC 9(1).                          ±Ωﬁ∂ÿ KB
000480     02  W03-14                PIC 9(1).                          â^ëóÇbÇc
000490     02  W03-14A               PIC 9(3).                          ÉZÉbÉgêî
000500     02  W03-14B               PIC 9(6).                          ëóÇËèÛáÇ
000510     02  W03-14C               PIC 9(2).                          é}î‘
000520*****02  FILLER                PIC X(3).                          D.981006
000530*****02  FILLER                PIC X(2).                          D.980930
000540*****02  W03-99                PIC 9(01).                         D.980930
000550     02  W03-14D               PIC N(9).                          îzíB
000560     02  W03-15                PIC N(23).                         ìEóv
000570     02  W03-20                PIC X(10).                         I.981006
000580     02  W03-15A               PIC S9(03).                        å¬êî
000590     02  FILLER                PIC X(27).                         I.981006
000600*****02  FILLER                PIC X(32).                         D.981006
000610*****02  W03-18.                                                  D.980930
000620*****    03  W03-181           PIC 9(6).                          D.980930
000630*****    03  W03-182           PIC 9(1).                          D.980930
000640*****02  FILLER                PIC X(25).                         D.980930
000650*****02  FILLER                PIC X(29).                         D.980515
000660     02  W03-158               PIC 9(01).                         A-890811
000670     02  W03-16                PIC 9(01).                         àÍî ã≥àÁ
000680     02  W03-17                PIC 9(01).                         çXêVª≤›
