000010*****　受注数合計ワーク（月得意先品名別）　*******************************
000020 FD  JT-WK07
000030     BLOCK  2 RECORDS
000040     LABEL RECORD IS STANDARD
000050     VALUE OF IDENTIFICATION  WK0128ID.
000060 01  WK07-R.
000070     02  WK07-01.                                                 年月
000080       03  WK07-011         PIC 9(02).                            年
000090       03  WK07-012         PIC 9(02).                            月
000100     02  WK07-02            PIC 9(04).                            得意先
000110     02  WK07-03            PIC 9(06).                            品名
000120     02  WK07-04            PIC 9(01).                            ｻｲｽﾞ
000130     02  WK07-05.                                                 受注数
000140       03  WK07-051  OCCURS 10.
000150         04  WK07-0511      PIC S9(06).
000160     02  FILLER             PIC X(53).                            FILLER
