000010 FD  JT-WK04
000020     BLOCK    1     RECORDS
000030     LABEL    RECORD   STANDARD
000040     VALUE    OF  IDENTIFICATION   WK0256ID.                      I.960209
000050*****VALUE    OF  IDENTIFICATION   JT-OWS256ID.                   D.960209
000060*
000070 01  WK04-R.
000080     02   WK04-01                  PIC 9(1).                      ±½Þ¶Ø
000090     02   WK04-02.                                                ¼Þ­Á­³ËÞ
000100*****     03   WK04-021            PIC 9(2).                      D.980515
000110          03   WK04-021            PIC 9(4).                      I.980515
000120          03   WK04-022            PIC 9(2).                      Â·
000130          03   WK04-023            PIC 9(2).                      Ë
000140     02   WK04-KEY3.
000150          03   WK04-03             PIC 9(6).                      ËÝº°ÄÞ
000160          03   WK04-KEY2.
000170              04   WK04-04         PIC 9(4).                      Ä¸²º°ÄÞ
000180              04   WK04-05         PIC 9(6).                      ËÝº°ÄÞ
000190              04   WK04-06.                                       É³·
000200*****             05   WK04-061    PIC 9(2).                      D.980515
000210                  05   WK04-061    PIC 9(4).                      I.980515
000220                  05   WK04-062    PIC 9(2).                      Â·
000230                  05   WK04-063    PIC 9(2).                      Ë
000240              04   WK04-KEY1.
000250                  05   WK04-07     PIC 9(6).                      ¼Þ­Á­³NO
000260                  05   WK04-08     PIC 9(1).                      ·Þ®³ NO
000270     02   WK04-09                  PIC 9(1).                      »²½Þ¸ÌÞÝ
000280     02   WK04-10                  PIC 9(3).                      Á®¸¿³ NO
000290     02   WK04-11.                                                ¼Þ­Á­³½³
000300          03   WK04-111            OCCURS  10.                    »²½ÞÍÞÂ
000310              04   WK04-1111       PIC S9(6)   COMP-3.
000320     02   WK04-12.                                                ¼­¯º½³
000330          03   WK04-121            OCCURS  10.                    »²½ÞÍÞÂ
000340              04   WK04-1211       PIC S9(6)   COMP-3.
000350     02   WK04-14.                                                ¾ÞÝ¹ÞÂÏÂ
000360          03   WK04-141  OCCURS 10 PIC S9(06)  COMP-3.            »²½ÞÍÞÂ
000370     02   WK04-15.                                                ¼­¯¶»¼½Þ
000380          03   WK04-151  OCCURS 10 PIC S9(06)  COMP-3.            »²½ÞÍÞÂ
000390     02   WK04-16                  PIC S9(03).                    ¾¯Ä½³
000400     02   WK04-801                 PIC N(06).                     I.040803
000410*****02   F                        PIC X(12).                     D.040803
000420*****02   WK04-17                  PIC 9(04).                     D.941226
000430*****02   F                        PIC X(04).                     D.981027
000440*****02   WK04-18                  PIC 9(01).                     D.981027
000450*****02   F                        PIC X(07).                     D.981027
000460*****02   WK04-19.                                                D.981005
000470*****    03    WK04-191            PIC 9(06).                     D.981005
000480*****    03    WK04-192            PIC 9(01).                     D.981005
000490     02   WK04-20                  PIC 9(03).                     ÍÝº³NO.
000500*****02   FILLER                   PIC X(32).                     D.941226
000510     02   WK04-17                  PIC 9(05).                     I.941226
000520*****02   FILLER                   PIC X(27).                     D.980515
000530*****02   FILLER                   PIC X(21).                     D.010201
000540     02   WK04-22                  PIC X(10).                     I.010201
000550     02   WK04-802                 PIC N(04).                     I.040803
000560     02   WK04-802D   REDEFINES  WK04-802.                        I.080603
000570          03   WK04-803            PIC N(02).                     I.080603
000580          03   WK04-23             PIC 9(04).                     I.100923
000590*****     03   F                   PIC X(01).                     D.100923
000600*****     03   WK04-23             PIC 9(03).                     D.100923
000610*****02   FILLER                   PIC X(08).                     D.040803
000620     02   WK04-88                  PIC 9(01).                     I.010201
000630     02   WK04-89                  PIC 9(01).                     I.010201
000640     02   WK04-90                  PIC 9(01).                     I.010201
000650     02   WK04-91                  PIC 9(02).                     ÀÝÄ³
000660     02   WK04-99.                                                ”NŒŽ“x
000670*****    03    WK04-991            PIC 9(02).                     D.980515
000680         03    WK04-991            PIC 9(04).                     I.980515
000690         03    WK04-992            PIC 9(02).                     ŒŽ
