000010***************************************
000020*    ¥◊∞ DISPLAY (‹∞∏)                *                           85.01.24
000030***************************************
000040 01  DISP-ERR-WORK.
000050     02  DISP-MSG.
000060         03  ERR-MSGX.
000070             04  ERR-MSGN     PIC N(30).
000080         03  ERR-SPACE        PIC X(60).
000090         03  ERR-SPACES       PIC X(40).                          I.980122
000100         03  ERR-F            PIC X(12).
000110         03  ERR-M            PIC X(01).
000120         03  ERR-K            PIC X(30).
000130         03  ERR-FLG          PIC X(02).
000140     02  ERR-LIN              PIC 9(02).                          A-890816
000150 01  WKUB-KEY.
000160     02  WKUB-01              PIC  9(02).                         éÌóﬁ
000170     02  WKUB-02              PIC  9(02).                         ãÊï™
000180 01  IPN-KYO-KBN              PIC  9(01).                         A-910927
000190***  ÇiÇrÅ|ÇrÇhÇfÇmÇÊÇËÇÃàÍî Å^ã≥àÁãÊï™
