000010*******************************************************************
000020*    ÉTÉCÉYÉRÅ[ÉhÉeÅ[ÉuÉã                                         *
000030*******************************************************************
000040 01  SIZE-CD-TBL.
000050     02  F  PIC X(30) VALUE "001002010011012013014280290300".
000060     02  F  PIC X(30) VALUE "125130135140150160170180190200".
000070     02  F  PIC X(30) VALUE "210215220225230235240245250000".
000080     02  F  PIC X(30) VALUE "240245250255260265270275000000".
000090 01  F   REDEFINES SIZE-CD-TBL.
000100     02  SIZE-CD-T1     OCCURS  04.
000110         03  SIZE-CD    PIC  9(03)  OCCURS  10.
000120*******************************************************************
000130*    ÉTÉCÉYñºèÃÉeÅ[ÉuÉã                                           *
000140*******************************************************************
000150 01  SIZE-NM-TBL.
000160     02  F  PIC N(40) VALUE
000170       NC"Å@Å@Å@Å@Å@Å@Å@Å@ÇrÇrÅ@Å@ÇrÅ@Å@Å@ÇlÅ@Å@Å@"
000180-        "ÇkÅ@Å@Å@ÇkÇkÅ@Å@ÇwÇkÅ@Å@ÇwÇwÇkÅ@ÇRÇOÅDÇO".
000190     02  F  PIC N(40) VALUE
000200       NC"ÇPÇQÅDÇTÇPÇRÅDÇOÇPÇRÅDÇTÇPÇSÅDÇOÇPÇTÅDÇO"
000210-        "ÇPÇUÅDÇOÇPÇVÅDÇOÇPÇWÅDÇOÇPÇXÅDÇOÇQÇOÅDÇO".
000220     02  F  PIC N(40) VALUE
000230       NC"ÇQÇPÅDÇOÇQÇPÅDÇTÇQÇQÅDÇOÇQÇQÅDÇTÇQÇRÅDÇO"
000240-        "ÇQÇRÅDÇTÇQÇSÅDÇOÇQÇSÅDÇTÇQÇTÅDÇOÅ@Å@Å@Å@".
000250     02  F  PIC N(40) VALUE
000260       NC"ÇQÇSÅDÇOÇQÇSÅDÇTÇQÇTÅDÇOÇQÇTÅDÇTÇQÇUÅDÇO"
000270-        "ÇQÇUÅDÇTÇQÇVÅDÇOÇQÇVÅDÇTÅ@Å@Å@Å@óaÇËÅ@Å@".
000280     02  F  PIC N(40) VALUE
000290       NC"ÇRçÜÅ@Å@ÇQçÜÅ@Å@ÇPçÜÅ@Å@ÇOçÜÅ@Å@íÜÅ@Å@Å@"
000300-        "ëÂÅ@Å@Å@ì¡ëÂÅ@Å@ÇQÇWÅDÇOÇQÇXÅDÇOÇRÇOÅDÇO".
000310 01  F   REDEFINES SIZE-NM-TBL.
000320     02  SIZE-NM-T1     OCCURS  05.
000330         03  SIZE-NM    PIC  N(04)  OCCURS  10.
000340*******************************************************************
000350*    ÉTÉCÉYÉèÅ[ÉN                                                 *
000360*******************************************************************
000370 01  SIZE-WK.
000380     02  SIZE-WK-HIN    PIC  9(06).                               ïiñº∫∞ƒﬁ
000390     02  SIZE-WK-CD     PIC  9(03).                               ª≤Ωﬁ∫∞ƒﬁ
000400     02  SIZE-WK-KB     PIC  9(01).                               ª≤ΩﬁãÊï™
000410     02  SIZE-WK-NM     PIC  N(04).                               ª≤ΩﬁñºèÃ
000420     02  SIZE-WK-II     PIC  9(01).
000430     02  SIZE-WK-JJ     PIC  9(02).
000440     02  SIZE-WK-SW     PIC  9(01).
