SCREEN SCHK51                                                              00010
ARE (01,24)_                                                               00020
CON (01,11) "＊＊＊　　得意先マスター　メンテナンス　　＊＊＊"_            00030
CON (03,09) "登録=1 修正=2 削除=3 作表=4 ALL修正=5 終了=9   ﾘﾀｰﾝ"_         00040
CON (05,04) "ｺｰﾄﾞ"_  CON (05,15) "得意先名"_                               00050
UND (05,03) (,72)_                                                         00060
BOX (07,05) (19,64)_ UND (07,05) (19,64)_                                  00070
VER (07,15) (19)_  VER (11,30)_ VER (11,41)_                               00080
VER (07,30)_ VER (07,41)_                                                  00090
VER (17,30) (19)_  VER (17,41) (19)_                                       00100
CON (07,06) "作表区分"_  CON (07,31) NC"台　帳　№"_                       00110
CON (08,06) "住所 (上)"_ CON (09,11) "(下)"_                               00120
CON (10,06) "郵便番号"_                                                    00130
CON (11,06) "電話番号"_                                                    00140
CON (11,31) "ＦＡＸ番号"_                                                  00150
CON (12,06) "部門ｺｰﾄﾞ"_                                                    00160
CON (13,06) "地区ｺｰﾄﾞ"_                                                    00170
CON (14,06) "担当ｺｰﾄﾞ"_                                                    00180
CON (15,06) "府県ｺｰﾄﾞ"_                                                    00190
CON (16,06) "価格ﾗﾝｸ"_                                                     00200
CON (17,06) "請求締日"_  CON (17,31) "入金予定日"_                         00210
CON (18,06) "与信限度"_                                                    00220
CON (18,31) "備考区分"_  CON (18,47) "(入力可=1)"_                         00230
CON (19,06) "開始年月"_                                                    00240
CON (19,31) "停止年月"_                                                    00250
CON (23,24) "確認  OK=1 NO=9   ﾘﾀｰﾝ"_                                      00260
END_                                                                       00270
