SCREEN  SJ055R                                                             00010
ARE (01,24)_                                                               00020
BOX (01,30) (,51)_                                                         00030
CON (01,31) NC"荷札・入日記　問合せ"_                                      00040
UND (03,01) (,80)_        UND (04,01) (,80)_        UND (23,01) (,80)_     00050
CON (03,01) "倉庫:"_                                                       00060
CON (04,01) "荷札№　月日 直　送　先　名"_                                 00070
CON (04,57) "運　送　名   送り状 発行"_                                    00080
CON (24,41) "確認 (NEXT=1,NO=9) -->   ﾘﾀｰﾝ"_                               00090
END_                                                                       00100
