SCREEN      SJK044                                                         00010
MODE        K25                                                            00020
AREA        (01,24)_                                                       00030
OVE (03,01) (04,80)_    UND (03,01) (22,80)_                               00040
CON (01,24) NC"ê‘ÇøÇ·ÇÒñ{ï‹Å@ìùàÍì`ï[áÇÅ@ñ‚çáÇπ"_                          00050
CON (03,01) NC"é–ìX"_            CON (03,05) "∫∞ƒﬁ"_                       00060
CON (03,09) NC"é–ìXñº"_                                                    00070
CON (03,38) NC"ì`ï[áÇ"_          CON (03,45) NC"î≠íçáÇ"_                   00080
CON (03,56) NC"î≠íçì˙"_          CON (03,65) NC"î[ïiì˙"_                   00090
CON (03,77) NC"ì`ï["_                                                      00100
CON (23,41)   "ämîFÅiNEXT=1,NO=9Åj-->"_                                    00110
CON (23,66)   "ÿ¿∞›"_                                                      00120
END_                                                                       00130
