SCREEN      SJK040                                                         00010
MODE        K25                                                            00020
ARE (01,24)_                                                               00030
UND (02,01)(,80)_               VER (03,42)(11)_                           00040
UND (11,01)(,80)_                                                          00050
UND (09,20)(,42)_               UND (09,60)(,80)_                          00060
UND (22,01)(,80)_                                                          00070
CON (01,21)  NC"＊＊　未処理データ問合せ　＊＊"_                           00080
CON (04,01)  NC"Ｏ／Ｌ受信データ　　Ｃ／Ｆ"_                               00090
CON (04,43)  NC"Ｏ／Ｌ送信データ　Ｃ／Ｆ"_                                 00100
CON (05,21)  NC"直送先"_                 CON (05,61)  NC"直送先"_          00110
CON (06,21)  NC"品　名"_                 CON (06,61)  NC"品　名"_          00120
CON (07,21)  NC"出荷指図"_               CON (07,61)  NC"出荷指図"_        00130
CON (08,21)  NC"荷　札"_                 CON (08,61)  NC"荷　札"_          00140
CON (09,21)  NC"送り状"_                 CON (09,61)  NC"送り状"_          00150
CON (10,23)  NC"計"_                     CON (10,63)  NC"計"_              00160
CON (12,01)  NC"出荷指図　未発行　－－－－＞"_                             00170
CON (14,01)  NC"荷　　札　未発行　－－－－＞"_                             00180
CON (16,01)    "送 り 状　未発行　－－－－＞"_                             00190
CON (24,41)  NC"確認"_                                                     00200
END_                                                                       00210
