SCREEN      SJK043                                                         00010
MODE        K25                                                            00020
AREA        (01,24)_                                                       00030
UND (02,01) (,80)_      UND (04,01) (,80)_      OVE (05,01) (,80)_         00040
UND (06,01) (,80)_      UND (08,01) (,80)_      UND (10,01) (,80)_         00050
UND (12,01) (,80)_      UND (14,01) (,80)_      UND (16,01) (,80)_         00060
UND (18,01) (,80)_      UND (20,01) (,80)_      UND (22,01) (,80)_         00070
CON (01,32) NC"ìùàÍì`ï[áÇÅ@ñ‚çáÇπ"_                                        00080
CON (03,02) NC"é–"_              CON (03,04) "∫∞ƒﬁ"_                       00090
CON (03,11) NC"ì`ï[áÇ"_          CON (03,19) NC"é–Å@ñº"_                   00100
CON (04,02) NC"ìX"_              CON (04,04) "∫∞ƒﬁ"_                       00110
CON (04,23) NC"ìXÅ@ñº"_                                                    00120
CON (04,45) NC"î≠íçì˙"_          CON (04,54) NC"î[ïiì˙"_                   00130
CON (04,62) NC"ëqå…ñº"_          CON (04,75) NC"î≠çs"_                     00140
CON (23,41)   "ämîFÅiNEXT=1,NO=9Åj-->"_                                    00150
CON (23,66)   "ÿ¿∞›"_                                                      00160
END_                                                                       00170
