MOD K25                                                                    00010
ARE(1,24)_                                                                 00020
UND( 2, 1)(,80)_                                                           00030
UND( 3, 1)(,80)_                                                           00040
UND( 5, 1)(,80)_                                                           00050
VER( 3,30)(5)_                                                             00060
VER( 3,52)(5)_                                                             00070
CON( 1,20)NC"＊　出荷実績データ受信　＊"_                                  00080
CON( 1,51)  "送信元：( )"_                                                 00090
CON( 3, 5)NC"デ　ー　タ　名"_                                              00100
CON( 3,36)NC"データ件数"_                                                  00110
CON( 3,60)NC"受信件数"_                                                    00120
CON( 5, 1)NC"出　荷　実　績"_                                              00130
CON( 5,44)NC"件"_  CON( 5,68)NC"件"_                                       00140
CON(24,41)NC"確認"_                                                        00150
CON(24,46)NC"（ＯＫ＝１，キャンセル＝９）"_                                00160
CON(24,76)  "( )"_                                                         00170
END_                                                                       00180
